{"data": {"product_id": 48248, "product_name": "eSputnik", "product_logo": "https://images.g2crowd.com/uploads/product/image/large_detail/large_detail_170439dbf02b9fb798e7dbf8a3d1aba3/esputnik.png", "g2_link": "https://www.g2.com/products/esputnik/reviews", "what_is": "eSputnik is an omnichhannel customer data platform (CDP) that allows to manage cross-channel messaging campaigns via Email, web and mobile push, in-app, app inbox, widgets in a single system, segment audience according to the customer's interestes, create product recommendations based on client's behaviour and easily automate all your marketing activities.\n\nFeatures for advanced eCommerce projects:\n- Dynamic content depending on stock availability, geo, browsing history or by feed.\n- AI-based personalized product recommendations: 198 ready and tested algorithms for recommendation generation are included in the system, custom development is possible.\n- Advanced segmentation: by user behavior, events, parameters, RFM analysis, cohort analysis, predictive segmentation, value-based customer segmentation.\n- 15 pro-triggers for ecommerce - created segments and events, campaign timeframes. \n- Multilanguage allows to automate work with scripts, templates, scheduling of mailings.\n- Conditional dynamic blocks targeted on additional data enrichment.\n- Dynamic message content queue prioritization based on previous behavior.\n- Messaging frequency control. \n- High server/ip reputation for inbox deliverability.\n-   High delivery speed for flash sales.", "product_description": "eSputnik is a web-based marketing automation service designed to allow users to manage cross-channel messaging campaigns via Email, SMS, Web Push, Viber and other instant messengers.", "positioning_against_competitor": null, "reviews": 62, "rating": 4.8, "medal_image": null, "category": {"name": "Marketing Automation Software", "link": "https://www.g2.com/categories/marketing-automation"}, "parent_category": null, "company_id": 37807, "seller": "eSputnik", "company_phone": null, "company_location": "Warsaw, PL", "company_founded_year": 2013, "company_annual_revenue": null, "total_revenue_usd_mm": null, "company_ownership": null, "discussions_link": "https://www.g2.com/products/esputnik/discuss", "supported_languages": "Bulgarian, English, Romanian, Russian, Ukrainian", "services_offered": null, "twitter": "https://twitter.com/esputnikapp", "number_of_followers_on_twitter": 341, "linkedin": "https://www.linkedin.com/company/17976276/", "number_of_employees_on_linkedin": 72, "product_website": null, "company_website": null, "is_claimed": true, "categories": [{"name": "Marketing Automation", "link": "https://www.g2.com/categories/marketing-automation"}, {"name": "Customer Data Platform (CDP)", "link": "https://www.g2.com/categories/customer-data-platform-cdp"}, {"name": "Push Notification", "link": "https://www.g2.com/categories/push-notification"}], "screenshots": [], "videos": [], "download_links": [], "pricing_plans": [{"plan_name": "FREE", "plan_price": "$0.00\n2500 Emails", "plan_description": "Get started for free. No credit card required. After a sign-up, you receive 2,500 emails and 10 SMS to test the service. We can also create one free email template designed in the corporate style of your website. ", "plan_features": ["free individual email template design;", "free subscription form;", "free package with 2500 emails and 10 SMS;", "free web push notifications;", "convenient drag and drop email builder;", "clickmap;", "campaign reports;"]}, {"plan_name": "ENTERPRISE", "plan_price": "Contact Us\n500000 Contacts", "plan_description": "Request a demo on our site and we'll call you back asap for further details. ", "plan_features": ["bulk email campaigns;", "personalized web pusn notifications;", "advanced segmentation;", "omnichannel workflows;", "customer data collection;", "website tracking and website recommendations;", "triggered messages;", "bulk Viber campaigns;", "email marketing agency;", "bulk SMS campaigns;", "AI-supported analysis;", "multilingual campaigns;"]}, {"plan_name": "OPTIMAL", "plan_price": "$78.00\n25000 Contacts Per Month", "plan_description": "Unlimited messages and web push notifications. Optimal Package is valid for 30 consecutive days from the date of activation.\n\n$35/month - up to 10,000 contacts;\n$78/month - up to 25,000 contacts;\n$135/month - up to 50,000 contacts;\n$450/month - up to 250,000 contacts; ", "plan_features": ["everything in free, plus", "unlimited emails;", "25000 contacts;", "automation workflows;", "segmentation features;"]}], "alternatives": [{"name": "Omnisend", "link": "https://www.g2.com/products/omnisend/reviews", "rating": 4, "reviews": 891}, {"name": "Emarsys", "link": "https://www.g2.com/products/emarsys/reviews", "rating": 4, "reviews": 420}, {"name": "OneSignal", "link": "https://www.g2.com/products/onesignal/reviews", "rating": 4, "reviews": 787}], "comparisons": [{"link": "https://www.g2.com/compare/omnisend-vs-esputnik", "name": "Omnisend", "logo": "https://images.g2crowd.com/uploads/product/image/small_square/small_square_9bc9585e6c663c9e8193123c3c89d203/omnisend.gif"}, {"link": "https://www.g2.com/compare/intuit-mailchimp-vs-esputnik", "name": "Intuit Mailchimp", "logo": "https://images.g2crowd.com/uploads/product/image/small_square/small_square_8e123398655ea08944802dc11fbc74e6/intuit-mailchimp.png"}], "features": [{"name": "Email Marketing", "features": ["Building and Personalizing Emails", "Sending Outbound Emails", "Manage Email Deliverability", "Automated Email Responses"]}, {"name": "Online Marketing", "features": ["Dynamic Content", "A/B Testing", "Mobile Optimized"]}, {"name": "Lead Management", "features": ["Segmentation", "Lead Scoring and Grading", "Online Behavior Tracking", "Automated Alerts and Tasks"]}, {"name": "Campaign Management", "features": ["Program Management"]}, {"name": "Reporting & Analytics", "features": ["Basic Reporting", "Web Analytics", "ROI Analytics"]}], "detailed_features": [{"name": "Integration", "features": [{"name": "Data Import & Export Tools", "content": "Ability to input, modify and extract data from the application in bulk through a structured file.", "percentage": null, "based_on_number_of_reviews": null}, {"name": "Integration APIs", "content": "Application Programming Interface - Specification for how the application communicates with other software.  API's typically enable integration of data, logic, objects, etc with other software applications.", "percentage": null, "based_on_number_of_reviews": null}, {"name": "Breadth of Partner Applications", "content": "To what extent are there partner applications readily available for integrating into this product?  Partner applications typically provide complementary, best of breed functionality not offered natively in this product.", "percentage": null, "based_on_number_of_reviews": null}]}, {"name": "Platform", "features": [{"name": "Customization", "content": "System provides sufficient customization to meet business requirements", "percentage": null, "based_on_number_of_reviews": null}, {"name": "Workflow Capability", "content": "Automates a process that requires a series of steps that typically require intervention by a several different users.  Administrators can write rules to determine who and when a user needs to complete a step.  Also includes notification of users when they need to take action.", "percentage": null, "based_on_number_of_reviews": null}, {"name": "User, Role, and Access Management", "content": "Grant access to select data, features, objects, etc. based on the users, user role, groups, etc.", "percentage": null, "based_on_number_of_reviews": null}, {"name": "Internationalization", "content": "Enables users to view and transact business with the same content in multiple languages and currencies.", "percentage": null, "based_on_number_of_reviews": null}, {"name": "Sandbox / Test Environments", "content": "Allows administrators to easily develop and test changes to the CRM deployment.  After changes are made admins can easily migrate the changes into the \"live\" or \"production\" environment.", "percentage": null, "based_on_number_of_reviews": null}, {"name": "Performance and Reliability", "content": "Software is consistently available (uptime) and allows users to complete tasks quickly because they are not waiting for the software to respond to an action they took.", "percentage": null, "based_on_number_of_reviews": null}, {"name": "Output Document Generation", "content": "Allows adminstrators to create templates that enable users to quickly generate dynamic documents in various formats based on the data stored in the application.", "percentage": null, "based_on_number_of_reviews": null}]}, {"name": "Email Marketing", "features": [{"name": "Building and Personalizing Emails", "content": "Based on 46 eSputnik reviews and verified by the G2 Product R&D team. Create and design emails with an editor; manage templates; personalize dynamically", "percentage": 92, "based_on_number_of_reviews": 46}, {"name": "Sending Outbound Emails", "content": "Based on 38 eSputnik reviews and verified by the G2 Product R&D team. Create targeted lists, schedule and manage bulk email sending.", "percentage": 96, "based_on_number_of_reviews": 38}, {"name": "Manage Email Deliverability", "content": "Based on 44 eSputnik reviews and verified by the G2 Product R&D team. Ensure inbox delivery. Includes opt-in management, bounce handling, unsubscribe processing, suppression lists, email preview, spam checking, link validation, and delivery monitoring.", "percentage": 96, "based_on_number_of_reviews": 44}, {"name": "Automated Email Responses", "content": "Based on 45 eSputnik reviews and verified by the G2 Product R&D team. Set up automated nurturing emails based on events, online activities, and lead scores", "percentage": 94, "based_on_number_of_reviews": 45}]}, {"name": "Online Marketing", "features": [{"name": "Landing Pages and Forms", "content": "Based on 16 eSputnik reviews and verified by the G2 Product R&D team. Build customized landing pages and lead capture forms for specific marketing campaigns to maximize conversion and to capture the right qualifying information.", "percentage": 90, "based_on_number_of_reviews": 16}, {"name": "Dynamic Content", "content": "Based on 40 eSputnik reviews and verified by the G2 Product R&D team. Dynamically customize emails, forms, and landing pages for specific segments of customers and prospects.", "percentage": 97, "based_on_number_of_reviews": 40}, {"name": "A/B Testing", "content": "Based on 41 eSputnik reviews and verified by the G2 Product R&D team. Test alternate versions of emails, landing pages, and forms. Learn what works, maximize response rates, and increase conversion.", "percentage": 90, "based_on_number_of_reviews": 41}, {"name": "Mobile Optimized", "content": "Based on 42 eSputnik reviews and verified by the G2 Product R&D team. Support mobile-optimized emails, online forms, and landing pages.", "percentage": 95, "based_on_number_of_reviews": 42}, {"name": "Search Tracking and Optimization", "content": "Based on 26 eSputnik reviews and verified by the G2 Product R&D team. Track performance of keywords and links in major search engines.  Measure search rankings and performance.  Improve page-level SEO with tools to diagnose and improve page performance.  Integrate with Google AdWords.", "percentage": 91, "based_on_number_of_reviews": 26}]}, {"name": "Lead Management", "features": [{"name": "Marketing Lead Database", "content": "Based on 23 eSputnik reviews and verified by the G2 Product R&D team. A marketing lead database is the system of record for your most important marketing asset: your leads and contacts. Includes a view of all marketing interactions between each prospect and your company, including website visits, email clicks, scoring changes, and data updates/history.", "percentage": 89, "based_on_number_of_reviews": 23}, {"name": "Data Quality Management", "content": "Based on 29 eSputnik reviews and verified by the G2 Product R&D team. Data quality consists of deduplication, cleansing, and appending your marketing database.", "percentage": 95, "based_on_number_of_reviews": 29}, {"name": "Segmentation", "content": "Based on 45 eSputnik reviews and verified by the G2 Product R&D team. Segment your database and build list of target leads and contacts.  Filter on demographic and company attributes (title, company size, location) as well as behavioral filters and CRM information.", "percentage": 97, "based_on_number_of_reviews": 45}, {"name": "Lead Scoring and Grading", "content": "Based on 36 eSputnik reviews and verified by the G2 Product R&D team. Automatically qualify and score leads based on demographics as well as prospect online behaviors, including recency and frequency. Assign your own weights to determine lead scores for prioritization.", "percentage": 95, "based_on_number_of_reviews": 36}, {"name": "Lead Nurturing", "content": "Based on 30 eSputnik reviews and verified by the G2 Product R&D team. Automate drip marketing campaigns that send relevant messages over time, based on prospect behaviors and pre-defined campaign steps.", "percentage": 90, "based_on_number_of_reviews": 30}, {"name": "Online Behavior Tracking", "content": "Based on 42 eSputnik reviews and verified by the G2 Product R&D team. Track which emails a prospect opens and clicks, what web-pages they visit, what keywords they use, even what they say on social networks.", "percentage": 96, "based_on_number_of_reviews": 42}, {"name": "Automated Alerts and Tasks", "content": "Based on 41 eSputnik reviews and verified by the G2 Product R&D team. Create tasks automatically and provide real-time sales alerts over email, RSS or mobile device.", "percentage": 93, "based_on_number_of_reviews": 41}, {"name": "CRM Lead Integration", "content": "Based on 29 eSputnik reviews and verified by the G2 Product R&D team. Sync lead, contact, account, and opportunity information with your CRM system.", "percentage": 93, "based_on_number_of_reviews": 29}]}, {"name": "Campaign Management", "features": [{"name": "Program ManagementView full feature definition", "content": "Based on 34 eSputnik reviews and verified by the G2 Product R&D team. Manage marketing campaigns and programs across multiple channels, including online ads, video campaigns, mobile, virtual events, and social media. Create and optimize program assets such as landing pages, emails, campaigns, and lists. Track program objectives, results, and costs to assess the program ROI.", "percentage": 93, "based_on_number_of_reviews": 34}, {"name": "Event / Webinar Marketing", "content": "Based on 29 eSputnik reviews and verified by the G2 Product R&D team. Streamline the entire event process, including personalized invitations, registration, reminders, and post-event follow-up.  Integrate with online meeting tools like WebEx, Adobe Connect, GoToWebinar.", "percentage": 97, "based_on_number_of_reviews": 29}, {"name": "Calendaring", "content": "Maintain a marketing calendar across multiple groups. Manage the calendar for the entire marketing department, from promotions to content to PR. 28 reviewers of eSputnik have provided feedback on this feature.", "percentage": 96, "based_on_number_of_reviews": 28}, {"name": "Budgeting", "content": "As reported in 28 eSputnik reviews. Manage all aspects of marketing investments, including assigning top-down budgets to various groups and divisions, planning marketing spending across programs, tracking open-to-spend, ensuring budget compliance, coordinating work-flows and permissions, and reconciling plans with actual invoices.", "percentage": 95, "based_on_number_of_reviews": 28}]}, {"name": "Social", "features": [{"name": "Social Listening", "content": "Monitor what leads and contacts say on sites such as Facebook, Twitter, YouTube, LinkedIn, blogs, and online communities.  Incorporate into your lead and customer DB and use social insights to segment prospects.  Trigger campaigns, and update lead scores. 14 reviewers of eSputnik have provided feedback on this feature.", "percentage": 87, "based_on_number_of_reviews": 14}, {"name": "Social Sharing", "content": "Based on 10 eSputnik reviews and verified by the G2 Product R&D team. Add intelligent social share buttons to your campaigns and content.  Track who is sharing your content and driving conversions.", "percentage": 85, "based_on_number_of_reviews": 10}, {"name": "Social Campaigns", "content": "Based on 15 eSputnik reviews and verified by the G2 Product R&D team. Schedule automated posts to one or more social accounts; use or integrate with URL shortening services; and measure likes, comments, replies, and retweets.", "percentage": 90, "based_on_number_of_reviews": 15}, {"name": "Social Media Engagement", "content": "As reported in 18 eSputnik reviews. Social apps including polls, sweepstakes, and referral programs can enhance audience engagement.  Include these on your website, landing pages, Facebook pages, and emails.", "percentage": 93, "based_on_number_of_reviews": 18}, {"name": "Social Media Advertising", "content": "Based on 11 eSputnik reviews. Amplify brand and community stories; Reach customers by social profile and activity; Optimize social ad campaigns in real-time", "percentage": 94, "based_on_number_of_reviews": 11}]}, {"name": "Reporting & Analytics", "features": [{"name": "Basic Reporting", "content": "Based on 43 eSputnik reviews and verified by the G2 Product R&D team. Access pre-built and custom reports and dashboards to measure leads by source/campaign/month, email performance, landing page performance, and web and social activity. Create report subscriptions that can automatically send updates to your team and executives.", "percentage": 94, "based_on_number_of_reviews": 43}, {"name": "Web Analytics", "content": "Based on 34 eSputnik reviews and verified by the G2 Product R&D team. Track which pages prospects and customers visit and how often they come back.  Capture the history in database for lead scoring and sales intelligence. Use anonymous company look-up to identify anonymous visitors.  Send alerts to sales reps of which of their prospects and customers web activity.", "percentage": 94, "based_on_number_of_reviews": 34}, {"name": "ROI Analytics", "content": "Based on 39 eSputnik reviews and verified by the G2 Product R&D team. Measure leads, prospects generated, pipeline, revenue, investment, and ROI by marketing channel or program. The result is that you can see which marketing investments are generating the greatest return and get visibility into how marketing budget should be allocated going forward.", "percentage": 97, "based_on_number_of_reviews": 39}, {"name": "Revenue Analytics", "content": "Based on 29 eSputnik reviews and verified by the G2 Product R&D team. Analyze how leads flow through the funnel by measuring stage to stage conversion rates and velocity.  Allocate pipeline and revenue credit among all the marketing activities that have successfully touched an opportunity as it moves through the pipeline.", "percentage": 91, "based_on_number_of_reviews": 29}, {"name": "SEO / Keyword Analytics", "content": "Monitor and track how you rank for relevant keywords on major search engines and compare your overall performance to competitors. 21 reviewers of eSputnik have provided feedback on this feature.", "percentage": 90, "based_on_number_of_reviews": 21}]}, {"name": "Campaigns", "features": [{"name": "Customize", "content": "As reported in 23 eSputnik reviews. Allow users to customize their messages.", "percentage": 93, "based_on_number_of_reviews": 23}, {"name": "Scheduling", "content": "Schedule push notifications to be delivered at a specific date and time, or set an expiration for time-bound messages 24 reviewers of eSputnik have provided feedback on this feature.", "percentage": 97, "based_on_number_of_reviews": 24}, {"name": "Retarget", "content": "Retarget your messages based on previous user engagement. This feature was mentioned in 23 eSputnik reviews.", "percentage": 86, "based_on_number_of_reviews": 23}, {"name": "Segmentation", "content": "Based on 20 eSputnik reviews. Segment audience based on device type, location, demographics, customer behavior, etc.", "percentage": 93, "based_on_number_of_reviews": 20}, {"name": "Triggered Notifications", "content": "Automate notifications based on user behavior This feature was mentioned in 23 eSputnik reviews.", "percentage": 91, "based_on_number_of_reviews": 23}]}, {"name": "Analytics", "features": [{"name": "Campaign Performance", "content": "Track and report on performance metrics and conversions 23 reviewers of eSputnik have provided feedback on this feature.", "percentage": 94, "based_on_number_of_reviews": 23}, {"name": "Audience Insights", "content": "Report on audience demographics and engagement 21 reviewers of eSputnik have provided feedback on this feature.", "percentage": 88, "based_on_number_of_reviews": 21}]}, {"name": "Data Sourcing", "features": [{"name": "Data Enrichment", "content": "Uses external data sources to improve customer profiles.", "percentage": null, "based_on_number_of_reviews": null}, {"name": "Expandability", "content": "Can be updated to accept new sources and types of data.", "percentage": null, "based_on_number_of_reviews": null}, {"name": "Content Marketing", "content": "Can act as a content marketing platform.", "percentage": null, "based_on_number_of_reviews": null}, {"name": "Multiple Devices", "content": "Can engage with customers across any device with a consistent message.", "percentage": null, "based_on_number_of_reviews": null}]}, {"name": "Intelligence", "features": [{"name": "Marketing Metrics", "content": "Provides analysis of marketing program ROI and efficiency.", "percentage": null, "based_on_number_of_reviews": null}, {"name": "Predictive Modeling", "content": "Predicts outcomes based on statistical models; can give insight to \"what-if\" scenarios.", "percentage": null, "based_on_number_of_reviews": null}, {"name": "Recommendation Engine", "content": "Uses artificial intelligence to provide suggestions based on desired outcomes.", "percentage": null, "based_on_number_of_reviews": null}]}, {"name": "Optimization", "features": [{"name": "A/B Testing", "content": "As reported in 21 eSputnik reviews. Test variations of a push notification on a portion of users and track conversions", "percentage": 94, "based_on_number_of_reviews": 21}, {"name": "Personalization", "content": "Personalize messages with contextual data such as customer names or product recommendations This feature was mentioned in 23 eSputnik reviews.", "percentage": 96, "based_on_number_of_reviews": 23}, {"name": "Rich Notifications", "content": "As reported in 22 eSputnik reviews. Enhance messages with images, emojis, animated gifs, or videos", "percentage": 86, "based_on_number_of_reviews": 22}, {"name": "Integrations", "content": "Based on 22 eSputnik reviews. Integrate with third-party marketing or e-commerce software", "percentage": 95, "based_on_number_of_reviews": 22}]}], "star_distribution": {"1": 1, "2": 0, "3": 2, "4": 2, "5": 57}, "popular_mentions": ["Communication", "Customer", "Customer segmentation", "Data", "Email campaigns", "Email marketing", "Features", "Marketing automation", "Push notifications", "Service", "Support team", "Templates", "Tools", "Viber campaigns", "Web push"], "g2_reviews_link": "https://www.g2.com/products/esputnik/reviews#reviews", "review_links": ["https://www.g2.com/products/esputnik/reviews", "https://www.g2.com/products/esputnik/reviews?page=2", "https://www.g2.com/products/esputnik/reviews?page=3"], "initial_reviews": [{"review_id": 9591749, "review_title": "Eliminating routine campaign creation processes thanks to built-in AI", "review_content": "What do you like best about eSputnik?\n\"We chose eSputnik because of the possibility of omnichannel campaigns. We can use communication channels from cheap to expensive, depending on the type of content and customer segments.\nWe would also like to emphasize the ease of use of the system. The generative AI implemented in the system plays a vital role in this. It allows us to work on email content directly in the editor: translate, shorten, and expand texts. Also, thanks to the integrated AI in eSputnik, we can automate the creation of entire email modules. Just insert a link to the required page of your website into the module, and AI will generate the block using the description, price, and image on the page. The same gen AI allows you to create texts for push notifications. These solutions significantly reduce the team's time for routine tasks. At the same time, such campaigns receive high CTR. \"\n\nWhat do you dislike about eSputnik?\nOur team has not found any problems with this product, we plan to continue using eSputnik CDP\n\nWhat problems is eSputnik solving and how is that benefiting you?\nAutomation of campaigns creation, diversity of channels, fast ROI.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "\"We chose eSputnik because of the possibility of omnichannel campaigns. We can use communication channels from cheap to expensive, depending on the type of content and customer segments.\nWe would also like to emphasize the ease of use of the system. The generative AI implemented in the system plays a vital role in this. It allows us to work on email content directly in the editor: translate, shorten, and expand texts. Also, thanks to the integrated AI in eSputnik, we can automate the creation of entire email modules. Just insert a link to the required page of your website into the module, and AI will generate the block using the description, price, and image on the page. The same gen AI allows you to create texts for push notifications. These solutions significantly reduce the team's time for routine tasks. At the same time, such campaigns receive high CTR. \""}, {"question": "What do you dislike about eSputnik?", "answer": "Our team has not found any problems with this product, we plan to continue using eSputnik CDP"}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "Automation of campaigns creation, diversity of channels, fast ROI."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Inna S.", "reviewer_job_title": "Marketing Rockstar", "reviewer_link": "https://www.g2.com/users/8fa7dd5c-4f43-42df-9aa6-b7774ce72ca6"}, "publish_date": "2024-05-01T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-9591749"}, {"review_id": 9752794, "review_title": "Usable system with extensive functionality and flexible settings for omnichannel campaigns", "review_content": "What do you like best about eSputnik?\nThe eSputnik customer data platform has built-in functionality for organizing omnichannel marketing campaigns, while other systems require additional integrations. Thanks to this system, we have implemented omnichannel marketing using the following channels: email, push, In-App, and App Inbox. By combining data from different sources and channels and constantly enriching and analyzing information, we can better understand our customers and provide them with relevant content.\nThis has allowed us to create valuable and exciting campaigns for each audience segment. As a result, conversion from direct marketing increased by +7% over the past year.\n\nWhat do you dislike about eSputnik?\nWe haven't found any significant or noteworthy shortcomings.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nOptimization of routine tasks for creating campaigns. Freeing up human resources to find and test new hypotheses. Minimize technical errors. Increase the effectiveness of email campaigns.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "The eSputnik customer data platform has built-in functionality for organizing omnichannel marketing campaigns, while other systems require additional integrations. Thanks to this system, we have implemented omnichannel marketing using the following channels: email, push, In-App, and App Inbox. By combining data from different sources and channels and constantly enriching and analyzing information, we can better understand our customers and provide them with relevant content.\nThis has allowed us to create valuable and exciting campaigns for each audience segment. As a result, conversion from direct marketing increased by +7% over the past year."}, {"question": "What do you dislike about eSputnik?", "answer": "We haven't found any significant or noteworthy shortcomings."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "Optimization of routine tasks for creating campaigns. Freeing up human resources to find and test new hypotheses. Minimize technical errors. Increase the effectiveness of email campaigns."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Vladislav A.", "reviewer_job_title": "Vedushchii spetsialist po upravleniiu proektami", "reviewer_link": "https://www.g2.com/users/a365f221-b6c3-4a30-9cef-d866792dfd6e"}, "publish_date": "2024-06-05T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-9752794"}, {"review_id": 9528922, "review_title": "Effective omnichannel and automated push notification", "review_content": "What do you like best about eSputnik?\nOur company caters to a diverse audience, so omnichannel functionality is fundamentally important for us. Various age groups within our customer base prefer communication through different channels: some find it more convenient to receive messages in a mobile application, while others prefer email. CDP eSputnik perfectly fulfills our omnichannel needs, supporting communication through email, web and mobile push, In-App, App Inbox, SMS, Viber, and widgets.\n\nI would like to highlight web push separately. Conveniently, it can be used for communication with both registered users and those who have not yet registered on the site. Through web push, we capture the attention of new users, offer personalized discounts, send AI-generated product recommendations, provide updates on product ranges, and remind users about abandoned carts. Importantly, all these processes are automated and do not require additional time from our team.\n\nWhat do you dislike about eSputnik?\nWhile using the system, my team did not identify any significant shortcomings.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nThe greatest benefit is the ability to track all the user activity on our website and in the application and build an effective communication strategy with them based on real-time and conveniently structured data.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "Our company caters to a diverse audience, so omnichannel functionality is fundamentally important for us. Various age groups within our customer base prefer communication through different channels: some find it more convenient to receive messages in a mobile application, while others prefer email. CDP eSputnik perfectly fulfills our omnichannel needs, supporting communication through email, web and mobile push, In-App, App Inbox, SMS, Viber, and widgets.\n\nI would like to highlight web push separately. Conveniently, it can be used for communication with both registered users and those who have not yet registered on the site. Through web push, we capture the attention of new users, offer personalized discounts, send AI-generated product recommendations, provide updates on product ranges, and remind users about abandoned carts. Importantly, all these processes are automated and do not require additional time from our team."}, {"question": "What do you dislike about eSputnik?", "answer": "While using the system, my team did not identify any significant shortcomings."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "The greatest benefit is the ability to track all the user activity on our website and in the application and build an effective communication strategy with them based on real-time and conveniently structured data."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Dmitry C.", "reviewer_job_title": "CEO, Founder", "reviewer_link": "https://www.g2.com/users/4e0fbb93-9628-4b41-b6cc-1d46ecb246c9"}, "publish_date": "2024-04-11T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-9528922"}, {"review_id": 9589537, "review_title": "Better customer understanding", "review_content": "What do you like best about eSputnik?\n\"Thanks to eSputnik CDP, we were able to increase conversion rates and customer loyalty, and get better analytics.\nCompared to other solutions on the market, the main advantage of eSputnik CDP is the ability to collect all customer data in a single customer profile. This guarantees the completeness and relevance of information, which is the basis for further communication. We can be sure that campaigns are sent to the right audience for the right occasion. And even when we use expensive channels for mailing, these costs will pay off.\nIf we have questions about using the platform, the support team always responds promptly and solves all our problems.\"\n\nWhat do you dislike about eSputnik?\nThe eSputnik customer data platform fully solves our tasks, and we have not found any problems.\n\nWhat problems is eSputnik solving and how is that benefiting you?\neSputnik solves the problem of irrelevant communication and wasting marketing budgets on unnecessary communication.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "\"Thanks to eSputnik CDP, we were able to increase conversion rates and customer loyalty, and get better analytics.\nCompared to other solutions on the market, the main advantage of eSputnik CDP is the ability to collect all customer data in a single customer profile. This guarantees the completeness and relevance of information, which is the basis for further communication. We can be sure that campaigns are sent to the right audience for the right occasion. And even when we use expensive channels for mailing, these costs will pay off.\nIf we have questions about using the platform, the support team always responds promptly and solves all our problems.\""}, {"question": "What do you dislike about eSputnik?", "answer": "The eSputnik customer data platform fully solves our tasks, and we have not found any problems."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "eSputnik solves the problem of irrelevant communication and wasting marketing budgets on unnecessary communication."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Alice Z.", "reviewer_job_title": "Product Manager Assistant", "reviewer_link": "https://www.g2.com/users/alicez"}, "publish_date": "2024-04-30T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-9589537"}, {"review_id": 8934649, "review_title": "Improve your omnichannel marketing with eSputnik omnichannel CDP", "review_content": "What do you like best about eSputnik?\nWhen we realized the need for marketing automation, we chose omnichannel CDP eSputnik. Here are the reasons:\n- Advanced segmentation -- based on customer behavioral data that is constantly changing.\n- Personalized communication with all users. We're not just talking about simply calling them by name, but also matching personalized product recommendations, identifying the user's language, reducing annoyance by optimizing the number of campaigns.\n\n- The platform allows for flexible customization our communication strategies. Using omnichannel approach we promote new products, implement cross-selling and upselling techniques, transfer customers between categories, send transactional messages, and attract users' attention to other communication channels, such as social media. We use such channels as email, web push, SMS, and App Inbox.\n\n- eSputnik provides integrations with website builders, landing page platforms, and online stores through APIs.\n\n- The platform boasts comprehensive and convenient functionality, enabling us to launch complex campaigns and analyze their effectiveness without requiring additional technical specialists.\n\n- Integrated AI features in the email editor include translation, grammar checking, shortening or lengthening written texts, changing the tone of voice, and creating expert explanations.\n\n- Excellent customer support. This was particularly helpful when we encountered a problem with one of our mailings, as the issue was resolved promptly.\n\nWe have not regretted our choice once; all available functionality works well and is continually expanding.\n\nWhat do you dislike about eSputnik?\nThere were no visible shortcomings that I noticed -- a convenient and, most importantly, effective system.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nThe main benefit is an increase in sales. Features of eSputnik that contribute to this: unification of the customer base data and its deep segmentation, as well as the possibility of omnichannel communication and analysis of the effectiveness of launched campaigns.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "When we realized the need for marketing automation, we chose omnichannel CDP eSputnik. Here are the reasons:\n- Advanced segmentation -- based on customer behavioral data that is constantly changing.\n- Personalized communication with all users. We're not just talking about simply calling them by name, but also matching personalized product recommendations, identifying the user's language, reducing annoyance by optimizing the number of campaigns.\n\n- The platform allows for flexible customization our communication strategies. Using omnichannel approach we promote new products, implement cross-selling and upselling techniques, transfer customers between categories, send transactional messages, and attract users' attention to other communication channels, such as social media. We use such channels as email, web push, SMS, and App Inbox.\n\n- eSputnik provides integrations with website builders, landing page platforms, and online stores through APIs.\n\n- The platform boasts comprehensive and convenient functionality, enabling us to launch complex campaigns and analyze their effectiveness without requiring additional technical specialists.\n\n- Integrated AI features in the email editor include translation, grammar checking, shortening or lengthening written texts, changing the tone of voice, and creating expert explanations.\n\n- Excellent customer support. This was particularly helpful when we encountered a problem with one of our mailings, as the issue was resolved promptly.\n\nWe have not regretted our choice once; all available functionality works well and is continually expanding."}, {"question": "What do you dislike about eSputnik?", "answer": "There were no visible shortcomings that I noticed -- a convenient and, most importantly, effective system."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "The main benefit is an increase in sales. Features of eSputnik that contribute to this: unification of the customer base data and its deep segmentation, as well as the possibility of omnichannel communication and analysis of the effectiveness of launched campaigns."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Olena O.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/52006446-715b-44a0-a17d-e81437f06304"}, "publish_date": "2024-04-03T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-8934649"}, {"review_id": 9603712, "review_title": "Segmentation solution", "review_content": "What do you like best about eSputnik?\nThe customer data platform helped us to build detailed segments without unnecessary integrations, with which we can continue to work in the system (organize omnichannel mailings in different channels: email, app inbox, web push). We automatically transfer behavioral data from the website via web tracking, and use data on user behavior in mailings. Group building is fast and cohesive. We can use any static and behavioral customer data for segmentation. CDP also provides the ability to build segments based on event parameters; for example, create a segment of users who purchased X product for a certain amount of money during a specific period.\n\nWhat do you dislike about eSputnik?\nWe haven't noticed any problems with this customer data platform\n\nWhat problems is eSputnik solving and how is that benefiting you?\nThrough segmentation, we can better learn about our customers and better personalize communications with each group.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "The customer data platform helped us to build detailed segments without unnecessary integrations, with which we can continue to work in the system (organize omnichannel mailings in different channels: email, app inbox, web push). We automatically transfer behavioral data from the website via web tracking, and use data on user behavior in mailings. Group building is fast and cohesive. We can use any static and behavioral customer data for segmentation. CDP also provides the ability to build segments based on event parameters; for example, create a segment of users who purchased X product for a certain amount of money during a specific period."}, {"question": "What do you dislike about eSputnik?", "answer": "We haven't noticed any problems with this customer data platform"}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "Through segmentation, we can better learn about our customers and better personalize communications with each group."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Maister D.", "reviewer_job_title": "Co-Founder, CEO, COO, CVO", "reviewer_link": "https://www.g2.com/users/c4d78215-02b4-4414-8a95-e161254d1f6b"}, "publish_date": "2024-05-06T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-9603712"}, {"review_id": 9577596, "review_title": "eSputnik CDP: Empowering Omnichannel Communication Strategies for Success", "review_content": "What do you like best about eSputnik?\nVarious communication channels, including mobile, web push, emails, and messengers, have significantly contributed to increased customer engagement. Using omnichannel has allowed us to strengthen customer relationships and increase loyalty and trust. As a result, we receive a higher number of repeat orders from satisfied and loyal customers, confirming our strategy's effectiveness.\n\nWhat do you dislike about eSputnik?\nNo shortcomings were found, eSputnik CDP is the best solution for omnichannel interaction with each customer.\n\nWhat problems is eSputnik solving and how is that benefiting you?\neSputnik Omnichannel CDP solves goals:\n- understanding customers and their needs;\n- data collection;\n- personalization;\n- seamless customer communication across all channels.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "Various communication channels, including mobile, web push, emails, and messengers, have significantly contributed to increased customer engagement. Using omnichannel has allowed us to strengthen customer relationships and increase loyalty and trust. As a result, we receive a higher number of repeat orders from satisfied and loyal customers, confirming our strategy's effectiveness."}, {"question": "What do you dislike about eSputnik?", "answer": "No shortcomings were found, eSputnik CDP is the best solution for omnichannel interaction with each customer."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "eSputnik Omnichannel CDP solves goals:\n- understanding customers and their needs;\n- data collection;\n- personalization;\n- seamless customer communication across all channels."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Inga .", "reviewer_job_title": "Junior Marketing Manager", "reviewer_link": "https://www.g2.com/users/3234dff2-f6e3-4e76-a194-b2880457f67f"}, "publish_date": "2024-04-25T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-9577596"}, {"review_id": 4926645, "review_title": "A very convenient CDP for marketing automation", "review_content": "What do you like best about eSputnik?\nI think the main eSputnik's advantage is the deep customer segmentation feature that allows to collect and unify client's data in a single profile and set up automated personalized messages according to their behaviour. No need to segment the audience manually. Thanks to web-tracking scripts and AI-algorithms eSputnik will do all the work automatically.\n\nAnother great option is multilingual campaigns. You can easily translate your email template into any language in a few seconds.\n\nWhat do you dislike about eSputnik?\nThe setting up of event-triggered messages seemed a bit tangled. However, the dashboard is quite intuitive.\n\nRecommendations to others considering eSputnik:\neSputnik is a very convenient and cheep customer data platform for large business. There are a lot of great integrations and indispensable tools for e-commerce. It's definitely more than just regular ESP or ordinary email service.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWith eSputnik we managed to:\n\n- set up personalized omnichannel marketing campaigns;\n- unify all customer's data in one place;\n- save a lot of time thanks to automated workflows and machine learning.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "I think the main eSputnik's advantage is the deep customer segmentation feature that allows to collect and unify client's data in a single profile and set up automated personalized messages according to their behaviour. No need to segment the audience manually. Thanks to web-tracking scripts and AI-algorithms eSputnik will do all the work automatically.\n\nAnother great option is multilingual campaigns. You can easily translate your email template into any language in a few seconds."}, {"question": "What do you dislike about eSputnik?", "answer": "The setting up of event-triggered messages seemed a bit tangled. However, the dashboard is quite intuitive."}, {"question": "Recommendations to others considering eSputnik:", "answer": "eSputnik is a very convenient and cheep customer data platform for large business. There are a lot of great integrations and indispensable tools for e-commerce. It's definitely more than just regular ESP or ordinary email service."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "With eSputnik we managed to:\n\n- set up personalized omnichannel marketing campaigns;\n- unify all customer's data in one place;\n- save a lot of time thanks to automated workflows and machine learning."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Serhii K.", "reviewer_job_title": "Chief Operating Officer", "reviewer_link": "https://www.g2.com/users/d3ee0402-acb3-4346-ac29-ce5f29ad222a"}, "publish_date": "2021-08-11T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4926645"}, {"review_id": 4920206, "review_title": "eSputnik is a Perfect Customer Data Platform for Ecommerce", "review_content": "What do you like best about eSputnik?\n\"The functionality of this omnichannel system goes beyond a regular ESP or standard email marketing tool. eSputnik is a veritable CDP platform which provides a lot of unique features for Ecommerce:\n\n- Advanced data collection and deep contact list segmentation;\n- Profile unification features: personalizaed product recommendations, triggered messages etc;\n- AI-based algorithms for launching automated campaigns;\n- Multilingual transactional messages etc.\n\nIn addition, eSputnik can be easily integrated with almost any CRM system via API, ApiX-Drive or Zapier. A really good tool from ukrainian developpers!\"\n\nWhat do you dislike about eSputnik?\nThere's no serious cons in my opinion. The dashboard is really convenient. Besides that, eSputnik's support team can connect any advanced feature for you in case you can't do this by yourself.\n\nRecommendations to others considering eSputnik:\n\"eSputnik takes digital marketing to a whole new level. As a CDP platform it provides innovative and unique features for ecommerce and B2C. No need to tell about useful integrations with amoCRM, Shopify, Tilda, Facebook Ads Manager and other indispensable tools.\n\nA great cloud software for any large online business and marketplaces. Get a demo version first and try to test the system. And you will see how flexible and intuitive its interface is.\"\n\nWhat problems is eSputnik solving and how is that benefiting you?\nAlmost 55% of our marketing activities were automated with a three months. We managed to optimize our promotional campaigns and make it more personalized.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "\"The functionality of this omnichannel system goes beyond a regular ESP or standard email marketing tool. eSputnik is a veritable CDP platform which provides a lot of unique features for Ecommerce:\n\n- Advanced data collection and deep contact list segmentation;\n- Profile unification features: personalizaed product recommendations, triggered messages etc;\n- AI-based algorithms for launching automated campaigns;\n- Multilingual transactional messages etc.\n\nIn addition, eSputnik can be easily integrated with almost any CRM system via API, ApiX-Drive or Zapier. A really good tool from ukrainian developpers!\""}, {"question": "What do you dislike about eSputnik?", "answer": "There's no serious cons in my opinion. The dashboard is really convenient. Besides that, eSputnik's support team can connect any advanced feature for you in case you can't do this by yourself."}, {"question": "Recommendations to others considering eSputnik:", "answer": "\"eSputnik takes digital marketing to a whole new level. As a CDP platform it provides innovative and unique features for ecommerce and B2C. No need to tell about useful integrations with amoCRM, Shopify, Tilda, Facebook Ads Manager and other indispensable tools.\n\nA great cloud software for any large online business and marketplaces. Get a demo version first and try to test the system. And you will see how flexible and intuitive its interface is.\""}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "Almost 55% of our marketing activities were automated with a three months. We managed to optimize our promotional campaigns and make it more personalized."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Ekaterina .", "reviewer_job_title": "Parthner manager", "reviewer_link": "https://www.g2.com/users/2e4553b1-2ebd-4efd-a990-9b7876cb75a4"}, "publish_date": "2021-08-09T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4920206"}, {"review_id": 5473986, "review_title": "All in one marketing tool", "review_content": "What do you like best about eSputnik?\nE-Sputnik combines all ways and channels you need to communicate with your cusomers. It is very comfortable to run your email, Viber, sms, PUSH campaign from one dashboard.\n\nWhat do you dislike about eSputnik?\nI have not used e-Sputnik long enough to find some disadvantages. It is not that popular among my colleages, so sometimes new people in the team need time to learn the dashboard.\n\nWhat problems is eSputnik solving and how is that benefiting you?\neSputnik is good primarily for Push-notification and Viber campaigns. That is the main option I used eSputnik for. Sure, they have good feature for emails, but I did not use it much.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "E-Sputnik combines all ways and channels you need to communicate with your cusomers. It is very comfortable to run your email, Viber, sms, PUSH campaign from one dashboard."}, {"question": "What do you dislike about eSputnik?", "answer": "I have not used e-Sputnik long enough to find some disadvantages. It is not that popular among my colleages, so sometimes new people in the team need time to learn the dashboard."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "eSputnik is good primarily for Push-notification and Viber campaigns. That is the main option I used eSputnik for. Sure, they have good feature for emails, but I did not use it much."}], "review_rating": 4.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2022-03-31T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-5473986"}, {"review_id": 4787178, "review_title": "Nice Omnichannel Platform for E-Commerce", "review_content": "What do you like best about eSputnik?\neSputnik isn't ordinary email service. This is a multifunctional platform for marketing automation providing a lot of unique features especially for online stores and e-commerce projects. With eSputnik you can set up client's behaviour tracker to your website, launch triggered campaigns with product recommendations or adjust AI algorithms to improve your customer segmentation.\n\nSome of our clients are using eSputnik as the main ESP system in their marketing workflows. Moreover, it can be easily integrated with any CRM software via Zapier or API.\n\nWhat do you dislike about eSputnik?\nThere's nothing I dislike about this email service. Of course, some advanced functionality may seem quite complicated. But you can always contact support team to receive answers to all your questions.\n\nRecommendations to others considering eSputnik:\neSputnik is a nice alternate ESP for any kind of e-commerce regardless of the size of your business. It will be suitable for launching regular simple email campaigns. And at the same time, it can be a great additional instrument for your advanced marketing tactics.\n\nI recommend trying some basic features first (Email campaigns, SMS, Web Pushes) to understand this system, and then you'll be able to fall deeper in its architecture.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWith eSputnik we managed to automate our email campaigns to 90% and have optimized the work of our marketing department. We saved a lot of time resource and now can use it more efficiently.\n\nThanks to personalized triggered messages we increased our open rates to 17% and now are seeing the stable growth of email conversion rate.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "eSputnik isn't ordinary email service. This is a multifunctional platform for marketing automation providing a lot of unique features especially for online stores and e-commerce projects. With eSputnik you can set up client's behaviour tracker to your website, launch triggered campaigns with product recommendations or adjust AI algorithms to improve your customer segmentation.\n\nSome of our clients are using eSputnik as the main ESP system in their marketing workflows. Moreover, it can be easily integrated with any CRM software via Zapier or API."}, {"question": "What do you dislike about eSputnik?", "answer": "There's nothing I dislike about this email service. Of course, some advanced functionality may seem quite complicated. But you can always contact support team to receive answers to all your questions."}, {"question": "Recommendations to others considering eSputnik:", "answer": "eSputnik is a nice alternate ESP for any kind of e-commerce regardless of the size of your business. It will be suitable for launching regular simple email campaigns. And at the same time, it can be a great additional instrument for your advanced marketing tactics.\n\nI recommend trying some basic features first (Email campaigns, SMS, Web Pushes) to understand this system, and then you'll be able to fall deeper in its architecture."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "With eSputnik we managed to automate our email campaigns to 90% and have optimized the work of our marketing department. We saved a lot of time resource and now can use it more efficiently.\n\nThanks to personalized triggered messages we increased our open rates to 17% and now are seeing the stable growth of email conversion rate."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Nataliia B.", "reviewer_job_title": "Junior Marketing Manager", "reviewer_link": "https://www.g2.com/users/e7539618-0725-4a3a-8acf-277920996925"}, "publish_date": "2021-06-08T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4787178"}, {"review_id": 4530023, "review_title": "Perfect Email Service Provider", "review_content": "What do you like best about eSputnik?\neSputnik provides deep segmentation features and allows to build flexible automated workflows. Thanks to this functionality and convenient dashboard you'll save a lot of time for launching email and web push campaigns.\n\nSupport team is always available in online chat and via email: with their help, we managed to master AI-powered scenarios and launch our first transactional emails in the shortest possible time.\n\nWhat do you dislike about eSputnik?\nWell, there's nothing I dislike about eSputnik. They are a great alternative to the popular ESPs.\n\nRecommendations to others considering eSputnik:\nIts functionality does not concede to known email marketing services like MailChimp or GetResponse. And finally, it can be integrated with any CRM system via Zapier. You can start with the Optimal Plan and assess all the main system possibilities at the lowest price.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWith eSputnik we managed to:\n\n- launch our first triggered campaigns to the new users\n- reactivate more than 20% of our old subscribers via push notifications\n- increase email open rates by 24%\n- redesign most of our newsletters in the shortest time", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "eSputnik provides deep segmentation features and allows to build flexible automated workflows. Thanks to this functionality and convenient dashboard you'll save a lot of time for launching email and web push campaigns.\n\nSupport team is always available in online chat and via email: with their help, we managed to master AI-powered scenarios and launch our first transactional emails in the shortest possible time."}, {"question": "What do you dislike about eSputnik?", "answer": "Well, there's nothing I dislike about eSputnik. They are a great alternative to the popular ESPs."}, {"question": "Recommendations to others considering eSputnik:", "answer": "Its functionality does not concede to known email marketing services like MailChimp or GetResponse. And finally, it can be integrated with any CRM system via Zapier. You can start with the Optimal Plan and assess all the main system possibilities at the lowest price."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "With eSputnik we managed to:\n\n- launch our first triggered campaigns to the new users\n- reactivate more than 20% of our old subscribers via push notifications\n- increase email open rates by 24%\n- redesign most of our newsletters in the shortest time"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "EVADAV L.", "reviewer_job_title": "Marketing and Advertising", "reviewer_link": "https://www.g2.com/users/566ed9ca-303d-4106-afe6-4de20ab18c4b"}, "publish_date": "2020-12-21T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4530023"}, {"review_id": 4874168, "review_title": "eSputnik as a email marketing tool", "review_content": "What do you like best about eSputnik?\nThis tool is one of the easiest and cheapest on market. It provides a lot of useful functionalities, especially in the free tier.\n\nWhat do you dislike about eSputnik?\nThe UI of eSputnik is not the best but it's cool in terms of UX - you can easily find whatever you need.\n\nWhat problems is eSputnik solving and how is that benefiting you?\neSputnik was used in an NGO for email marketing and communication with participants. With this tool, we engaged some people to our activities and kept them updated about the news.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "This tool is one of the easiest and cheapest on market. It provides a lot of useful functionalities, especially in the free tier."}, {"question": "What do you dislike about eSputnik?", "answer": "The UI of eSputnik is not the best but it's cool in terms of UX - you can easily find whatever you need."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "eSputnik was used in an NGO for email marketing and communication with participants. With this tool, we engaged some people to our activities and kept them updated about the news."}], "review_rating": 4.5, "reviewer": {"reviewer_name": "Mykola K.", "reviewer_job_title": "Project Manager", "reviewer_link": "https://www.g2.com/users/dc8bdc57-1062-46fb-84b6-fb3c85585cf2"}, "publish_date": "2021-07-19T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4874168"}, {"review_id": 4499763, "review_title": "Improve your email marketing with eSputnik", "review_content": "What do you like best about eSputnik?\nFirstly, eSputnik has a friendly user interface and convenient email builder. You don't have to be email marketing guru to launch your first campaigns.\n\nSecondly, it's a great omnichannel solution for online stores: you can set up product recommendations on your website or adjust automated triggered campaigns according to the customer's behaviour. Each client will receive personalized email based on his interests.\n\nFinally, eSputnik offers a lot of deep client segmentation features. That's exactly what professional marketers need in 2020.\n\nWhat do you dislike about eSputnik?\nAdvanced segmentation manuals seem to be a bit complicated. But finally, thanks to the support team, we managed to launch it the right way.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWe managed to improve our email marketing personalization and attract new customers via emails, SMS and push notifications.\n\nThanks to the triggered messages and improved segments our email open rates increased by 37%. This tactic has had a positive effect on the conversion rates as well.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "Firstly, eSputnik has a friendly user interface and convenient email builder. You don't have to be email marketing guru to launch your first campaigns.\n\nSecondly, it's a great omnichannel solution for online stores: you can set up product recommendations on your website or adjust automated triggered campaigns according to the customer's behaviour. Each client will receive personalized email based on his interests.\n\nFinally, eSputnik offers a lot of deep client segmentation features. That's exactly what professional marketers need in 2020."}, {"question": "What do you dislike about eSputnik?", "answer": "Advanced segmentation manuals seem to be a bit complicated. But finally, thanks to the support team, we managed to launch it the right way."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "We managed to improve our email marketing personalization and attract new customers via emails, SMS and push notifications.\n\nThanks to the triggered messages and improved segments our email open rates increased by 37%. This tactic has had a positive effect on the conversion rates as well."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Anastasia B.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/68506625-0a21-4092-8c51-c7de96dceeba"}, "publish_date": "2020-11-30T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4499763"}, {"review_id": 4602874, "review_title": "eSputnik is an innovative platform to manage your marketing projects", "review_content": "What do you like best about eSputnik?\nThis marketing automation solution has a complete portfolio of tools that will provide you with all the necessary capabilities to work and simplify all marketing tasks, the great strength of this program is in the tools to develop email marketing campaigns as it has a great editor, you can manage multichannel campaigns, reports, analysis and performance metrics, it has an excellent price-quality ratio and a very smart technical support\n\nWhat do you dislike about eSputnik?\nThe audience segmentation function is not what you expect in fact the segmentation is almost null, the integrations are scarce is a shame because this could improve this program much more, it is difficult to determine the time to send marketing or promotional content to all your visitors especially if you do not have a previous analysis of the tastes of each of them, it does not have mobile applications and it does not have a free version either\n\nRecommendations to others considering eSputnik:\nI recommend eSputnik because the B2B cloud hosted marketing automation system is one of the best as the set of professional features and capabilities it offers are very good in relation to other software as it provides many facilities to create content, manage marketing campaigns and measure the performance of them, in other aspects the price quality ratio is great and the technical support provides very smart solutions\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWe use eSputnik to solve problems in the marketing department, such as creating advertising content for all our audience, the email marketing automation solution that this software has given us has been one of the best things that has happened to us since we can not only create advertising easily for a large number of people if not also measure the performance of each of them once they are active so we can know what we should improve", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "This marketing automation solution has a complete portfolio of tools that will provide you with all the necessary capabilities to work and simplify all marketing tasks, the great strength of this program is in the tools to develop email marketing campaigns as it has a great editor, you can manage multichannel campaigns, reports, analysis and performance metrics, it has an excellent price-quality ratio and a very smart technical support"}, {"question": "What do you dislike about eSputnik?", "answer": "The audience segmentation function is not what you expect in fact the segmentation is almost null, the integrations are scarce is a shame because this could improve this program much more, it is difficult to determine the time to send marketing or promotional content to all your visitors especially if you do not have a previous analysis of the tastes of each of them, it does not have mobile applications and it does not have a free version either"}, {"question": "Recommendations to others considering eSputnik:", "answer": "I recommend eSputnik because the B2B cloud hosted marketing automation system is one of the best as the set of professional features and capabilities it offers are very good in relation to other software as it provides many facilities to create content, manage marketing campaigns and measure the performance of them, in other aspects the price quality ratio is great and the technical support provides very smart solutions"}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "We use eSputnik to solve problems in the marketing department, such as creating advertising content for all our audience, the email marketing automation solution that this software has given us has been one of the best things that has happened to us since we can not only create advertising easily for a large number of people if not also measure the performance of each of them once they are active so we can know what we should improve"}], "review_rating": 4.5, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2021-02-16T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4602874"}, {"review_id": 4318039, "review_title": "eSputnik allowed us to create high impact advertising campaigns for our company", "review_content": "What do you like best about eSputnik?\nIt provides an excellent tool to automate the processes concerning our company's digital marketing campaigns, not to mention that the system is provided with a wide variety of templates and resources that facilitate the creation and edition of unpublished and highly creative content for our advertising campaigns.\nIt has a multi-language system for the creation of our advertising campaigns, which allows us to reach a higher level of people, which translates into greater customer acquisition for our business, thus offering the possibility of increasing our income.\nIt has an excellent market segmentation tool, which allows us to design strategies aimed at the target audience that we really want to reach.\n\nWhat do you dislike about eSputnik?\nIt does not allow integration with Facebook Ads, which being a tool widely used by people constitutes a high-value tool to generate greater reach in our digital marketing campaign, since it allows the integration of own resources of social networks for the analysis of our potential clients.\nAdditionally, there are too many restrictions regarding the size of the content we want to generate.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nIt was used to carry out the digital marketing campaigns of my business, obtaining favorable results after the implementation of this system, thus allowing high impact advertising campaigns for our company.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "It provides an excellent tool to automate the processes concerning our company's digital marketing campaigns, not to mention that the system is provided with a wide variety of templates and resources that facilitate the creation and edition of unpublished and highly creative content for our advertising campaigns.\nIt has a multi-language system for the creation of our advertising campaigns, which allows us to reach a higher level of people, which translates into greater customer acquisition for our business, thus offering the possibility of increasing our income.\nIt has an excellent market segmentation tool, which allows us to design strategies aimed at the target audience that we really want to reach."}, {"question": "What do you dislike about eSputnik?", "answer": "It does not allow integration with Facebook Ads, which being a tool widely used by people constitutes a high-value tool to generate greater reach in our digital marketing campaign, since it allows the integration of own resources of social networks for the analysis of our potential clients.\nAdditionally, there are too many restrictions regarding the size of the content we want to generate."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "It was used to carry out the digital marketing campaigns of my business, obtaining favorable results after the implementation of this system, thus allowing high impact advertising campaigns for our company."}], "review_rating": 3.0, "reviewer": {"reviewer_name": "Jessenia C.", "reviewer_job_title": "Gerente de Operacoes de RH", "reviewer_link": "https://www.g2.com/users/e8e4ad20-76e4-4d6d-8bcc-e50cf195d634"}, "publish_date": "2020-07-27T00:00:00", "reviewer_company_size": "Enterprise(> 1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4318039"}, {"review_id": 4518884, "review_title": "eSputnik offers you professional tools to create your marketing campaigns", "review_content": "What do you like best about eSputnik?\neSputnik is an innovative marketing automation solution hosted in the B2C cloud. This software offers a set of tools and professional capabilities that make email marketing a very simple task in many aspects, has a fantastic editor with which you can make really convincing emails and increase your chances, has great capacity for reporting and analysis, reporting on campaigns and to finish an account with powerful segmentation function that will allow you to manage your prospects more effectively\n\nWhat do you dislike about eSputnik?\neSputnik is a software with those collaboration features so it is almost a null solution to work in teams, mobile applications are not available is a pretty important point because it is always quite useful to have these applications, it is extremely difficult to determine exactly the best method to send marketing content to visitors of your digital content especially if you do it manually\n\nRecommendations to others considering eSputnik:\neSputnik is a really great option to carry out all your marketing activities and lead tracking, I recommend it for its ease to create emails, its power to create very accurate analysis and reports that are useful to measure the likelihood of a sale and finally its segmentation functions that allow us to achieve more effective and lasting relationships with all our customers\n\nWhat problems is eSputnik solving and how is that benefiting you?\neSputnik has solved one of the most important problems of my organization which is the creation of marketing campaigns, this software has provided us with great features such as the interaction creator, email editor, target segmentation and the power to manage multiple marketing channels, all these features have allowed us to develop truly effective marketing strategies and execute a number of actions that have served to get more sales and opportunities to get many more customers. We are very satisfied with the progress we have made since using eSputnik", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "eSputnik is an innovative marketing automation solution hosted in the B2C cloud. This software offers a set of tools and professional capabilities that make email marketing a very simple task in many aspects, has a fantastic editor with which you can make really convincing emails and increase your chances, has great capacity for reporting and analysis, reporting on campaigns and to finish an account with powerful segmentation function that will allow you to manage your prospects more effectively"}, {"question": "What do you dislike about eSputnik?", "answer": "eSputnik is a software with those collaboration features so it is almost a null solution to work in teams, mobile applications are not available is a pretty important point because it is always quite useful to have these applications, it is extremely difficult to determine exactly the best method to send marketing content to visitors of your digital content especially if you do it manually"}, {"question": "Recommendations to others considering eSputnik:", "answer": "eSputnik is a really great option to carry out all your marketing activities and lead tracking, I recommend it for its ease to create emails, its power to create very accurate analysis and reports that are useful to measure the likelihood of a sale and finally its segmentation functions that allow us to achieve more effective and lasting relationships with all our customers"}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "eSputnik has solved one of the most important problems of my organization which is the creation of marketing campaigns, this software has provided us with great features such as the interaction creator, email editor, target segmentation and the power to manage multiple marketing channels, all these features have allowed us to develop truly effective marketing strategies and execute a number of actions that have served to get more sales and opportunities to get many more customers. We are very satisfied with the progress we have made since using eSputnik"}], "review_rating": 4.5, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2020-12-14T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4518884"}, {"review_id": 4363075, "review_title": "Reliable marketing automation tool", "review_content": "What do you like best about eSputnik?\nI like the variety of features the platform offers. For someone looking to automate marketing across channels and save time, eSputnik is a great choice. It's impressive how many choices you have and how much you can expand your reach thanks to all these features.\n\nOn top of that, they have a great support team who's there to guide you anytime you need help.\n\nWhat do you dislike about eSputnik?\nSo far, I haven't encountered anything I don't like about the platform.\n\nRecommendations to others considering eSputnik:\nReliable and complex tool for marketing automation and great support!\n\nWhat problems is eSputnik solving and how is that benefiting you?\nMarketing your business across several channels can be challenging. The greatest benefit of using eSputnik is that you get to solve many of these challenges faster -- and stay organized and focused on your goals.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "I like the variety of features the platform offers. For someone looking to automate marketing across channels and save time, eSputnik is a great choice. It's impressive how many choices you have and how much you can expand your reach thanks to all these features.\n\nOn top of that, they have a great support team who's there to guide you anytime you need help."}, {"question": "What do you dislike about eSputnik?", "answer": "So far, I haven't encountered anything I don't like about the platform."}, {"question": "Recommendations to others considering eSputnik:", "answer": "Reliable and complex tool for marketing automation and great support!"}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "Marketing your business across several channels can be challenging. The greatest benefit of using eSputnik is that you get to solve many of these challenges faster -- and stay organized and focused on your goals."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Corina L.", "reviewer_job_title": "PR Manager", "reviewer_link": "https://www.g2.com/users/432bb207-54b2-47fa-ac37-1bc4a2352d62"}, "publish_date": "2020-08-27T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4363075"}, {"review_id": 4336534, "review_title": "Affordable, convenient, practical", "review_content": "What do you like best about eSputnik?\nThe most professional resource with a full range of marketing tools - emails, push messages, mobile push notifications, Viber messages, customer segmentation, customization of email scripts and much more\n\n*\tstatistical modules,\n*\tease of creating emails,\n*\taffordable prices compared to competitors,\n*\texcellent support service.\n\nThe service allows you to customize the entire chain of communication with the client, starting with a welcome chain of messages, letters of recommendation and new products, right up to geolocation, cross-platform solutions and additional products for the site.\n\nI especially like the bunch of emails, push notifications, Viber, mobile notifications, personal recommendations. All this cross-platform and omnichannel nature gives, if not fast, but very stable and long-term result, increasing customer loyalty. Everyone is pleased to receive beautiful messages made especially for him.\n\nWhat do you dislike about eSputnik?\nDue to the professional level of service, it is necessary to have a broad knowledge of email marketing. Of course, technical support can help and respond quickly. Nothing complicated for the basic level. But in order to solve serious problems, you will have to seek help from the specialists of this service for the complete setting of beautiful and high-quality email campaigns and other solutions.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWe decided to set up a complete chain of subscriptions, emails, scripts, scripts, etc. Our ROI in this area has grown by 137% over the year. The number of subscribers exceeded the number of unsubscriptions in a month by 7 times. Our clients receive personal recommendations, notifications, news and promotional offers on all channels convenient for them.\nThis is one of the most advanced and professional solution on the market.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "The most professional resource with a full range of marketing tools - emails, push messages, mobile push notifications, Viber messages, customer segmentation, customization of email scripts and much more\n\n*\tstatistical modules,\n*\tease of creating emails,\n*\taffordable prices compared to competitors,\n*\texcellent support service.\n\nThe service allows you to customize the entire chain of communication with the client, starting with a welcome chain of messages, letters of recommendation and new products, right up to geolocation, cross-platform solutions and additional products for the site.\n\nI especially like the bunch of emails, push notifications, Viber, mobile notifications, personal recommendations. All this cross-platform and omnichannel nature gives, if not fast, but very stable and long-term result, increasing customer loyalty. Everyone is pleased to receive beautiful messages made especially for him."}, {"question": "What do you dislike about eSputnik?", "answer": "Due to the professional level of service, it is necessary to have a broad knowledge of email marketing. Of course, technical support can help and respond quickly. Nothing complicated for the basic level. But in order to solve serious problems, you will have to seek help from the specialists of this service for the complete setting of beautiful and high-quality email campaigns and other solutions."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "We decided to set up a complete chain of subscriptions, emails, scripts, scripts, etc. Our ROI in this area has grown by 137% over the year. The number of subscribers exceeded the number of unsubscriptions in a month by 7 times. Our clients receive personal recommendations, notifications, news and promotional offers on all channels convenient for them.\nThis is one of the most advanced and professional solution on the market."}], "review_rating": 4.5, "reviewer": {"reviewer_name": "Andrei .", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/952705cb-f949-4560-9d5f-3fae59ac26f4"}, "publish_date": "2020-08-10T00:00:00", "reviewer_company_size": "Enterprise(> 1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4336534"}, {"review_id": 4231062, "review_title": "Amazing email service and automation capabilities", "review_content": "What do you like best about eSputnik?\nThe whole tool is very convenient and easy to use: you don't have waste time searching for this or that feature in email editor. All frequently used blocks and controls are situated in sight.\n\nOmnichannel approach and automated workflows based on real-time events make eSputnik an irreplaceable assistant in accomplishing your marketing tasks. In addition. artificial Intelligence allows to predict customer behaviour and adapt your campaigns directly to the client's needs. Using this feature you can create great content with deep personalization for your audience.\n\nWhat do you dislike about eSputnik?\nI did not find any serious cons. Maybe only one: the pricing plans for web push notifications are not entirely clear.\n\nRecommendations to others considering eSputnik:\neSpuntnik can really benefit your business if you look beyond simple email marketing. This is a complete solution for setting up communication with your audience via all channels: emails, SMS, Viber, web and mobile push notifications. Optimal plan is the best way to start.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nThanks to eSpuntnik we were fully aware of the significance of omnichannel marketing and improved our automated workflows. I am convinced that this software can be helpful not only for small, but for large businesses too.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "The whole tool is very convenient and easy to use: you don't have waste time searching for this or that feature in email editor. All frequently used blocks and controls are situated in sight.\n\nOmnichannel approach and automated workflows based on real-time events make eSputnik an irreplaceable assistant in accomplishing your marketing tasks. In addition. artificial Intelligence allows to predict customer behaviour and adapt your campaigns directly to the client's needs. Using this feature you can create great content with deep personalization for your audience."}, {"question": "What do you dislike about eSputnik?", "answer": "I did not find any serious cons. Maybe only one: the pricing plans for web push notifications are not entirely clear."}, {"question": "Recommendations to others considering eSputnik:", "answer": "eSpuntnik can really benefit your business if you look beyond simple email marketing. This is a complete solution for setting up communication with your audience via all channels: emails, SMS, Viber, web and mobile push notifications. Optimal plan is the best way to start."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "Thanks to eSpuntnik we were fully aware of the significance of omnichannel marketing and improved our automated workflows. I am convinced that this software can be helpful not only for small, but for large businesses too."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Olga M.", "reviewer_job_title": "business development director", "reviewer_link": "https://www.g2.com/users/04273566-4bde-4dd4-9163-95c1bb01070e"}, "publish_date": "2020-05-21T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4231062"}, {"review_id": 4236205, "review_title": "eSputnik is the easiest email automation service", "review_content": "What do you like best about eSputnik?\n\"eSputnik is arguably one of the most convenient tool for marketing automation. I love how easy it makes it to build adaptive email templates and manage different blocks in email editor. If you've never launched promotional campaigns and want master email marketing, eSputnik is most likely best way to start.\n\nThere are also many interesting things for advanced users: integreation with CRM systems, event-triggered scenarios, mobile push notifications etc. And, of course, there are a lot of ready to use templates and newsletter examples for your help.\"\n\nWhat do you dislike about eSputnik?\nWe had some difficulties trying to import our contact database into the service. Fortunately, the problem resolved itself. Overall this tool is good and really effective.\n\nRecommendations to others considering eSputnik:\neSputnik is really cheaper than some other similar email systems. As for other advantages of the tool, I would like to highlight:\n\n- a user-friendly interface and simple dashboard\n- great library of email templates\n- Integration with API\n\nTry it for free to make sure it's great software not only for emailing, but for launching web pushes and social campaigns.\n\nWhat problems is eSputnik solving and how is that benefiting you?\n- We improved design of our newsletters and enjoyed working in eSputnik drag and drop editor.\n\n- Thanks to event-triggered scenarious our open rates have increased by 45%. So, we can safely say that deep customer personalization really works and bring amazing results.\n\n- We managed to significantly reduce our marketing costs and save a lot of time after implementation of automated workflows.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "\"eSputnik is arguably one of the most convenient tool for marketing automation. I love how easy it makes it to build adaptive email templates and manage different blocks in email editor. If you've never launched promotional campaigns and want master email marketing, eSputnik is most likely best way to start.\n\nThere are also many interesting things for advanced users: integreation with CRM systems, event-triggered scenarios, mobile push notifications etc. And, of course, there are a lot of ready to use templates and newsletter examples for your help.\""}, {"question": "What do you dislike about eSputnik?", "answer": "We had some difficulties trying to import our contact database into the service. Fortunately, the problem resolved itself. Overall this tool is good and really effective."}, {"question": "Recommendations to others considering eSputnik:", "answer": "eSputnik is really cheaper than some other similar email systems. As for other advantages of the tool, I would like to highlight:\n\n- a user-friendly interface and simple dashboard\n- great library of email templates\n- Integration with API\n\nTry it for free to make sure it's great software not only for emailing, but for launching web pushes and social campaigns."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "- We improved design of our newsletters and enjoyed working in eSputnik drag and drop editor.\n\n- Thanks to event-triggered scenarious our open rates have increased by 45%. So, we can safely say that deep customer personalization really works and bring amazing results.\n\n- We managed to significantly reduce our marketing costs and save a lot of time after implementation of automated workflows."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Vova C.", "reviewer_job_title": "Marketing Specialist", "reviewer_link": "https://www.g2.com/users/03e95be1-4ca2-4728-92b9-44efad7a8261"}, "publish_date": "2020-05-25T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4236205"}, {"review_id": 4231288, "review_title": "Best solution for segmentation and omnichannel campaigns", "review_content": "What do you like best about eSputnik?\nMost users I see here like eSputnik for its convenient email editor. It is really good, I won't argue. However, very few of them mention its advanced features like dynamic content, data-based recommendations, and personalized triggered messages. All this makes eSputnik professional tool for deep customer segmentation and omnichannel campaigns based on client's behaviour.\n\nThus, I would break down the myth that this software is only suitable for newbies and small businesses because it has a really great advanced functionality. Add into this mix affordable pricing plans and now you have an ideal solution for managing your marketing workflows.\n\nWhat do you dislike about eSputnik?\nWe've wasted enough time trying to launch mobile push notifications, but thanks to support team the problem was solved.\n\nRecommendations to others considering eSputnik:\neSputnik should not be seen as standard email automation service: it provides a comprehensive solution for sustomer communication management and launching omnichannel campaigns. Carefully examine all its capabilities and you'll see the full power of this software.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWe used to keep in touch with our audience mostly via email, but now we take full advantage of omnichannel approach. It allowed us to significantly expand the audience and increase client's engagement. And, sure, personalized content favorably affected our open rates and conversion.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "Most users I see here like eSputnik for its convenient email editor. It is really good, I won't argue. However, very few of them mention its advanced features like dynamic content, data-based recommendations, and personalized triggered messages. All this makes eSputnik professional tool for deep customer segmentation and omnichannel campaigns based on client's behaviour.\n\nThus, I would break down the myth that this software is only suitable for newbies and small businesses because it has a really great advanced functionality. Add into this mix affordable pricing plans and now you have an ideal solution for managing your marketing workflows."}, {"question": "What do you dislike about eSputnik?", "answer": "We've wasted enough time trying to launch mobile push notifications, but thanks to support team the problem was solved."}, {"question": "Recommendations to others considering eSputnik:", "answer": "eSputnik should not be seen as standard email automation service: it provides a comprehensive solution for sustomer communication management and launching omnichannel campaigns. Carefully examine all its capabilities and you'll see the full power of this software."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "We used to keep in touch with our audience mostly via email, but now we take full advantage of omnichannel approach. It allowed us to significantly expand the audience and increase client's engagement. And, sure, personalized content favorably affected our open rates and conversion."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Maryna K.", "reviewer_job_title": "Marketing Specialist", "reviewer_link": "https://www.g2.com/users/86fdd3d5-610f-4f19-8e1e-cff4b5bad575"}, "publish_date": "2020-05-21T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4231288"}, {"review_id": 4193369, "review_title": "Great experience with eSputnik", "review_content": "What do you like best about eSputnik?\n- can be integrated with Zapier, Google Sheets and Facebook Ads Manager;\n- contains plenty of interesting features like multilingual campaigns, mobile pushes, Viber messages, etc.;\n- great support services;\n- simple and convenient drag and drop editor.\n\nI like how easy it is to create email templates and translate them into other languages. This tool is an ideal solution for email campaigns and web push notifications.\n\nWhat do you dislike about eSputnik?\nThere is nothing I dislike so far. The software works really well.\n\nRecommendations to others considering eSputnik:\neSputnik is a great email automation service for any newbie to start with. It is much cheaper than most other email providers and really flexible.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nIt allows us to save time on newsletters and push notifications. The tool is distinguished by high deliverability and easy-to-use interface.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "- can be integrated with Zapier, Google Sheets and Facebook Ads Manager;\n- contains plenty of interesting features like multilingual campaigns, mobile pushes, Viber messages, etc.;\n- great support services;\n- simple and convenient drag and drop editor.\n\nI like how easy it is to create email templates and translate them into other languages. This tool is an ideal solution for email campaigns and web push notifications."}, {"question": "What do you dislike about eSputnik?", "answer": "There is nothing I dislike so far. The software works really well."}, {"question": "Recommendations to others considering eSputnik:", "answer": "eSputnik is a great email automation service for any newbie to start with. It is much cheaper than most other email providers and really flexible."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "It allows us to save time on newsletters and push notifications. The tool is distinguished by high deliverability and easy-to-use interface."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Russ U.", "reviewer_job_title": "Head Of Sales and Partnerships", "reviewer_link": "https://www.g2.com/users/7e24fe25-7416-4fd5-886b-25760ed96301"}, "publish_date": "2020-04-16T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4193369"}, {"review_id": 3999544, "review_title": "Awesome tool for multilingual campaigns", "review_content": "What do you like best about eSputnik?\nThere are a lot of things I like about eSputnik system, but primarily I want to highlight three main advantages:\n\n- This tool allows to launch multilingual campaigns and save a lot of time in translation. You can edit emails on different languages just in one template. Furthermore the send language can be determined automatically, because the system takes into account the client's location and profile.\n- Omnichannel technology: with eSputnik we created numerous Email, Viber and SMS campaigns.\n- I liked its beautiful and well-designed pre-built templates.\n\nWhat do you dislike about eSputnik?\nI didn't notice problems, everything is good for me.\n\nRecommendations to others considering eSputnik:\neSputnik is a great marketing automation tool to start your email and SMS campaigns.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWe have a lot of clients, which are located in different countries and speak different languages. Thanks to eSputnik we were able to simplify and speed up the interaction with our multilingual audience.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "There are a lot of things I like about eSputnik system, but primarily I want to highlight three main advantages:\n\n- This tool allows to launch multilingual campaigns and save a lot of time in translation. You can edit emails on different languages just in one template. Furthermore the send language can be determined automatically, because the system takes into account the client's location and profile.\n- Omnichannel technology: with eSputnik we created numerous Email, Viber and SMS campaigns.\n- I liked its beautiful and well-designed pre-built templates."}, {"question": "What do you dislike about eSputnik?", "answer": "I didn't notice problems, everything is good for me."}, {"question": "Recommendations to others considering eSputnik:", "answer": "eSputnik is a great marketing automation tool to start your email and SMS campaigns."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "We have a lot of clients, which are located in different countries and speak different languages. Thanks to eSputnik we were able to simplify and speed up the interaction with our multilingual audience."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Daria  P.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/174bdfd0-3762-4206-a704-35b90811a5c3"}, "publish_date": "2020-01-10T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-3999544"}, {"review_id": 4152422, "review_title": "Great software for web push notifications and email campaigns", "review_content": "What do you like best about eSputnik?\nThere are lots of cool features I like in eSputnik. Primarily it should be mentioned that this system allows to launch advanced and personalized web push notifications at really small price. You can add dynamic content to your web messages. Moreover, they can be compatible with Safari.\n\neSputnik will be also convenient tool for beginners looking for an inexpensive email automation service.\n\nWhat do you dislike about eSputnik?\nSome parts of the dashboard were not translated into English after sign up. Fortunately, this issue is resolved.\n\nRecommendations to others considering eSputnik:\nBuying Promo plan you will get web messages for free. It seems the best way to get started with web push notifications. But if your are looking for email campaigns pay attention to the Optimal plan.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWe managed to implement omnichannel marketing strategy and attract new clients via emails and push notifications.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "There are lots of cool features I like in eSputnik. Primarily it should be mentioned that this system allows to launch advanced and personalized web push notifications at really small price. You can add dynamic content to your web messages. Moreover, they can be compatible with Safari.\n\neSputnik will be also convenient tool for beginners looking for an inexpensive email automation service."}, {"question": "What do you dislike about eSputnik?", "answer": "Some parts of the dashboard were not translated into English after sign up. Fortunately, this issue is resolved."}, {"question": "Recommendations to others considering eSputnik:", "answer": "Buying Promo plan you will get web messages for free. It seems the best way to get started with web push notifications. But if your are looking for email campaigns pay attention to the Optimal plan."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "We managed to implement omnichannel marketing strategy and attract new clients via emails and push notifications."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Anastasiya M.", "reviewer_job_title": "Brand Manager", "reviewer_link": "https://www.g2.com/users/2651d36f-7a52-43a1-842a-403537052ecc"}, "publish_date": "2020-03-19T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4152422"}], "all_reviews": [{"review_id": 9591749, "review_title": "Eliminating routine campaign creation processes thanks to built-in AI", "review_content": "What do you like best about eSputnik?\n\"We chose eSputnik because of the possibility of omnichannel campaigns. We can use communication channels from cheap to expensive, depending on the type of content and customer segments.\nWe would also like to emphasize the ease of use of the system. The generative AI implemented in the system plays a vital role in this. It allows us to work on email content directly in the editor: translate, shorten, and expand texts. Also, thanks to the integrated AI in eSputnik, we can automate the creation of entire email modules. Just insert a link to the required page of your website into the module, and AI will generate the block using the description, price, and image on the page. The same gen AI allows you to create texts for push notifications. These solutions significantly reduce the team's time for routine tasks. At the same time, such campaigns receive high CTR. \"\n\nWhat do you dislike about eSputnik?\nOur team has not found any problems with this product, we plan to continue using eSputnik CDP\n\nWhat problems is eSputnik solving and how is that benefiting you?\nAutomation of campaigns creation, diversity of channels, fast ROI.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "\"We chose eSputnik because of the possibility of omnichannel campaigns. We can use communication channels from cheap to expensive, depending on the type of content and customer segments.\nWe would also like to emphasize the ease of use of the system. The generative AI implemented in the system plays a vital role in this. It allows us to work on email content directly in the editor: translate, shorten, and expand texts. Also, thanks to the integrated AI in eSputnik, we can automate the creation of entire email modules. Just insert a link to the required page of your website into the module, and AI will generate the block using the description, price, and image on the page. The same gen AI allows you to create texts for push notifications. These solutions significantly reduce the team's time for routine tasks. At the same time, such campaigns receive high CTR. \""}, {"question": "What do you dislike about eSputnik?", "answer": "Our team has not found any problems with this product, we plan to continue using eSputnik CDP"}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "Automation of campaigns creation, diversity of channels, fast ROI."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Inna S.", "reviewer_job_title": "Marketing Rockstar", "reviewer_link": "https://www.g2.com/users/8fa7dd5c-4f43-42df-9aa6-b7774ce72ca6"}, "publish_date": "2024-05-01T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-9591749"}, {"review_id": 9752794, "review_title": "Usable system with extensive functionality and flexible settings for omnichannel campaigns", "review_content": "What do you like best about eSputnik?\nThe eSputnik customer data platform has built-in functionality for organizing omnichannel marketing campaigns, while other systems require additional integrations. Thanks to this system, we have implemented omnichannel marketing using the following channels: email, push, In-App, and App Inbox. By combining data from different sources and channels and constantly enriching and analyzing information, we can better understand our customers and provide them with relevant content.\nThis has allowed us to create valuable and exciting campaigns for each audience segment. As a result, conversion from direct marketing increased by +7% over the past year.\n\nWhat do you dislike about eSputnik?\nWe haven't found any significant or noteworthy shortcomings.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nOptimization of routine tasks for creating campaigns. Freeing up human resources to find and test new hypotheses. Minimize technical errors. Increase the effectiveness of email campaigns.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "The eSputnik customer data platform has built-in functionality for organizing omnichannel marketing campaigns, while other systems require additional integrations. Thanks to this system, we have implemented omnichannel marketing using the following channels: email, push, In-App, and App Inbox. By combining data from different sources and channels and constantly enriching and analyzing information, we can better understand our customers and provide them with relevant content.\nThis has allowed us to create valuable and exciting campaigns for each audience segment. As a result, conversion from direct marketing increased by +7% over the past year."}, {"question": "What do you dislike about eSputnik?", "answer": "We haven't found any significant or noteworthy shortcomings."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "Optimization of routine tasks for creating campaigns. Freeing up human resources to find and test new hypotheses. Minimize technical errors. Increase the effectiveness of email campaigns."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Vladislav A.", "reviewer_job_title": "Vedushchii spetsialist po upravleniiu proektami", "reviewer_link": "https://www.g2.com/users/a365f221-b6c3-4a30-9cef-d866792dfd6e"}, "publish_date": "2024-06-05T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-9752794"}, {"review_id": 9528922, "review_title": "Effective omnichannel and automated push notification", "review_content": "What do you like best about eSputnik?\nOur company caters to a diverse audience, so omnichannel functionality is fundamentally important for us. Various age groups within our customer base prefer communication through different channels: some find it more convenient to receive messages in a mobile application, while others prefer email. CDP eSputnik perfectly fulfills our omnichannel needs, supporting communication through email, web and mobile push, In-App, App Inbox, SMS, Viber, and widgets.\n\nI would like to highlight web push separately. Conveniently, it can be used for communication with both registered users and those who have not yet registered on the site. Through web push, we capture the attention of new users, offer personalized discounts, send AI-generated product recommendations, provide updates on product ranges, and remind users about abandoned carts. Importantly, all these processes are automated and do not require additional time from our team.\n\nWhat do you dislike about eSputnik?\nWhile using the system, my team did not identify any significant shortcomings.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nThe greatest benefit is the ability to track all the user activity on our website and in the application and build an effective communication strategy with them based on real-time and conveniently structured data.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "Our company caters to a diverse audience, so omnichannel functionality is fundamentally important for us. Various age groups within our customer base prefer communication through different channels: some find it more convenient to receive messages in a mobile application, while others prefer email. CDP eSputnik perfectly fulfills our omnichannel needs, supporting communication through email, web and mobile push, In-App, App Inbox, SMS, Viber, and widgets.\n\nI would like to highlight web push separately. Conveniently, it can be used for communication with both registered users and those who have not yet registered on the site. Through web push, we capture the attention of new users, offer personalized discounts, send AI-generated product recommendations, provide updates on product ranges, and remind users about abandoned carts. Importantly, all these processes are automated and do not require additional time from our team."}, {"question": "What do you dislike about eSputnik?", "answer": "While using the system, my team did not identify any significant shortcomings."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "The greatest benefit is the ability to track all the user activity on our website and in the application and build an effective communication strategy with them based on real-time and conveniently structured data."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Dmitry C.", "reviewer_job_title": "CEO, Founder", "reviewer_link": "https://www.g2.com/users/4e0fbb93-9628-4b41-b6cc-1d46ecb246c9"}, "publish_date": "2024-04-11T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-9528922"}, {"review_id": 9589537, "review_title": "Better customer understanding", "review_content": "What do you like best about eSputnik?\n\"Thanks to eSputnik CDP, we were able to increase conversion rates and customer loyalty, and get better analytics.\nCompared to other solutions on the market, the main advantage of eSputnik CDP is the ability to collect all customer data in a single customer profile. This guarantees the completeness and relevance of information, which is the basis for further communication. We can be sure that campaigns are sent to the right audience for the right occasion. And even when we use expensive channels for mailing, these costs will pay off.\nIf we have questions about using the platform, the support team always responds promptly and solves all our problems.\"\n\nWhat do you dislike about eSputnik?\nThe eSputnik customer data platform fully solves our tasks, and we have not found any problems.\n\nWhat problems is eSputnik solving and how is that benefiting you?\neSputnik solves the problem of irrelevant communication and wasting marketing budgets on unnecessary communication.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "\"Thanks to eSputnik CDP, we were able to increase conversion rates and customer loyalty, and get better analytics.\nCompared to other solutions on the market, the main advantage of eSputnik CDP is the ability to collect all customer data in a single customer profile. This guarantees the completeness and relevance of information, which is the basis for further communication. We can be sure that campaigns are sent to the right audience for the right occasion. And even when we use expensive channels for mailing, these costs will pay off.\nIf we have questions about using the platform, the support team always responds promptly and solves all our problems.\""}, {"question": "What do you dislike about eSputnik?", "answer": "The eSputnik customer data platform fully solves our tasks, and we have not found any problems."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "eSputnik solves the problem of irrelevant communication and wasting marketing budgets on unnecessary communication."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Alice Z.", "reviewer_job_title": "Product Manager Assistant", "reviewer_link": "https://www.g2.com/users/alicez"}, "publish_date": "2024-04-30T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-9589537"}, {"review_id": 8934649, "review_title": "Improve your omnichannel marketing with eSputnik omnichannel CDP", "review_content": "What do you like best about eSputnik?\nWhen we realized the need for marketing automation, we chose omnichannel CDP eSputnik. Here are the reasons:\n- Advanced segmentation -- based on customer behavioral data that is constantly changing.\n- Personalized communication with all users. We're not just talking about simply calling them by name, but also matching personalized product recommendations, identifying the user's language, reducing annoyance by optimizing the number of campaigns.\n\n- The platform allows for flexible customization our communication strategies. Using omnichannel approach we promote new products, implement cross-selling and upselling techniques, transfer customers between categories, send transactional messages, and attract users' attention to other communication channels, such as social media. We use such channels as email, web push, SMS, and App Inbox.\n\n- eSputnik provides integrations with website builders, landing page platforms, and online stores through APIs.\n\n- The platform boasts comprehensive and convenient functionality, enabling us to launch complex campaigns and analyze their effectiveness without requiring additional technical specialists.\n\n- Integrated AI features in the email editor include translation, grammar checking, shortening or lengthening written texts, changing the tone of voice, and creating expert explanations.\n\n- Excellent customer support. This was particularly helpful when we encountered a problem with one of our mailings, as the issue was resolved promptly.\n\nWe have not regretted our choice once; all available functionality works well and is continually expanding.\n\nWhat do you dislike about eSputnik?\nThere were no visible shortcomings that I noticed -- a convenient and, most importantly, effective system.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nThe main benefit is an increase in sales. Features of eSputnik that contribute to this: unification of the customer base data and its deep segmentation, as well as the possibility of omnichannel communication and analysis of the effectiveness of launched campaigns.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "When we realized the need for marketing automation, we chose omnichannel CDP eSputnik. Here are the reasons:\n- Advanced segmentation -- based on customer behavioral data that is constantly changing.\n- Personalized communication with all users. We're not just talking about simply calling them by name, but also matching personalized product recommendations, identifying the user's language, reducing annoyance by optimizing the number of campaigns.\n\n- The platform allows for flexible customization our communication strategies. Using omnichannel approach we promote new products, implement cross-selling and upselling techniques, transfer customers between categories, send transactional messages, and attract users' attention to other communication channels, such as social media. We use such channels as email, web push, SMS, and App Inbox.\n\n- eSputnik provides integrations with website builders, landing page platforms, and online stores through APIs.\n\n- The platform boasts comprehensive and convenient functionality, enabling us to launch complex campaigns and analyze their effectiveness without requiring additional technical specialists.\n\n- Integrated AI features in the email editor include translation, grammar checking, shortening or lengthening written texts, changing the tone of voice, and creating expert explanations.\n\n- Excellent customer support. This was particularly helpful when we encountered a problem with one of our mailings, as the issue was resolved promptly.\n\nWe have not regretted our choice once; all available functionality works well and is continually expanding."}, {"question": "What do you dislike about eSputnik?", "answer": "There were no visible shortcomings that I noticed -- a convenient and, most importantly, effective system."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "The main benefit is an increase in sales. Features of eSputnik that contribute to this: unification of the customer base data and its deep segmentation, as well as the possibility of omnichannel communication and analysis of the effectiveness of launched campaigns."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Olena O.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/52006446-715b-44a0-a17d-e81437f06304"}, "publish_date": "2024-04-03T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-8934649"}, {"review_id": 9603712, "review_title": "Segmentation solution", "review_content": "What do you like best about eSputnik?\nThe customer data platform helped us to build detailed segments without unnecessary integrations, with which we can continue to work in the system (organize omnichannel mailings in different channels: email, app inbox, web push). We automatically transfer behavioral data from the website via web tracking, and use data on user behavior in mailings. Group building is fast and cohesive. We can use any static and behavioral customer data for segmentation. CDP also provides the ability to build segments based on event parameters; for example, create a segment of users who purchased X product for a certain amount of money during a specific period.\n\nWhat do you dislike about eSputnik?\nWe haven't noticed any problems with this customer data platform\n\nWhat problems is eSputnik solving and how is that benefiting you?\nThrough segmentation, we can better learn about our customers and better personalize communications with each group.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "The customer data platform helped us to build detailed segments without unnecessary integrations, with which we can continue to work in the system (organize omnichannel mailings in different channels: email, app inbox, web push). We automatically transfer behavioral data from the website via web tracking, and use data on user behavior in mailings. Group building is fast and cohesive. We can use any static and behavioral customer data for segmentation. CDP also provides the ability to build segments based on event parameters; for example, create a segment of users who purchased X product for a certain amount of money during a specific period."}, {"question": "What do you dislike about eSputnik?", "answer": "We haven't noticed any problems with this customer data platform"}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "Through segmentation, we can better learn about our customers and better personalize communications with each group."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Maister D.", "reviewer_job_title": "Co-Founder, CEO, COO, CVO", "reviewer_link": "https://www.g2.com/users/c4d78215-02b4-4414-8a95-e161254d1f6b"}, "publish_date": "2024-05-06T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-9603712"}, {"review_id": 9577596, "review_title": "eSputnik CDP: Empowering Omnichannel Communication Strategies for Success", "review_content": "What do you like best about eSputnik?\nVarious communication channels, including mobile, web push, emails, and messengers, have significantly contributed to increased customer engagement. Using omnichannel has allowed us to strengthen customer relationships and increase loyalty and trust. As a result, we receive a higher number of repeat orders from satisfied and loyal customers, confirming our strategy's effectiveness.\n\nWhat do you dislike about eSputnik?\nNo shortcomings were found, eSputnik CDP is the best solution for omnichannel interaction with each customer.\n\nWhat problems is eSputnik solving and how is that benefiting you?\neSputnik Omnichannel CDP solves goals:\n- understanding customers and their needs;\n- data collection;\n- personalization;\n- seamless customer communication across all channels.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "Various communication channels, including mobile, web push, emails, and messengers, have significantly contributed to increased customer engagement. Using omnichannel has allowed us to strengthen customer relationships and increase loyalty and trust. As a result, we receive a higher number of repeat orders from satisfied and loyal customers, confirming our strategy's effectiveness."}, {"question": "What do you dislike about eSputnik?", "answer": "No shortcomings were found, eSputnik CDP is the best solution for omnichannel interaction with each customer."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "eSputnik Omnichannel CDP solves goals:\n- understanding customers and their needs;\n- data collection;\n- personalization;\n- seamless customer communication across all channels."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Inga .", "reviewer_job_title": "Junior Marketing Manager", "reviewer_link": "https://www.g2.com/users/3234dff2-f6e3-4e76-a194-b2880457f67f"}, "publish_date": "2024-04-25T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-9577596"}, {"review_id": 4926645, "review_title": "A very convenient CDP for marketing automation", "review_content": "What do you like best about eSputnik?\nI think the main eSputnik's advantage is the deep customer segmentation feature that allows to collect and unify client's data in a single profile and set up automated personalized messages according to their behaviour. No need to segment the audience manually. Thanks to web-tracking scripts and AI-algorithms eSputnik will do all the work automatically.\n\nAnother great option is multilingual campaigns. You can easily translate your email template into any language in a few seconds.\n\nWhat do you dislike about eSputnik?\nThe setting up of event-triggered messages seemed a bit tangled. However, the dashboard is quite intuitive.\n\nRecommendations to others considering eSputnik:\neSputnik is a very convenient and cheep customer data platform for large business. There are a lot of great integrations and indispensable tools for e-commerce. It's definitely more than just regular ESP or ordinary email service.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWith eSputnik we managed to:\n\n- set up personalized omnichannel marketing campaigns;\n- unify all customer's data in one place;\n- save a lot of time thanks to automated workflows and machine learning.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "I think the main eSputnik's advantage is the deep customer segmentation feature that allows to collect and unify client's data in a single profile and set up automated personalized messages according to their behaviour. No need to segment the audience manually. Thanks to web-tracking scripts and AI-algorithms eSputnik will do all the work automatically.\n\nAnother great option is multilingual campaigns. You can easily translate your email template into any language in a few seconds."}, {"question": "What do you dislike about eSputnik?", "answer": "The setting up of event-triggered messages seemed a bit tangled. However, the dashboard is quite intuitive."}, {"question": "Recommendations to others considering eSputnik:", "answer": "eSputnik is a very convenient and cheep customer data platform for large business. There are a lot of great integrations and indispensable tools for e-commerce. It's definitely more than just regular ESP or ordinary email service."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "With eSputnik we managed to:\n\n- set up personalized omnichannel marketing campaigns;\n- unify all customer's data in one place;\n- save a lot of time thanks to automated workflows and machine learning."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Serhii K.", "reviewer_job_title": "Chief Operating Officer", "reviewer_link": "https://www.g2.com/users/d3ee0402-acb3-4346-ac29-ce5f29ad222a"}, "publish_date": "2021-08-11T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4926645"}, {"review_id": 4920206, "review_title": "eSputnik is a Perfect Customer Data Platform for Ecommerce", "review_content": "What do you like best about eSputnik?\n\"The functionality of this omnichannel system goes beyond a regular ESP or standard email marketing tool. eSputnik is a veritable CDP platform which provides a lot of unique features for Ecommerce:\n\n- Advanced data collection and deep contact list segmentation;\n- Profile unification features: personalizaed product recommendations, triggered messages etc;\n- AI-based algorithms for launching automated campaigns;\n- Multilingual transactional messages etc.\n\nIn addition, eSputnik can be easily integrated with almost any CRM system via API, ApiX-Drive or Zapier. A really good tool from ukrainian developpers!\"\n\nWhat do you dislike about eSputnik?\nThere's no serious cons in my opinion. The dashboard is really convenient. Besides that, eSputnik's support team can connect any advanced feature for you in case you can't do this by yourself.\n\nRecommendations to others considering eSputnik:\n\"eSputnik takes digital marketing to a whole new level. As a CDP platform it provides innovative and unique features for ecommerce and B2C. No need to tell about useful integrations with amoCRM, Shopify, Tilda, Facebook Ads Manager and other indispensable tools.\n\nA great cloud software for any large online business and marketplaces. Get a demo version first and try to test the system. And you will see how flexible and intuitive its interface is.\"\n\nWhat problems is eSputnik solving and how is that benefiting you?\nAlmost 55% of our marketing activities were automated with a three months. We managed to optimize our promotional campaigns and make it more personalized.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "\"The functionality of this omnichannel system goes beyond a regular ESP or standard email marketing tool. eSputnik is a veritable CDP platform which provides a lot of unique features for Ecommerce:\n\n- Advanced data collection and deep contact list segmentation;\n- Profile unification features: personalizaed product recommendations, triggered messages etc;\n- AI-based algorithms for launching automated campaigns;\n- Multilingual transactional messages etc.\n\nIn addition, eSputnik can be easily integrated with almost any CRM system via API, ApiX-Drive or Zapier. A really good tool from ukrainian developpers!\""}, {"question": "What do you dislike about eSputnik?", "answer": "There's no serious cons in my opinion. The dashboard is really convenient. Besides that, eSputnik's support team can connect any advanced feature for you in case you can't do this by yourself."}, {"question": "Recommendations to others considering eSputnik:", "answer": "\"eSputnik takes digital marketing to a whole new level. As a CDP platform it provides innovative and unique features for ecommerce and B2C. No need to tell about useful integrations with amoCRM, Shopify, Tilda, Facebook Ads Manager and other indispensable tools.\n\nA great cloud software for any large online business and marketplaces. Get a demo version first and try to test the system. And you will see how flexible and intuitive its interface is.\""}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "Almost 55% of our marketing activities were automated with a three months. We managed to optimize our promotional campaigns and make it more personalized."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Ekaterina .", "reviewer_job_title": "Parthner manager", "reviewer_link": "https://www.g2.com/users/2e4553b1-2ebd-4efd-a990-9b7876cb75a4"}, "publish_date": "2021-08-09T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4920206"}, {"review_id": 5473986, "review_title": "All in one marketing tool", "review_content": "What do you like best about eSputnik?\nE-Sputnik combines all ways and channels you need to communicate with your cusomers. It is very comfortable to run your email, Viber, sms, PUSH campaign from one dashboard.\n\nWhat do you dislike about eSputnik?\nI have not used e-Sputnik long enough to find some disadvantages. It is not that popular among my colleages, so sometimes new people in the team need time to learn the dashboard.\n\nWhat problems is eSputnik solving and how is that benefiting you?\neSputnik is good primarily for Push-notification and Viber campaigns. That is the main option I used eSputnik for. Sure, they have good feature for emails, but I did not use it much.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "E-Sputnik combines all ways and channels you need to communicate with your cusomers. It is very comfortable to run your email, Viber, sms, PUSH campaign from one dashboard."}, {"question": "What do you dislike about eSputnik?", "answer": "I have not used e-Sputnik long enough to find some disadvantages. It is not that popular among my colleages, so sometimes new people in the team need time to learn the dashboard."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "eSputnik is good primarily for Push-notification and Viber campaigns. That is the main option I used eSputnik for. Sure, they have good feature for emails, but I did not use it much."}], "review_rating": 4.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2022-03-31T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-5473986"}, {"review_id": 4787178, "review_title": "Nice Omnichannel Platform for E-Commerce", "review_content": "What do you like best about eSputnik?\neSputnik isn't ordinary email service. This is a multifunctional platform for marketing automation providing a lot of unique features especially for online stores and e-commerce projects. With eSputnik you can set up client's behaviour tracker to your website, launch triggered campaigns with product recommendations or adjust AI algorithms to improve your customer segmentation.\n\nSome of our clients are using eSputnik as the main ESP system in their marketing workflows. Moreover, it can be easily integrated with any CRM software via Zapier or API.\n\nWhat do you dislike about eSputnik?\nThere's nothing I dislike about this email service. Of course, some advanced functionality may seem quite complicated. But you can always contact support team to receive answers to all your questions.\n\nRecommendations to others considering eSputnik:\neSputnik is a nice alternate ESP for any kind of e-commerce regardless of the size of your business. It will be suitable for launching regular simple email campaigns. And at the same time, it can be a great additional instrument for your advanced marketing tactics.\n\nI recommend trying some basic features first (Email campaigns, SMS, Web Pushes) to understand this system, and then you'll be able to fall deeper in its architecture.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWith eSputnik we managed to automate our email campaigns to 90% and have optimized the work of our marketing department. We saved a lot of time resource and now can use it more efficiently.\n\nThanks to personalized triggered messages we increased our open rates to 17% and now are seeing the stable growth of email conversion rate.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "eSputnik isn't ordinary email service. This is a multifunctional platform for marketing automation providing a lot of unique features especially for online stores and e-commerce projects. With eSputnik you can set up client's behaviour tracker to your website, launch triggered campaigns with product recommendations or adjust AI algorithms to improve your customer segmentation.\n\nSome of our clients are using eSputnik as the main ESP system in their marketing workflows. Moreover, it can be easily integrated with any CRM software via Zapier or API."}, {"question": "What do you dislike about eSputnik?", "answer": "There's nothing I dislike about this email service. Of course, some advanced functionality may seem quite complicated. But you can always contact support team to receive answers to all your questions."}, {"question": "Recommendations to others considering eSputnik:", "answer": "eSputnik is a nice alternate ESP for any kind of e-commerce regardless of the size of your business. It will be suitable for launching regular simple email campaigns. And at the same time, it can be a great additional instrument for your advanced marketing tactics.\n\nI recommend trying some basic features first (Email campaigns, SMS, Web Pushes) to understand this system, and then you'll be able to fall deeper in its architecture."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "With eSputnik we managed to automate our email campaigns to 90% and have optimized the work of our marketing department. We saved a lot of time resource and now can use it more efficiently.\n\nThanks to personalized triggered messages we increased our open rates to 17% and now are seeing the stable growth of email conversion rate."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Nataliia B.", "reviewer_job_title": "Junior Marketing Manager", "reviewer_link": "https://www.g2.com/users/e7539618-0725-4a3a-8acf-277920996925"}, "publish_date": "2021-06-08T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4787178"}, {"review_id": 4530023, "review_title": "Perfect Email Service Provider", "review_content": "What do you like best about eSputnik?\neSputnik provides deep segmentation features and allows to build flexible automated workflows. Thanks to this functionality and convenient dashboard you'll save a lot of time for launching email and web push campaigns.\n\nSupport team is always available in online chat and via email: with their help, we managed to master AI-powered scenarios and launch our first transactional emails in the shortest possible time.\n\nWhat do you dislike about eSputnik?\nWell, there's nothing I dislike about eSputnik. They are a great alternative to the popular ESPs.\n\nRecommendations to others considering eSputnik:\nIts functionality does not concede to known email marketing services like MailChimp or GetResponse. And finally, it can be integrated with any CRM system via Zapier. You can start with the Optimal Plan and assess all the main system possibilities at the lowest price.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWith eSputnik we managed to:\n\n- launch our first triggered campaigns to the new users\n- reactivate more than 20% of our old subscribers via push notifications\n- increase email open rates by 24%\n- redesign most of our newsletters in the shortest time", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "eSputnik provides deep segmentation features and allows to build flexible automated workflows. Thanks to this functionality and convenient dashboard you'll save a lot of time for launching email and web push campaigns.\n\nSupport team is always available in online chat and via email: with their help, we managed to master AI-powered scenarios and launch our first transactional emails in the shortest possible time."}, {"question": "What do you dislike about eSputnik?", "answer": "Well, there's nothing I dislike about eSputnik. They are a great alternative to the popular ESPs."}, {"question": "Recommendations to others considering eSputnik:", "answer": "Its functionality does not concede to known email marketing services like MailChimp or GetResponse. And finally, it can be integrated with any CRM system via Zapier. You can start with the Optimal Plan and assess all the main system possibilities at the lowest price."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "With eSputnik we managed to:\n\n- launch our first triggered campaigns to the new users\n- reactivate more than 20% of our old subscribers via push notifications\n- increase email open rates by 24%\n- redesign most of our newsletters in the shortest time"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "EVADAV L.", "reviewer_job_title": "Marketing and Advertising", "reviewer_link": "https://www.g2.com/users/566ed9ca-303d-4106-afe6-4de20ab18c4b"}, "publish_date": "2020-12-21T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4530023"}, {"review_id": 4874168, "review_title": "eSputnik as a email marketing tool", "review_content": "What do you like best about eSputnik?\nThis tool is one of the easiest and cheapest on market. It provides a lot of useful functionalities, especially in the free tier.\n\nWhat do you dislike about eSputnik?\nThe UI of eSputnik is not the best but it's cool in terms of UX - you can easily find whatever you need.\n\nWhat problems is eSputnik solving and how is that benefiting you?\neSputnik was used in an NGO for email marketing and communication with participants. With this tool, we engaged some people to our activities and kept them updated about the news.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "This tool is one of the easiest and cheapest on market. It provides a lot of useful functionalities, especially in the free tier."}, {"question": "What do you dislike about eSputnik?", "answer": "The UI of eSputnik is not the best but it's cool in terms of UX - you can easily find whatever you need."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "eSputnik was used in an NGO for email marketing and communication with participants. With this tool, we engaged some people to our activities and kept them updated about the news."}], "review_rating": 4.5, "reviewer": {"reviewer_name": "Mykola K.", "reviewer_job_title": "Project Manager", "reviewer_link": "https://www.g2.com/users/dc8bdc57-1062-46fb-84b6-fb3c85585cf2"}, "publish_date": "2021-07-19T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4874168"}, {"review_id": 4499763, "review_title": "Improve your email marketing with eSputnik", "review_content": "What do you like best about eSputnik?\nFirstly, eSputnik has a friendly user interface and convenient email builder. You don't have to be email marketing guru to launch your first campaigns.\n\nSecondly, it's a great omnichannel solution for online stores: you can set up product recommendations on your website or adjust automated triggered campaigns according to the customer's behaviour. Each client will receive personalized email based on his interests.\n\nFinally, eSputnik offers a lot of deep client segmentation features. That's exactly what professional marketers need in 2020.\n\nWhat do you dislike about eSputnik?\nAdvanced segmentation manuals seem to be a bit complicated. But finally, thanks to the support team, we managed to launch it the right way.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWe managed to improve our email marketing personalization and attract new customers via emails, SMS and push notifications.\n\nThanks to the triggered messages and improved segments our email open rates increased by 37%. This tactic has had a positive effect on the conversion rates as well.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "Firstly, eSputnik has a friendly user interface and convenient email builder. You don't have to be email marketing guru to launch your first campaigns.\n\nSecondly, it's a great omnichannel solution for online stores: you can set up product recommendations on your website or adjust automated triggered campaigns according to the customer's behaviour. Each client will receive personalized email based on his interests.\n\nFinally, eSputnik offers a lot of deep client segmentation features. That's exactly what professional marketers need in 2020."}, {"question": "What do you dislike about eSputnik?", "answer": "Advanced segmentation manuals seem to be a bit complicated. But finally, thanks to the support team, we managed to launch it the right way."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "We managed to improve our email marketing personalization and attract new customers via emails, SMS and push notifications.\n\nThanks to the triggered messages and improved segments our email open rates increased by 37%. This tactic has had a positive effect on the conversion rates as well."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Anastasia B.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/68506625-0a21-4092-8c51-c7de96dceeba"}, "publish_date": "2020-11-30T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4499763"}, {"review_id": 4602874, "review_title": "eSputnik is an innovative platform to manage your marketing projects", "review_content": "What do you like best about eSputnik?\nThis marketing automation solution has a complete portfolio of tools that will provide you with all the necessary capabilities to work and simplify all marketing tasks, the great strength of this program is in the tools to develop email marketing campaigns as it has a great editor, you can manage multichannel campaigns, reports, analysis and performance metrics, it has an excellent price-quality ratio and a very smart technical support\n\nWhat do you dislike about eSputnik?\nThe audience segmentation function is not what you expect in fact the segmentation is almost null, the integrations are scarce is a shame because this could improve this program much more, it is difficult to determine the time to send marketing or promotional content to all your visitors especially if you do not have a previous analysis of the tastes of each of them, it does not have mobile applications and it does not have a free version either\n\nRecommendations to others considering eSputnik:\nI recommend eSputnik because the B2B cloud hosted marketing automation system is one of the best as the set of professional features and capabilities it offers are very good in relation to other software as it provides many facilities to create content, manage marketing campaigns and measure the performance of them, in other aspects the price quality ratio is great and the technical support provides very smart solutions\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWe use eSputnik to solve problems in the marketing department, such as creating advertising content for all our audience, the email marketing automation solution that this software has given us has been one of the best things that has happened to us since we can not only create advertising easily for a large number of people if not also measure the performance of each of them once they are active so we can know what we should improve", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "This marketing automation solution has a complete portfolio of tools that will provide you with all the necessary capabilities to work and simplify all marketing tasks, the great strength of this program is in the tools to develop email marketing campaigns as it has a great editor, you can manage multichannel campaigns, reports, analysis and performance metrics, it has an excellent price-quality ratio and a very smart technical support"}, {"question": "What do you dislike about eSputnik?", "answer": "The audience segmentation function is not what you expect in fact the segmentation is almost null, the integrations are scarce is a shame because this could improve this program much more, it is difficult to determine the time to send marketing or promotional content to all your visitors especially if you do not have a previous analysis of the tastes of each of them, it does not have mobile applications and it does not have a free version either"}, {"question": "Recommendations to others considering eSputnik:", "answer": "I recommend eSputnik because the B2B cloud hosted marketing automation system is one of the best as the set of professional features and capabilities it offers are very good in relation to other software as it provides many facilities to create content, manage marketing campaigns and measure the performance of them, in other aspects the price quality ratio is great and the technical support provides very smart solutions"}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "We use eSputnik to solve problems in the marketing department, such as creating advertising content for all our audience, the email marketing automation solution that this software has given us has been one of the best things that has happened to us since we can not only create advertising easily for a large number of people if not also measure the performance of each of them once they are active so we can know what we should improve"}], "review_rating": 4.5, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2021-02-16T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4602874"}, {"review_id": 4318039, "review_title": "eSputnik allowed us to create high impact advertising campaigns for our company", "review_content": "What do you like best about eSputnik?\nIt provides an excellent tool to automate the processes concerning our company's digital marketing campaigns, not to mention that the system is provided with a wide variety of templates and resources that facilitate the creation and edition of unpublished and highly creative content for our advertising campaigns.\nIt has a multi-language system for the creation of our advertising campaigns, which allows us to reach a higher level of people, which translates into greater customer acquisition for our business, thus offering the possibility of increasing our income.\nIt has an excellent market segmentation tool, which allows us to design strategies aimed at the target audience that we really want to reach.\n\nWhat do you dislike about eSputnik?\nIt does not allow integration with Facebook Ads, which being a tool widely used by people constitutes a high-value tool to generate greater reach in our digital marketing campaign, since it allows the integration of own resources of social networks for the analysis of our potential clients.\nAdditionally, there are too many restrictions regarding the size of the content we want to generate.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nIt was used to carry out the digital marketing campaigns of my business, obtaining favorable results after the implementation of this system, thus allowing high impact advertising campaigns for our company.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "It provides an excellent tool to automate the processes concerning our company's digital marketing campaigns, not to mention that the system is provided with a wide variety of templates and resources that facilitate the creation and edition of unpublished and highly creative content for our advertising campaigns.\nIt has a multi-language system for the creation of our advertising campaigns, which allows us to reach a higher level of people, which translates into greater customer acquisition for our business, thus offering the possibility of increasing our income.\nIt has an excellent market segmentation tool, which allows us to design strategies aimed at the target audience that we really want to reach."}, {"question": "What do you dislike about eSputnik?", "answer": "It does not allow integration with Facebook Ads, which being a tool widely used by people constitutes a high-value tool to generate greater reach in our digital marketing campaign, since it allows the integration of own resources of social networks for the analysis of our potential clients.\nAdditionally, there are too many restrictions regarding the size of the content we want to generate."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "It was used to carry out the digital marketing campaigns of my business, obtaining favorable results after the implementation of this system, thus allowing high impact advertising campaigns for our company."}], "review_rating": 3.0, "reviewer": {"reviewer_name": "Jessenia C.", "reviewer_job_title": "Gerente de Operacoes de RH", "reviewer_link": "https://www.g2.com/users/e8e4ad20-76e4-4d6d-8bcc-e50cf195d634"}, "publish_date": "2020-07-27T00:00:00", "reviewer_company_size": "Enterprise(> 1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4318039"}, {"review_id": 4518884, "review_title": "eSputnik offers you professional tools to create your marketing campaigns", "review_content": "What do you like best about eSputnik?\neSputnik is an innovative marketing automation solution hosted in the B2C cloud. This software offers a set of tools and professional capabilities that make email marketing a very simple task in many aspects, has a fantastic editor with which you can make really convincing emails and increase your chances, has great capacity for reporting and analysis, reporting on campaigns and to finish an account with powerful segmentation function that will allow you to manage your prospects more effectively\n\nWhat do you dislike about eSputnik?\neSputnik is a software with those collaboration features so it is almost a null solution to work in teams, mobile applications are not available is a pretty important point because it is always quite useful to have these applications, it is extremely difficult to determine exactly the best method to send marketing content to visitors of your digital content especially if you do it manually\n\nRecommendations to others considering eSputnik:\neSputnik is a really great option to carry out all your marketing activities and lead tracking, I recommend it for its ease to create emails, its power to create very accurate analysis and reports that are useful to measure the likelihood of a sale and finally its segmentation functions that allow us to achieve more effective and lasting relationships with all our customers\n\nWhat problems is eSputnik solving and how is that benefiting you?\neSputnik has solved one of the most important problems of my organization which is the creation of marketing campaigns, this software has provided us with great features such as the interaction creator, email editor, target segmentation and the power to manage multiple marketing channels, all these features have allowed us to develop truly effective marketing strategies and execute a number of actions that have served to get more sales and opportunities to get many more customers. We are very satisfied with the progress we have made since using eSputnik", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "eSputnik is an innovative marketing automation solution hosted in the B2C cloud. This software offers a set of tools and professional capabilities that make email marketing a very simple task in many aspects, has a fantastic editor with which you can make really convincing emails and increase your chances, has great capacity for reporting and analysis, reporting on campaigns and to finish an account with powerful segmentation function that will allow you to manage your prospects more effectively"}, {"question": "What do you dislike about eSputnik?", "answer": "eSputnik is a software with those collaboration features so it is almost a null solution to work in teams, mobile applications are not available is a pretty important point because it is always quite useful to have these applications, it is extremely difficult to determine exactly the best method to send marketing content to visitors of your digital content especially if you do it manually"}, {"question": "Recommendations to others considering eSputnik:", "answer": "eSputnik is a really great option to carry out all your marketing activities and lead tracking, I recommend it for its ease to create emails, its power to create very accurate analysis and reports that are useful to measure the likelihood of a sale and finally its segmentation functions that allow us to achieve more effective and lasting relationships with all our customers"}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "eSputnik has solved one of the most important problems of my organization which is the creation of marketing campaigns, this software has provided us with great features such as the interaction creator, email editor, target segmentation and the power to manage multiple marketing channels, all these features have allowed us to develop truly effective marketing strategies and execute a number of actions that have served to get more sales and opportunities to get many more customers. We are very satisfied with the progress we have made since using eSputnik"}], "review_rating": 4.5, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2020-12-14T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4518884"}, {"review_id": 4363075, "review_title": "Reliable marketing automation tool", "review_content": "What do you like best about eSputnik?\nI like the variety of features the platform offers. For someone looking to automate marketing across channels and save time, eSputnik is a great choice. It's impressive how many choices you have and how much you can expand your reach thanks to all these features.\n\nOn top of that, they have a great support team who's there to guide you anytime you need help.\n\nWhat do you dislike about eSputnik?\nSo far, I haven't encountered anything I don't like about the platform.\n\nRecommendations to others considering eSputnik:\nReliable and complex tool for marketing automation and great support!\n\nWhat problems is eSputnik solving and how is that benefiting you?\nMarketing your business across several channels can be challenging. The greatest benefit of using eSputnik is that you get to solve many of these challenges faster -- and stay organized and focused on your goals.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "I like the variety of features the platform offers. For someone looking to automate marketing across channels and save time, eSputnik is a great choice. It's impressive how many choices you have and how much you can expand your reach thanks to all these features.\n\nOn top of that, they have a great support team who's there to guide you anytime you need help."}, {"question": "What do you dislike about eSputnik?", "answer": "So far, I haven't encountered anything I don't like about the platform."}, {"question": "Recommendations to others considering eSputnik:", "answer": "Reliable and complex tool for marketing automation and great support!"}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "Marketing your business across several channels can be challenging. The greatest benefit of using eSputnik is that you get to solve many of these challenges faster -- and stay organized and focused on your goals."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Corina L.", "reviewer_job_title": "PR Manager", "reviewer_link": "https://www.g2.com/users/432bb207-54b2-47fa-ac37-1bc4a2352d62"}, "publish_date": "2020-08-27T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4363075"}, {"review_id": 4336534, "review_title": "Affordable, convenient, practical", "review_content": "What do you like best about eSputnik?\nThe most professional resource with a full range of marketing tools - emails, push messages, mobile push notifications, Viber messages, customer segmentation, customization of email scripts and much more\n\n*\tstatistical modules,\n*\tease of creating emails,\n*\taffordable prices compared to competitors,\n*\texcellent support service.\n\nThe service allows you to customize the entire chain of communication with the client, starting with a welcome chain of messages, letters of recommendation and new products, right up to geolocation, cross-platform solutions and additional products for the site.\n\nI especially like the bunch of emails, push notifications, Viber, mobile notifications, personal recommendations. All this cross-platform and omnichannel nature gives, if not fast, but very stable and long-term result, increasing customer loyalty. Everyone is pleased to receive beautiful messages made especially for him.\n\nWhat do you dislike about eSputnik?\nDue to the professional level of service, it is necessary to have a broad knowledge of email marketing. Of course, technical support can help and respond quickly. Nothing complicated for the basic level. But in order to solve serious problems, you will have to seek help from the specialists of this service for the complete setting of beautiful and high-quality email campaigns and other solutions.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWe decided to set up a complete chain of subscriptions, emails, scripts, scripts, etc. Our ROI in this area has grown by 137% over the year. The number of subscribers exceeded the number of unsubscriptions in a month by 7 times. Our clients receive personal recommendations, notifications, news and promotional offers on all channels convenient for them.\nThis is one of the most advanced and professional solution on the market.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "The most professional resource with a full range of marketing tools - emails, push messages, mobile push notifications, Viber messages, customer segmentation, customization of email scripts and much more\n\n*\tstatistical modules,\n*\tease of creating emails,\n*\taffordable prices compared to competitors,\n*\texcellent support service.\n\nThe service allows you to customize the entire chain of communication with the client, starting with a welcome chain of messages, letters of recommendation and new products, right up to geolocation, cross-platform solutions and additional products for the site.\n\nI especially like the bunch of emails, push notifications, Viber, mobile notifications, personal recommendations. All this cross-platform and omnichannel nature gives, if not fast, but very stable and long-term result, increasing customer loyalty. Everyone is pleased to receive beautiful messages made especially for him."}, {"question": "What do you dislike about eSputnik?", "answer": "Due to the professional level of service, it is necessary to have a broad knowledge of email marketing. Of course, technical support can help and respond quickly. Nothing complicated for the basic level. But in order to solve serious problems, you will have to seek help from the specialists of this service for the complete setting of beautiful and high-quality email campaigns and other solutions."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "We decided to set up a complete chain of subscriptions, emails, scripts, scripts, etc. Our ROI in this area has grown by 137% over the year. The number of subscribers exceeded the number of unsubscriptions in a month by 7 times. Our clients receive personal recommendations, notifications, news and promotional offers on all channels convenient for them.\nThis is one of the most advanced and professional solution on the market."}], "review_rating": 4.5, "reviewer": {"reviewer_name": "Andrei .", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/952705cb-f949-4560-9d5f-3fae59ac26f4"}, "publish_date": "2020-08-10T00:00:00", "reviewer_company_size": "Enterprise(> 1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4336534"}, {"review_id": 4231062, "review_title": "Amazing email service and automation capabilities", "review_content": "What do you like best about eSputnik?\nThe whole tool is very convenient and easy to use: you don't have waste time searching for this or that feature in email editor. All frequently used blocks and controls are situated in sight.\n\nOmnichannel approach and automated workflows based on real-time events make eSputnik an irreplaceable assistant in accomplishing your marketing tasks. In addition. artificial Intelligence allows to predict customer behaviour and adapt your campaigns directly to the client's needs. Using this feature you can create great content with deep personalization for your audience.\n\nWhat do you dislike about eSputnik?\nI did not find any serious cons. Maybe only one: the pricing plans for web push notifications are not entirely clear.\n\nRecommendations to others considering eSputnik:\neSpuntnik can really benefit your business if you look beyond simple email marketing. This is a complete solution for setting up communication with your audience via all channels: emails, SMS, Viber, web and mobile push notifications. Optimal plan is the best way to start.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nThanks to eSpuntnik we were fully aware of the significance of omnichannel marketing and improved our automated workflows. I am convinced that this software can be helpful not only for small, but for large businesses too.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "The whole tool is very convenient and easy to use: you don't have waste time searching for this or that feature in email editor. All frequently used blocks and controls are situated in sight.\n\nOmnichannel approach and automated workflows based on real-time events make eSputnik an irreplaceable assistant in accomplishing your marketing tasks. In addition. artificial Intelligence allows to predict customer behaviour and adapt your campaigns directly to the client's needs. Using this feature you can create great content with deep personalization for your audience."}, {"question": "What do you dislike about eSputnik?", "answer": "I did not find any serious cons. Maybe only one: the pricing plans for web push notifications are not entirely clear."}, {"question": "Recommendations to others considering eSputnik:", "answer": "eSpuntnik can really benefit your business if you look beyond simple email marketing. This is a complete solution for setting up communication with your audience via all channels: emails, SMS, Viber, web and mobile push notifications. Optimal plan is the best way to start."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "Thanks to eSpuntnik we were fully aware of the significance of omnichannel marketing and improved our automated workflows. I am convinced that this software can be helpful not only for small, but for large businesses too."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Olga M.", "reviewer_job_title": "business development director", "reviewer_link": "https://www.g2.com/users/04273566-4bde-4dd4-9163-95c1bb01070e"}, "publish_date": "2020-05-21T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4231062"}, {"review_id": 4236205, "review_title": "eSputnik is the easiest email automation service", "review_content": "What do you like best about eSputnik?\n\"eSputnik is arguably one of the most convenient tool for marketing automation. I love how easy it makes it to build adaptive email templates and manage different blocks in email editor. If you've never launched promotional campaigns and want master email marketing, eSputnik is most likely best way to start.\n\nThere are also many interesting things for advanced users: integreation with CRM systems, event-triggered scenarios, mobile push notifications etc. And, of course, there are a lot of ready to use templates and newsletter examples for your help.\"\n\nWhat do you dislike about eSputnik?\nWe had some difficulties trying to import our contact database into the service. Fortunately, the problem resolved itself. Overall this tool is good and really effective.\n\nRecommendations to others considering eSputnik:\neSputnik is really cheaper than some other similar email systems. As for other advantages of the tool, I would like to highlight:\n\n- a user-friendly interface and simple dashboard\n- great library of email templates\n- Integration with API\n\nTry it for free to make sure it's great software not only for emailing, but for launching web pushes and social campaigns.\n\nWhat problems is eSputnik solving and how is that benefiting you?\n- We improved design of our newsletters and enjoyed working in eSputnik drag and drop editor.\n\n- Thanks to event-triggered scenarious our open rates have increased by 45%. So, we can safely say that deep customer personalization really works and bring amazing results.\n\n- We managed to significantly reduce our marketing costs and save a lot of time after implementation of automated workflows.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "\"eSputnik is arguably one of the most convenient tool for marketing automation. I love how easy it makes it to build adaptive email templates and manage different blocks in email editor. If you've never launched promotional campaigns and want master email marketing, eSputnik is most likely best way to start.\n\nThere are also many interesting things for advanced users: integreation with CRM systems, event-triggered scenarios, mobile push notifications etc. And, of course, there are a lot of ready to use templates and newsletter examples for your help.\""}, {"question": "What do you dislike about eSputnik?", "answer": "We had some difficulties trying to import our contact database into the service. Fortunately, the problem resolved itself. Overall this tool is good and really effective."}, {"question": "Recommendations to others considering eSputnik:", "answer": "eSputnik is really cheaper than some other similar email systems. As for other advantages of the tool, I would like to highlight:\n\n- a user-friendly interface and simple dashboard\n- great library of email templates\n- Integration with API\n\nTry it for free to make sure it's great software not only for emailing, but for launching web pushes and social campaigns."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "- We improved design of our newsletters and enjoyed working in eSputnik drag and drop editor.\n\n- Thanks to event-triggered scenarious our open rates have increased by 45%. So, we can safely say that deep customer personalization really works and bring amazing results.\n\n- We managed to significantly reduce our marketing costs and save a lot of time after implementation of automated workflows."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Vova C.", "reviewer_job_title": "Marketing Specialist", "reviewer_link": "https://www.g2.com/users/03e95be1-4ca2-4728-92b9-44efad7a8261"}, "publish_date": "2020-05-25T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4236205"}, {"review_id": 4231288, "review_title": "Best solution for segmentation and omnichannel campaigns", "review_content": "What do you like best about eSputnik?\nMost users I see here like eSputnik for its convenient email editor. It is really good, I won't argue. However, very few of them mention its advanced features like dynamic content, data-based recommendations, and personalized triggered messages. All this makes eSputnik professional tool for deep customer segmentation and omnichannel campaigns based on client's behaviour.\n\nThus, I would break down the myth that this software is only suitable for newbies and small businesses because it has a really great advanced functionality. Add into this mix affordable pricing plans and now you have an ideal solution for managing your marketing workflows.\n\nWhat do you dislike about eSputnik?\nWe've wasted enough time trying to launch mobile push notifications, but thanks to support team the problem was solved.\n\nRecommendations to others considering eSputnik:\neSputnik should not be seen as standard email automation service: it provides a comprehensive solution for sustomer communication management and launching omnichannel campaigns. Carefully examine all its capabilities and you'll see the full power of this software.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWe used to keep in touch with our audience mostly via email, but now we take full advantage of omnichannel approach. It allowed us to significantly expand the audience and increase client's engagement. And, sure, personalized content favorably affected our open rates and conversion.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "Most users I see here like eSputnik for its convenient email editor. It is really good, I won't argue. However, very few of them mention its advanced features like dynamic content, data-based recommendations, and personalized triggered messages. All this makes eSputnik professional tool for deep customer segmentation and omnichannel campaigns based on client's behaviour.\n\nThus, I would break down the myth that this software is only suitable for newbies and small businesses because it has a really great advanced functionality. Add into this mix affordable pricing plans and now you have an ideal solution for managing your marketing workflows."}, {"question": "What do you dislike about eSputnik?", "answer": "We've wasted enough time trying to launch mobile push notifications, but thanks to support team the problem was solved."}, {"question": "Recommendations to others considering eSputnik:", "answer": "eSputnik should not be seen as standard email automation service: it provides a comprehensive solution for sustomer communication management and launching omnichannel campaigns. Carefully examine all its capabilities and you'll see the full power of this software."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "We used to keep in touch with our audience mostly via email, but now we take full advantage of omnichannel approach. It allowed us to significantly expand the audience and increase client's engagement. And, sure, personalized content favorably affected our open rates and conversion."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Maryna K.", "reviewer_job_title": "Marketing Specialist", "reviewer_link": "https://www.g2.com/users/86fdd3d5-610f-4f19-8e1e-cff4b5bad575"}, "publish_date": "2020-05-21T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4231288"}, {"review_id": 4193369, "review_title": "Great experience with eSputnik", "review_content": "What do you like best about eSputnik?\n- can be integrated with Zapier, Google Sheets and Facebook Ads Manager;\n- contains plenty of interesting features like multilingual campaigns, mobile pushes, Viber messages, etc.;\n- great support services;\n- simple and convenient drag and drop editor.\n\nI like how easy it is to create email templates and translate them into other languages. This tool is an ideal solution for email campaigns and web push notifications.\n\nWhat do you dislike about eSputnik?\nThere is nothing I dislike so far. The software works really well.\n\nRecommendations to others considering eSputnik:\neSputnik is a great email automation service for any newbie to start with. It is much cheaper than most other email providers and really flexible.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nIt allows us to save time on newsletters and push notifications. The tool is distinguished by high deliverability and easy-to-use interface.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "- can be integrated with Zapier, Google Sheets and Facebook Ads Manager;\n- contains plenty of interesting features like multilingual campaigns, mobile pushes, Viber messages, etc.;\n- great support services;\n- simple and convenient drag and drop editor.\n\nI like how easy it is to create email templates and translate them into other languages. This tool is an ideal solution for email campaigns and web push notifications."}, {"question": "What do you dislike about eSputnik?", "answer": "There is nothing I dislike so far. The software works really well."}, {"question": "Recommendations to others considering eSputnik:", "answer": "eSputnik is a great email automation service for any newbie to start with. It is much cheaper than most other email providers and really flexible."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "It allows us to save time on newsletters and push notifications. The tool is distinguished by high deliverability and easy-to-use interface."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Russ U.", "reviewer_job_title": "Head Of Sales and Partnerships", "reviewer_link": "https://www.g2.com/users/7e24fe25-7416-4fd5-886b-25760ed96301"}, "publish_date": "2020-04-16T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4193369"}, {"review_id": 3999544, "review_title": "Awesome tool for multilingual campaigns", "review_content": "What do you like best about eSputnik?\nThere are a lot of things I like about eSputnik system, but primarily I want to highlight three main advantages:\n\n- This tool allows to launch multilingual campaigns and save a lot of time in translation. You can edit emails on different languages just in one template. Furthermore the send language can be determined automatically, because the system takes into account the client's location and profile.\n- Omnichannel technology: with eSputnik we created numerous Email, Viber and SMS campaigns.\n- I liked its beautiful and well-designed pre-built templates.\n\nWhat do you dislike about eSputnik?\nI didn't notice problems, everything is good for me.\n\nRecommendations to others considering eSputnik:\neSputnik is a great marketing automation tool to start your email and SMS campaigns.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWe have a lot of clients, which are located in different countries and speak different languages. Thanks to eSputnik we were able to simplify and speed up the interaction with our multilingual audience.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "There are a lot of things I like about eSputnik system, but primarily I want to highlight three main advantages:\n\n- This tool allows to launch multilingual campaigns and save a lot of time in translation. You can edit emails on different languages just in one template. Furthermore the send language can be determined automatically, because the system takes into account the client's location and profile.\n- Omnichannel technology: with eSputnik we created numerous Email, Viber and SMS campaigns.\n- I liked its beautiful and well-designed pre-built templates."}, {"question": "What do you dislike about eSputnik?", "answer": "I didn't notice problems, everything is good for me."}, {"question": "Recommendations to others considering eSputnik:", "answer": "eSputnik is a great marketing automation tool to start your email and SMS campaigns."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "We have a lot of clients, which are located in different countries and speak different languages. Thanks to eSputnik we were able to simplify and speed up the interaction with our multilingual audience."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Daria  P.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/174bdfd0-3762-4206-a704-35b90811a5c3"}, "publish_date": "2020-01-10T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-3999544"}, {"review_id": 4152422, "review_title": "Great software for web push notifications and email campaigns", "review_content": "What do you like best about eSputnik?\nThere are lots of cool features I like in eSputnik. Primarily it should be mentioned that this system allows to launch advanced and personalized web push notifications at really small price. You can add dynamic content to your web messages. Moreover, they can be compatible with Safari.\n\neSputnik will be also convenient tool for beginners looking for an inexpensive email automation service.\n\nWhat do you dislike about eSputnik?\nSome parts of the dashboard were not translated into English after sign up. Fortunately, this issue is resolved.\n\nRecommendations to others considering eSputnik:\nBuying Promo plan you will get web messages for free. It seems the best way to get started with web push notifications. But if your are looking for email campaigns pay attention to the Optimal plan.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWe managed to implement omnichannel marketing strategy and attract new clients via emails and push notifications.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "There are lots of cool features I like in eSputnik. Primarily it should be mentioned that this system allows to launch advanced and personalized web push notifications at really small price. You can add dynamic content to your web messages. Moreover, they can be compatible with Safari.\n\neSputnik will be also convenient tool for beginners looking for an inexpensive email automation service."}, {"question": "What do you dislike about eSputnik?", "answer": "Some parts of the dashboard were not translated into English after sign up. Fortunately, this issue is resolved."}, {"question": "Recommendations to others considering eSputnik:", "answer": "Buying Promo plan you will get web messages for free. It seems the best way to get started with web push notifications. But if your are looking for email campaigns pay attention to the Optimal plan."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "We managed to implement omnichannel marketing strategy and attract new clients via emails and push notifications."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Anastasiya M.", "reviewer_job_title": "Brand Manager", "reviewer_link": "https://www.g2.com/users/2651d36f-7a52-43a1-842a-403537052ecc"}, "publish_date": "2020-03-19T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4152422"}, {"review_id": 4011801, "review_title": "eSputnik is everything you need for marketing automation", "review_content": "What do you like best about eSputnik?\neSputnik differs from other email automation services in its amazing functionality. Easy-to-handle interface makes it an ideal tool for newbies in email marketing.\n\nWe began with an optimal pricing plan. So, our last Web Push and Viber campaigns brought tangible impact to our conversion and open rates.\n\nWhat do you dislike about eSputnik?\nIt can't be integrated with Facebook Ads. It would be great to see this option added in the near future.\n\nRecommendations to others considering eSputnik:\nThe optimal pricing plan is the best way to learn all eSputnik features.\n\nWhat problems is eSputnik solving and how is that benefiting you?\n1) The attraction of new clients via Viber messages and Web Pushes.\n2) We significantly increased the number of our international clients by using multilingual email campaigns.\n3) eSputnik designers helped us to develop a lot of effective and attractive email templates.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "eSputnik differs from other email automation services in its amazing functionality. Easy-to-handle interface makes it an ideal tool for newbies in email marketing.\n\nWe began with an optimal pricing plan. So, our last Web Push and Viber campaigns brought tangible impact to our conversion and open rates."}, {"question": "What do you dislike about eSputnik?", "answer": "It can't be integrated with Facebook Ads. It would be great to see this option added in the near future."}, {"question": "Recommendations to others considering eSputnik:", "answer": "The optimal pricing plan is the best way to learn all eSputnik features."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "1) The attraction of new clients via Viber messages and Web Pushes.\n2) We significantly increased the number of our international clients by using multilingual email campaigns.\n3) eSputnik designers helped us to develop a lot of effective and attractive email templates."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Dmitry C.", "reviewer_job_title": "Chief Marketing Officer", "reviewer_link": "https://www.g2.com/users/90c27989-4160-4326-b2d1-6fe90c595417"}, "publish_date": "2020-01-13T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4011801"}, {"review_id": 4194395, "review_title": "User friendly tool for email campaigns", "review_content": "What do you like best about eSputnik?\nWe often use eSputnik to launch email and SMS campaigns in our company. I really like its simplified drag and drop editor with AMP support. In addition, eSputnik team can develop email template in corporate style of your website.\n\nWhat do you dislike about eSputnik?\nI didn't found serious disadvantages. Maybe it would be better to add more interesting integrations. Generally, this service met my expectations.\n\nRecommendations to others considering eSputnik:\nPay attention to eSputnik if you want to start your first email campaigns the right way. The team of specialists will help you to create an effective email template especially for your purposes.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nThis year we managed to increase sales via emails thanks to eSputnik. So, it was a great collaboration.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "We often use eSputnik to launch email and SMS campaigns in our company. I really like its simplified drag and drop editor with AMP support. In addition, eSputnik team can develop email template in corporate style of your website."}, {"question": "What do you dislike about eSputnik?", "answer": "I didn't found serious disadvantages. Maybe it would be better to add more interesting integrations. Generally, this service met my expectations."}, {"question": "Recommendations to others considering eSputnik:", "answer": "Pay attention to eSputnik if you want to start your first email campaigns the right way. The team of specialists will help you to create an effective email template especially for your purposes."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "This year we managed to increase sales via emails thanks to eSputnik. So, it was a great collaboration."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Yurii A.", "reviewer_job_title": "Marketing Specialist", "reviewer_link": "https://www.g2.com/users/f91a0547-0a95-4e6b-9013-00c2524041a8"}, "publish_date": "2020-04-17T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4194395"}, {"review_id": 4074578, "review_title": "With eSputnik the Email Automation is becoming easier and faster", "review_content": "What do you like best about eSputnik?\nWe have been using eSputnik for more than two years and can safely say: this tool includes everything you need to launch your email campaigns the right way. Amazing responsive templates and intuitive editor allow shorten the expenses of time and facilities for the letter structure development. Another significant advantage: eSputnik can be integrated with API.\n\nWhat do you dislike about eSputnik?\nEverything has met our expectations. But honestly, some features were hidden in the depths of the interface and I spent some time on searching them all. Anyways, it wasn't a huge issue.\n\nRecommendations to others considering eSputnik:\neSputnik is an amazing tool for email deployment and automated workflows. It is a cost-effective email solution for small to medium sized companies.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWe significantly improved the communication process with our customers via email. Using all benefits of email list segmentation technique we have made good progress in increasing three times the open rate of newsletters.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "We have been using eSputnik for more than two years and can safely say: this tool includes everything you need to launch your email campaigns the right way. Amazing responsive templates and intuitive editor allow shorten the expenses of time and facilities for the letter structure development. Another significant advantage: eSputnik can be integrated with API."}, {"question": "What do you dislike about eSputnik?", "answer": "Everything has met our expectations. But honestly, some features were hidden in the depths of the interface and I spent some time on searching them all. Anyways, it wasn't a huge issue."}, {"question": "Recommendations to others considering eSputnik:", "answer": "eSputnik is an amazing tool for email deployment and automated workflows. It is a cost-effective email solution for small to medium sized companies."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "We significantly improved the communication process with our customers via email. Using all benefits of email list segmentation technique we have made good progress in increasing three times the open rate of newsletters."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Liubov Z.", "reviewer_job_title": "Creative writer", "reviewer_link": "https://www.g2.com/users/7354a064-3d26-43d0-b2f0-11eaa6650a3c"}, "publish_date": "2020-01-27T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4074578"}, {"review_id": 4092681, "review_title": "The most user-friendly e-mail sending platform I've ever used", "review_content": "What do you like best about eSputnik?\neSputnik meets all my marketing needs when it comes to emails and push notifications. I like the full reporting system of sent email campaigns and analysis of users' activity. The email construction too is very user-friendly as well as the management user cabinet. It makes no difficulties to create the email, upload the users' contacts and manually send the email campaign. As far as I know from our development team there are no issues with connecting to eSputnik's API and set the data transmission from our database to eSputnik.\n\nWhat do you dislike about eSputnik?\nThere is no notification system about the new release of some content editor's features (though maybe I miss many of them).\n\nWhat problems is eSputnik solving and how is that benefiting you?\neSputnik Support team is always on the touch and helps to solve all issues and difficulties I've turned to them with.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "eSputnik meets all my marketing needs when it comes to emails and push notifications. I like the full reporting system of sent email campaigns and analysis of users' activity. The email construction too is very user-friendly as well as the management user cabinet. It makes no difficulties to create the email, upload the users' contacts and manually send the email campaign. As far as I know from our development team there are no issues with connecting to eSputnik's API and set the data transmission from our database to eSputnik."}, {"question": "What do you dislike about eSputnik?", "answer": "There is no notification system about the new release of some content editor's features (though maybe I miss many of them)."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "eSputnik Support team is always on the touch and helps to solve all issues and difficulties I've turned to them with."}], "review_rating": 4.5, "reviewer": {"reviewer_name": "Zoe P.", "reviewer_job_title": "Email Marketing Specialist", "reviewer_link": "https://www.g2.com/users/b5135d86-e844-4b5a-a83e-7c8543d48715"}, "publish_date": "2020-01-30T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4092681"}, {"review_id": 3987658, "review_title": "eSputnik for Omnichannel Marketing", "review_content": "What do you like best about eSputnik?\nI like eSputnik because it is a multi-purpose tool for emailing and internet marketing able to engage your clients not only via Email but through SMS, Viber, Web Push and In-App messengers. Thanks to its reasonable pricing plans eSputnik remains an accessible and intuitive tool for beginners and small businesses in need of web promotion.\n\nWhat do you dislike about eSputnik?\nI faced some responsive bugs using email editor. This entailed the loss of time, but I guess it was a temporary problem.\n\nRecommendations to others considering eSputnik:\nOnce you sign up you have 2500 free emails and you can order one free email template for your website that will be made by eSputnik designers. A really great option!\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWe launched a lot of effective SMS and Viber campaigns to engage the new audience and thereby we succeed to boost our conversion rate in two months.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "I like eSputnik because it is a multi-purpose tool for emailing and internet marketing able to engage your clients not only via Email but through SMS, Viber, Web Push and In-App messengers. Thanks to its reasonable pricing plans eSputnik remains an accessible and intuitive tool for beginners and small businesses in need of web promotion."}, {"question": "What do you dislike about eSputnik?", "answer": "I faced some responsive bugs using email editor. This entailed the loss of time, but I guess it was a temporary problem."}, {"question": "Recommendations to others considering eSputnik:", "answer": "Once you sign up you have 2500 free emails and you can order one free email template for your website that will be made by eSputnik designers. A really great option!"}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "We launched a lot of effective SMS and Viber campaigns to engage the new audience and thereby we succeed to boost our conversion rate in two months."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Denis P.", "reviewer_job_title": "Head Of Marketing", "reviewer_link": "https://www.g2.com/users/5d14030b-e612-46e4-8e17-43c3930cb3f0"}, "publish_date": "2020-01-08T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-3987658"}, {"review_id": 3347210, "review_title": "eSputnik is great service for emailing", "review_content": "What do you like best about eSputnik?\nThis tool is very easy to use with an intuitive interface.  it is possible to make up a letter right at the time of its creation and add dynamic content.  the entire database of contacts is stored in the contacts section and it is possible to create groups and subgroups.  there is also a scripting feature that simplifies the work with recipients\n\nWhat do you dislike about eSputnik?\nthere are restrictions on the size of the content, but it's understandable why\n\nRecommendations to others considering eSputnik:\nLet's try, and your like it\n\nWhat problems is eSputnik solving and how is that benefiting you?\nI use eSputnik for typesetting letters and for sending and attracting an audience to various events.  All created templates can be stored in separate folders, the letter is automatically modified to a mobile look.  And it also has an editor for AMP letters.  I highly recommend your letters will be bright, dynamic and attractive to recipients.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "This tool is very easy to use with an intuitive interface.  it is possible to make up a letter right at the time of its creation and add dynamic content.  the entire database of contacts is stored in the contacts section and it is possible to create groups and subgroups.  there is also a scripting feature that simplifies the work with recipients"}, {"question": "What do you dislike about eSputnik?", "answer": "there are restrictions on the size of the content, but it's understandable why"}, {"question": "Recommendations to others considering eSputnik:", "answer": "Let's try, and your like it"}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "I use eSputnik for typesetting letters and for sending and attracting an audience to various events.  All created templates can be stored in separate folders, the letter is automatically modified to a mobile look.  And it also has an editor for AMP letters.  I highly recommend your letters will be bright, dynamic and attractive to recipients."}], "review_rating": 4.5, "reviewer": {"reviewer_name": "Olesya M.", "reviewer_job_title": "City Chapter Director", "reviewer_link": "https://www.g2.com/users/f5cfc5cb-adb3-4418-a32c-fbedc900f209"}, "publish_date": "2019-10-03T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-3347210"}, {"review_id": 3806122, "review_title": "Great personalization tools and usability ", "review_content": "What do you like best about eSputnik?\nA really flexible and easy-to-use drag & drop editor with all necessary features. Various useful responsive templates helping to develop the correct structure and amazing design of the letter.\n\nWhat do you dislike about eSputnik?\nContact export is available only in CSV format, but it don't cause serious problem.\n\nRecommendations to others considering eSputnik:\neSputnik is a perfect solution for both small businesses and large companies that need to launch a promotional email campaign.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nOver the past year our team have increased the efficiency of all email campaigns using eSputnik tools and we saved a lot of time during the marketing strategy development.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "A really flexible and easy-to-use drag & drop editor with all necessary features. Various useful responsive templates helping to develop the correct structure and amazing design of the letter."}, {"question": "What do you dislike about eSputnik?", "answer": "Contact export is available only in CSV format, but it don't cause serious problem."}, {"question": "Recommendations to others considering eSputnik:", "answer": "eSputnik is a perfect solution for both small businesses and large companies that need to launch a promotional email campaign."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "Over the past year our team have increased the efficiency of all email campaigns using eSputnik tools and we saved a lot of time during the marketing strategy development."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Helga Z.", "reviewer_job_title": "Chief Marketing Officer", "reviewer_link": "https://www.g2.com/users/bb40d03e-43e7-4673-8f5f-216a010994a1"}, "publish_date": "2019-12-05T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-3806122"}, {"review_id": 3931710, "review_title": "eSputnik is an excellent result oriented software", "review_content": "What do you like best about eSputnik?\n1) Great email deliverability\n2) Advanced segmentation tool helping to create complex segments based on any criterion\n3) Minimalist drag & drop editor with useful blocks and parameters\n4) Cheap SMS and Viber campaigns\n\nWhat do you dislike about eSputnik?\nLimited list of message templates. Hope their numbers will grow.\n\nRecommendations to others considering eSputnik:\nTry eSputnik free plan at first. It is the best way to see all advantages of this software.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nUsing eSputnik services we succeed to create effective personalised emails and improve click-through rate of all launched campaigns", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "1) Great email deliverability\n2) Advanced segmentation tool helping to create complex segments based on any criterion\n3) Minimalist drag & drop editor with useful blocks and parameters\n4) Cheap SMS and Viber campaigns"}, {"question": "What do you dislike about eSputnik?", "answer": "Limited list of message templates. Hope their numbers will grow."}, {"question": "Recommendations to others considering eSputnik:", "answer": "Try eSputnik free plan at first. It is the best way to see all advantages of this software."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "Using eSputnik services we succeed to create effective personalised emails and improve click-through rate of all launched campaigns"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Nick B.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/60cdf848-0a0a-42eb-a971-8ede4196d287"}, "publish_date": "2019-12-27T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-3931710"}, {"review_id": 1755765, "review_title": "Great analytic tools ", "review_content": "What do you like best about eSputnik?\nPush-notifications, email campaigns, analytics. I have used live chat multiple times, and each time got a response within 2 min! By far the best bang for your buck!\n\nWhat do you dislike about eSputnik?\nFrom last 6 months I am customer of eSputnik and can not find any dislike yet. The price point is excellent!\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWe have some onboarding campaigns, return clients by abandoned carts emails and inform clients about our new products. They offer really detailed analytics and real-time user activity tracking and monitoring.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "Push-notifications, email campaigns, analytics. I have used live chat multiple times, and each time got a response within 2 min! By far the best bang for your buck!"}, {"question": "What do you dislike about eSputnik?", "answer": "From last 6 months I am customer of eSputnik and can not find any dislike yet. The price point is excellent!"}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "We have some onboarding campaigns, return clients by abandoned carts emails and inform clients about our new products. They offer really detailed analytics and real-time user activity tracking and monitoring."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Kate K.", "reviewer_job_title": "Global Partnership Manager", "reviewer_link": "https://www.g2.com/users/38a177fe-7c32-4db6-82c0-33dc3e08348b"}, "publish_date": "2020-01-16T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-1755765"}, {"review_id": 4086462, "review_title": "Great solutiom", "review_content": "What do you like best about eSputnik?\nExcellent integration, timely support and automation at a super level. The ability to build personalized trigger chains.\n\nWhat do you dislike about eSputnik?\nI have been using the service for a long time and I have no special comments\n\nWhat problems is eSputnik solving and how is that benefiting you?\nAutomation. Integration with the services I need. Personalization and AMP", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "Excellent integration, timely support and automation at a super level. The ability to build personalized trigger chains."}, {"question": "What do you dislike about eSputnik?", "answer": "I have been using the service for a long time and I have no special comments"}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "Automation. Integration with the services I need. Personalization and AMP"}], "review_rating": 4.5, "reviewer": {"reviewer_name": "Valeriia K.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/c7a3567d-67e1-4eb3-8b6c-f9f2e0b6890b"}, "publish_date": "2020-01-29T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-4086462"}, {"review_id": 2874092, "review_title": "Awesome tool for marketing automation", "review_content": "What do you like best about eSputnik?\nDetailed reports, a great set of features for email marketer, helpful and fast support, simple interface.\n\nWhat do you dislike about eSputnik?\nAbsolutely nothing, my only suggestion would be perhaps a more how-to videos to help people who are beginners in email marketing.\n\nRecommendations to others considering eSputnik:\nIt's a great solution - simple interface with powerful features.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWith eSputnik we can reach a larger audience. I also like that I am able to customize so many different things on the email. eSputnik reports are very detailed, so now we can better segment our contact list.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "Detailed reports, a great set of features for email marketer, helpful and fast support, simple interface."}, {"question": "What do you dislike about eSputnik?", "answer": "Absolutely nothing, my only suggestion would be perhaps a more how-to videos to help people who are beginners in email marketing."}, {"question": "Recommendations to others considering eSputnik:", "answer": "It's a great solution - simple interface with powerful features."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "With eSputnik we can reach a larger audience. I also like that I am able to customize so many different things on the email. eSputnik reports are very detailed, so now we can better segment our contact list."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Alina M.", "reviewer_job_title": "Head of Marketing", "reviewer_link": "https://www.g2.com/users/87f2bec4-c462-4b25-8073-cce6eb483398"}, "publish_date": "2019-07-30T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-2874092"}, {"review_id": 2324737, "review_title": "Flexible email & push service", "review_content": "What do you like best about eSputnik?\n1) email-builder - it's easy to create different templates with interactive elements. even people without html & css knowledge can do this.\n2) local customization - we use eSputnik for different markets with different languages and it was always easy to implement.\n3) support team - fast and helpful!\n\nWhat do you dislike about eSputnik?\nsometimes the service works slow in chrome and can close the tab while editing the template.\n\nRecommendations to others considering eSputnik:\nPush customization is available for additional price. Viber and sms messages are more expensive than on other services\n\nWhat problems is eSputnik solving and how is that benefiting you?\n- interactive elements in emails that help to keep users involved\n- detailed email statistics\n- possibility to create target contact groups based on their activity", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "1) email-builder - it's easy to create different templates with interactive elements. even people without html & css knowledge can do this.\n2) local customization - we use eSputnik for different markets with different languages and it was always easy to implement.\n3) support team - fast and helpful!"}, {"question": "What do you dislike about eSputnik?", "answer": "sometimes the service works slow in chrome and can close the tab while editing the template."}, {"question": "Recommendations to others considering eSputnik:", "answer": "Push customization is available for additional price. Viber and sms messages are more expensive than on other services"}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "- interactive elements in emails that help to keep users involved\n- detailed email statistics\n- possibility to create target contact groups based on their activity"}], "review_rating": 4.0, "reviewer": {"reviewer_name": "Sophia D.", "reviewer_job_title": "Sofiia Dmytrenko", "reviewer_link": "https://www.g2.com/users/484cfdb2-9098-4b42-b391-5b27b61830a8"}, "publish_date": "2019-05-22T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-2324737"}, {"review_id": 1773105, "review_title": "Automation for eCommerce", "review_content": "What do you like best about eSputnik?\nOne of the best features of eSputnik is adaptive email editor, we make here our HTMlized emails and they are amazing. Also for us are important opportunities of deep contact base segmentation and web tracking of customer behaviour.\n\nWhat do you dislike about eSputnik?\nSometimes we have issues with new features implementing, but eSputnik has the best support team ever, so we settle all problems really quickly\n\nRecommendations to others considering eSputnik:\nIf you have not started using this service, you can do it without fear. You can find here everything you need if we talk about e-commerce business: automation and deep integration opportunities, up-to-date statistics and web-tracking tools\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWe realized that only sending emails is not enough for efficient communication with our customers and subscribers. That's why we start using omnichannel approach. It is especially important for triggered sequences, for example, Abandoned carts. For us it means that we can reach our subscribers in the most convenient for them way. We just add to our email campaigns web push and text messages. And in the nearest time, as soon as our mobile app will be launched, we are going to start using mobile push in addition to existing channels.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "One of the best features of eSputnik is adaptive email editor, we make here our HTMlized emails and they are amazing. Also for us are important opportunities of deep contact base segmentation and web tracking of customer behaviour."}, {"question": "What do you dislike about eSputnik?", "answer": "Sometimes we have issues with new features implementing, but eSputnik has the best support team ever, so we settle all problems really quickly"}, {"question": "Recommendations to others considering eSputnik:", "answer": "If you have not started using this service, you can do it without fear. You can find here everything you need if we talk about e-commerce business: automation and deep integration opportunities, up-to-date statistics and web-tracking tools"}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "We realized that only sending emails is not enough for efficient communication with our customers and subscribers. That's why we start using omnichannel approach. It is especially important for triggered sequences, for example, Abandoned carts. For us it means that we can reach our subscribers in the most convenient for them way. We just add to our email campaigns web push and text messages. And in the nearest time, as soon as our mobile app will be launched, we are going to start using mobile push in addition to existing channels."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Kostiantyn C.", "reviewer_job_title": "Mr", "reviewer_link": "https://www.g2.com/users/90e25c05-3c0d-4915-81df-6e8df84a98b9"}, "publish_date": "2019-02-15T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-1773105"}, {"review_id": 2161379, "review_title": "Great email marketing platform", "review_content": "What do you like best about eSputnik?\nThe platform offers a lot of great features including advanced segmentation and mobile push notifications. The drag and drop editor is one of the best in all the competitive products. It is a good choice for advanced marketers looking to optimize the cost of communication with clients.\n\nWhat do you dislike about eSputnik?\nSome functions are not properly explained, but we quickly resolved that problem in a customer support chat. They are always very helpful.\n\nRecommendations to others considering eSputnik:\nIt is one of the most feature-reach marketing automation services in the market.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nBy analyzing behavioral factors and using the obtained data, we are able to properly segment our customer database and come up with different interaction strategies for each segment.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "The platform offers a lot of great features including advanced segmentation and mobile push notifications. The drag and drop editor is one of the best in all the competitive products. It is a good choice for advanced marketers looking to optimize the cost of communication with clients."}, {"question": "What do you dislike about eSputnik?", "answer": "Some functions are not properly explained, but we quickly resolved that problem in a customer support chat. They are always very helpful."}, {"question": "Recommendations to others considering eSputnik:", "answer": "It is one of the most feature-reach marketing automation services in the market."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "By analyzing behavioral factors and using the obtained data, we are able to properly segment our customer database and come up with different interaction strategies for each segment."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Elena D.", "reviewer_job_title": "Marketing and Partners Manager", "reviewer_link": "https://www.g2.com/users/22ea35a2-bc6d-4508-a8b7-22a1055dff50"}, "publish_date": "2019-04-26T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-2161379"}, {"review_id": 2451595, "review_title": "Robust and user-friendly platform", "review_content": "What do you like best about eSputnik?\neSputnik offers the variety of options for sorting contacts, setting up rules and triggers, and performing bulk operations is exceptional. The system is super powerful with many advanced features like cohort analysis, RFM-analysis, dynamics of contact database activity.  Reporting is done well too.\n\nWhat do you dislike about eSputnik?\nWe have been using eSputnik for years and have no complaints. A great service at a great price.\n\nRecommendations to others considering eSputnik:\nHighly recommended!\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWe are using eSputnik for email marketing, sms campaigns and push-notifications. It helps us to create a better visualized and personalized marketing funnel.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "eSputnik offers the variety of options for sorting contacts, setting up rules and triggers, and performing bulk operations is exceptional. The system is super powerful with many advanced features like cohort analysis, RFM-analysis, dynamics of contact database activity.  Reporting is done well too."}, {"question": "What do you dislike about eSputnik?", "answer": "We have been using eSputnik for years and have no complaints. A great service at a great price."}, {"question": "Recommendations to others considering eSputnik:", "answer": "Highly recommended!"}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "We are using eSputnik for email marketing, sms campaigns and push-notifications. It helps us to create a better visualized and personalized marketing funnel."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Margaret L.", "reviewer_job_title": "Chief Marketing Officer", "reviewer_link": "https://www.g2.com/users/45153971-db5d-4159-b876-d10c7d5f5c29"}, "publish_date": "2019-06-07T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-2451595"}, {"review_id": 2973455, "review_title": "Full featured email marketing service", "review_content": "What do you like best about eSputnik?\nI like in the first place that eSputnik gives us complete control over all aspects of our email marketing campaigns. It provides innovative features such as AMP for emails. Their support works really good, if face any trouble, I can receive an answer almost immediately.\n\nWhat do you dislike about eSputnik?\nThey offer not a lot ready-made templates, but I can not say it is a disadvantage in case they will create your own template for free :)\n\nRecommendations to others considering eSputnik:\nI enjoy using eSputnik, it offers a lot of features and always up to date. Can recommend to all marketers and SMEs.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWe are able to automate our email marketing, send follow-up series to our clients. It helps in generating new leads and icreasing sales.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "I like in the first place that eSputnik gives us complete control over all aspects of our email marketing campaigns. It provides innovative features such as AMP for emails. Their support works really good, if face any trouble, I can receive an answer almost immediately."}, {"question": "What do you dislike about eSputnik?", "answer": "They offer not a lot ready-made templates, but I can not say it is a disadvantage in case they will create your own template for free :)"}, {"question": "Recommendations to others considering eSputnik:", "answer": "I enjoy using eSputnik, it offers a lot of features and always up to date. Can recommend to all marketers and SMEs."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "We are able to automate our email marketing, send follow-up series to our clients. It helps in generating new leads and icreasing sales."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2019-08-13T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-2973455"}, {"review_id": 2042990, "review_title": "Cost-effective push notifications", "review_content": "What do you like best about eSputnik?\nI use eSputnik push notifications for 2 months and really satisfied with the results. I can segment my audience by their location, gender, age, purchase history, and other parameters. The channel is practically free and already generated new leads.\n\nWhat do you dislike about eSputnik?\nI am new in push notifications channel, so I would like to have more tutorials. Apart from that it is an awesome tool all in all.\n\nRecommendations to others considering eSputnik:\nIt is great and useful software that assist in building your clients and business. I didn't have time to try all features but already can say that it is cost-effective.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nAutomated web push notifications", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "I use eSputnik push notifications for 2 months and really satisfied with the results. I can segment my audience by their location, gender, age, purchase history, and other parameters. The channel is practically free and already generated new leads."}, {"question": "What do you dislike about eSputnik?", "answer": "I am new in push notifications channel, so I would like to have more tutorials. Apart from that it is an awesome tool all in all."}, {"question": "Recommendations to others considering eSputnik:", "answer": "It is great and useful software that assist in building your clients and business. I didn't have time to try all features but already can say that it is cost-effective."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "Automated web push notifications"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Olga H.", "reviewer_job_title": "CEO & Co-founder", "reviewer_link": "https://www.g2.com/users/41c1adab-2d1c-4093-bc80-f644748fe7f8"}, "publish_date": "2019-04-03T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-2042990"}, {"review_id": 2065027, "review_title": "Advanced tool", "review_content": "What do you like best about eSputnik?\nThey provide a lot of advanced features such as advanced segmentation, which allows creating microsegments and send more personalized messages. Moreover, their customer service is always very friendly and very courteous.\n\nWhat do you dislike about eSputnik?\nThe only thing that I can say is that whenever we had a problem it was very quickly solved by the customer support team.\n\nRecommendations to others considering eSputnik:\nPerfect solution if you are looking for a feature-rich marketing automation tool. Their blog and articles in the support section are very helpful.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nMultichannel marketing", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "They provide a lot of advanced features such as advanced segmentation, which allows creating microsegments and send more personalized messages. Moreover, their customer service is always very friendly and very courteous."}, {"question": "What do you dislike about eSputnik?", "answer": "The only thing that I can say is that whenever we had a problem it was very quickly solved by the customer support team."}, {"question": "Recommendations to others considering eSputnik:", "answer": "Perfect solution if you are looking for a feature-rich marketing automation tool. Their blog and articles in the support section are very helpful."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "Multichannel marketing"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Kateryna K.", "reviewer_job_title": "Head of Marketing", "reviewer_link": "https://www.g2.com/users/c57822f2-a87b-408a-8984-8c1fb981a899"}, "publish_date": "2019-04-08T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-2065027"}, {"review_id": 2883750, "review_title": "Powerful Email Automation", "review_content": "What do you like best about eSputnik?\n\"Powerful functional\n\nFast support\n\nGreat blog - a lot of useful information, both for beginners and experienced marketers.\n\nService is constantly evolving and implementing new features. \"\n\nWhat do you dislike about eSputnik?\n\"Didn't find yet.\n\nI use eSputnik for more than a year and I am very satisfied. A flexible, powerful tool for newsletters.\"\n\nRecommendations to others considering eSputnik:\nHighly recommended both for beginners and experienced marketers.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nI use eSputnik to build email marketing campaigns. Now I can automate all the emails and effectively track their openings, which has helped us a lot to improve our marketing strategies. Thinking about start using web-push notifications.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "\"Powerful functional\n\nFast support\n\nGreat blog - a lot of useful information, both for beginners and experienced marketers.\n\nService is constantly evolving and implementing new features. \""}, {"question": "What do you dislike about eSputnik?", "answer": "\"Didn't find yet.\n\nI use eSputnik for more than a year and I am very satisfied. A flexible, powerful tool for newsletters.\""}, {"question": "Recommendations to others considering eSputnik:", "answer": "Highly recommended both for beginners and experienced marketers."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "I use eSputnik to build email marketing campaigns. Now I can automate all the emails and effectively track their openings, which has helped us a lot to improve our marketing strategies. Thinking about start using web-push notifications."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2019-07-31T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-2883750"}, {"review_id": 1295312, "review_title": "eSputnik for SaaS", "review_content": "What do you like best about eSputnik?\nI like the product card generator, using which I can configure automatic uploading of photos and descriptions of each SKU from site to e-mail template.\n\nI also like the fact that the service has a set of images for e-mail, which is provided free of charge.\n\nI also like the price, which is lower than the market average.\n\nI like the fact that I can use Google Authenticator to access the site. This is important to me because I travel a lot and use public Wi-Fi.\n\nWhat do you dislike about eSputnik?\nMost of all I do not like the user interface. It's my personal opinion. I find it difficult to use the site because I do not understand the structure of the site.\n\nI use pictures GIFs in my mailings. I do not like the fact that in the free stock there are only illustrations and no GIFs.\n\nNow on the site a single interface for all types of mailings. I use the service for mailing in Viber and I want a separate simple interface for this.\n\nRecommendations to others considering eSputnik:\nI do not like the interface in this SaaS. If you have a small budget for e-mail marketing, this service is suitable. But keep in mind that you have to spend a lot of time to understand the interface.\n\nI use this service for Viber mailings.\nFor e-mail newsletters, I use another tool.\n\nI can recommend this tool for Viber mailings.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nI use the service to send mailings on Viber. I like the fact that I can send a newsletter not only by e-mail, but also via Viber. I know which of my clients have Viber installed. I save money when using Viber instead of SMS.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "I like the product card generator, using which I can configure automatic uploading of photos and descriptions of each SKU from site to e-mail template.\n\nI also like the fact that the service has a set of images for e-mail, which is provided free of charge.\n\nI also like the price, which is lower than the market average.\n\nI like the fact that I can use Google Authenticator to access the site. This is important to me because I travel a lot and use public Wi-Fi."}, {"question": "What do you dislike about eSputnik?", "answer": "Most of all I do not like the user interface. It's my personal opinion. I find it difficult to use the site because I do not understand the structure of the site.\n\nI use pictures GIFs in my mailings. I do not like the fact that in the free stock there are only illustrations and no GIFs.\n\nNow on the site a single interface for all types of mailings. I use the service for mailing in Viber and I want a separate simple interface for this."}, {"question": "Recommendations to others considering eSputnik:", "answer": "I do not like the interface in this SaaS. If you have a small budget for e-mail marketing, this service is suitable. But keep in mind that you have to spend a lot of time to understand the interface.\n\nI use this service for Viber mailings.\nFor e-mail newsletters, I use another tool.\n\nI can recommend this tool for Viber mailings."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "I use the service to send mailings on Viber. I like the fact that I can send a newsletter not only by e-mail, but also via Viber. I know which of my clients have Viber installed. I save money when using Viber instead of SMS."}], "review_rating": 2.5, "reviewer": {"reviewer_name": "Dmitriy U.", "reviewer_job_title": "Project Manager at MegaIndex", "reviewer_link": "https://www.g2.com/users/e3155cf4-9c3d-44e2-8281-0875e7b94da4"}, "publish_date": "2018-12-05T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-1295312"}, {"review_id": 2034664, "review_title": "Good experience", "review_content": "What do you like best about eSputnik?\n\"Easy to setup, newbie friendly, easy-to-use, awesome support. I use eSputnik for my personal and business use and really satisfied with the system. But the very best thing about eSputnik is their instant customer service. I will run into something that I can't figure out how to do, I pop open the chat window, and have my answer in a couple of minutes. They are always there, always friendly and helpful.\n\nWhat do you dislike about eSputnik?\neSputnik has been the best marketing platform i have ever used. Customer service is very helpful.\n\nRecommendations to others considering eSputnik:\nAs i said before eSputnik is the perfect choice for marketers. If you are looking to get a good email marketing service that is easy to use and cost effective, eSputnik is the best choice.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nAutomation email and sms campaigns", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "\"Easy to setup, newbie friendly, easy-to-use, awesome support. I use eSputnik for my personal and business use and really satisfied with the system. But the very best thing about eSputnik is their instant customer service. I will run into something that I can't figure out how to do, I pop open the chat window, and have my answer in a couple of minutes. They are always there, always friendly and helpful."}, {"question": "What do you dislike about eSputnik?", "answer": "eSputnik has been the best marketing platform i have ever used. Customer service is very helpful."}, {"question": "Recommendations to others considering eSputnik:", "answer": "As i said before eSputnik is the perfect choice for marketers. If you are looking to get a good email marketing service that is easy to use and cost effective, eSputnik is the best choice."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "Automation email and sms campaigns"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2019-04-03T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-2034664"}, {"review_id": 1406778, "review_title": "Review of eSputnik", "review_content": "What do you like best about eSputnik?\n1. High deliverability;\n2. Dynamic contact groups -- the system includes or excludes the contacts that no longer meet certain criteria;\n3. Complex segmentation -- to this feature, they track customers' behavior both online and offline;\n4. Click map -- it shows the elements of email that customers like most;\n5. Scenarios -- this is probably my favorite feature eSputnik provides;\n6. Omnichannel ESP -- emails, SMS, Web and Mobile Push notifications, Viber.\n\nWhat do you dislike about eSputnik?\nNothing that I can think of at the moment.\nI've been using this ESP for more than a year and, fortunately, have not faced any issues\n\nRecommendations to others considering eSputnik:\nBest tool with up-to-date features to catch up with the times.\nCustomer service provides qualified assistance.\nLove their blog\n\nWhat problems is eSputnik solving and how is that benefiting you?\nScenarios:\nWelcome emails, order confirmation, abandoned carts, post-purchase emails, event reminders -- they work perfectly well.\n\nHyperpersonalization -- recipients receive only relevant information.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "1. High deliverability;\n2. Dynamic contact groups -- the system includes or excludes the contacts that no longer meet certain criteria;\n3. Complex segmentation -- to this feature, they track customers' behavior both online and offline;\n4. Click map -- it shows the elements of email that customers like most;\n5. Scenarios -- this is probably my favorite feature eSputnik provides;\n6. Omnichannel ESP -- emails, SMS, Web and Mobile Push notifications, Viber."}, {"question": "What do you dislike about eSputnik?", "answer": "Nothing that I can think of at the moment.\nI've been using this ESP for more than a year and, fortunately, have not faced any issues"}, {"question": "Recommendations to others considering eSputnik:", "answer": "Best tool with up-to-date features to catch up with the times.\nCustomer service provides qualified assistance.\nLove their blog"}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "Scenarios:\nWelcome emails, order confirmation, abandoned carts, post-purchase emails, event reminders -- they work perfectly well.\n\nHyperpersonalization -- recipients receive only relevant information.\n"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2018-12-19T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-1406778"}, {"review_id": 1437147, "review_title": "Great All-in-One email marketing platform", "review_content": "What do you like best about eSputnik?\nI like that eSputnik is user-friendly and has very detailed analytics. Build-in RFM data analysis helped me to effectively segment my customers list. The customer service is reliable and fast, they are very helpful regarding the technology and business point of view.\n\nWhat do you dislike about eSputnik?\neSputnik's free template gallery is full of good structured email templates and company's blog full of creative email examples. However, I would like to have more templates in HTML version.\n\nWhat problems is eSputnik solving and how is that benefiting you?\neSputnik provides complex marketing automation solution with great analytic tools. Comparing to other products on the market, eSputnik seems to be all-in-one email marketing platform for eCommerce business.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "I like that eSputnik is user-friendly and has very detailed analytics. Build-in RFM data analysis helped me to effectively segment my customers list. The customer service is reliable and fast, they are very helpful regarding the technology and business point of view."}, {"question": "What do you dislike about eSputnik?", "answer": "eSputnik's free template gallery is full of good structured email templates and company's blog full of creative email examples. However, I would like to have more templates in HTML version."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "eSputnik provides complex marketing automation solution with great analytic tools. Comparing to other products on the market, eSputnik seems to be all-in-one email marketing platform for eCommerce business."}], "review_rating": 4.5, "reviewer": {"reviewer_name": "Alena K.", "reviewer_job_title": "Content Marketing Specialist", "reviewer_link": "https://www.g2.com/users/11610fb1-bffe-41ad-9f8a-2048bdf4faa2"}, "publish_date": "2018-12-24T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-1437147"}, {"review_id": 2200267, "review_title": "Excellent software", "review_content": "What do you like best about eSputnik?\nI like that eSputnik offers innovative options such as advanced segmentation to analyze marketing strategies to ensure better results and achieve the reach of our goals. Email deliverability has been quite great as far as I can tell.\n\nWhat do you dislike about eSputnik?\nThe user interface is not to my liking but the functionality of this tool and very helpful support make up for it.\n\nRecommendations to others considering eSputnik:\nThis tool was just what we were looking for since it automates work efficiently and saves us a lot of time.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nThe platform is for experienced email marketers. Maybe not the easiest interface but very powerful and reliable, meets a wide array of needs.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "I like that eSputnik offers innovative options such as advanced segmentation to analyze marketing strategies to ensure better results and achieve the reach of our goals. Email deliverability has been quite great as far as I can tell."}, {"question": "What do you dislike about eSputnik?", "answer": "The user interface is not to my liking but the functionality of this tool and very helpful support make up for it."}, {"question": "Recommendations to others considering eSputnik:", "answer": "This tool was just what we were looking for since it automates work efficiently and saves us a lot of time."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "The platform is for experienced email marketers. Maybe not the easiest interface but very powerful and reliable, meets a wide array of needs."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2019-05-03T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-2200267"}, {"review_id": 1721731, "review_title": "Powerful product for the reasonable price", "review_content": "What do you like best about eSputnik?\nI like that eSputnik is user-friendly and has very detailed analytics. Building RFM data analysis helped us to effectively segment our customers' list and boost sales. Also, they gave us contact support during the all marketing campaign.\n\nWhat do you dislike about eSputnik?\nNot much to dislike here. We haven't faced any troubles during all time using.\n\nRecommendations to others considering eSputnik:\neSputnik has very detailed analytics. I like that now we can reach out to our customers not only by Email but also other channels such as Viber, Web Push Notifications and visualize our sales funnel. Now thinking about adding advanced segmentation.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nAutomation email campaigns, creating multichannel scenarios, visualizing sales funnel.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "I like that eSputnik is user-friendly and has very detailed analytics. Building RFM data analysis helped us to effectively segment our customers' list and boost sales. Also, they gave us contact support during the all marketing campaign."}, {"question": "What do you dislike about eSputnik?", "answer": "Not much to dislike here. We haven't faced any troubles during all time using."}, {"question": "Recommendations to others considering eSputnik:", "answer": "eSputnik has very detailed analytics. I like that now we can reach out to our customers not only by Email but also other channels such as Viber, Web Push Notifications and visualize our sales funnel. Now thinking about adding advanced segmentation."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "Automation email campaigns, creating multichannel scenarios, visualizing sales funnel."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Valerie T.", "reviewer_job_title": "Linkbuilder, Outreach, and Public Relations Specialist", "reviewer_link": "https://www.g2.com/users/vvalerrie"}, "publish_date": "2019-02-07T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-1721731"}, {"review_id": 1397506, "review_title": "Great deliverability, support and affordable pricing", "review_content": "What do you like best about eSputnik?\nGood solution for companies that want to engage and retain their subscribers and customers. Responsive support is a huge advantage! We mainly use esputnik as a tool for communicating with the subscribers who opted in to our list, so deliverability of the mailings is pretty good. I want to emphasize fast delivery of the letters as well.\n\nWhat do you dislike about eSputnik?\nWe use neither multichannel functionality nor automated scenarios -- it doesn't suit our purposes, so I can't tell a lot about that.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWe save a lot of time and money by using message builder. In case we have any questions, the support people help us quickly. Time saving is the best benefit we receive from eSputnik.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "Good solution for companies that want to engage and retain their subscribers and customers. Responsive support is a huge advantage! We mainly use esputnik as a tool for communicating with the subscribers who opted in to our list, so deliverability of the mailings is pretty good. I want to emphasize fast delivery of the letters as well."}, {"question": "What do you dislike about eSputnik?", "answer": "We use neither multichannel functionality nor automated scenarios -- it doesn't suit our purposes, so I can't tell a lot about that."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "We save a lot of time and money by using message builder. In case we have any questions, the support people help us quickly. Time saving is the best benefit we receive from eSputnik.\n"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Stanislav B.", "reviewer_job_title": "Chief Business Development Officer", "reviewer_link": "https://www.g2.com/users/bce5b85b-a2a4-4c3f-9519-00c6e2c01a1a"}, "publish_date": "2018-12-19T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-1397506"}, {"review_id": 1444146, "review_title": "Excellent Platform!", "review_content": "What do you like best about eSputnik?\nI use this service for email newsletters. I like the contact importing, segmenting contacts is very easy. Their team was incredibly helpful when setting up the tool. Also gave us contact support during the all marketing campaign.\n\nWhat do you dislike about eSputnik?\nNothing to dislike. Comparing to other email marketing tools I can say that eSputnik offers even better functionality for lower prices.\n\nRecommendations to others considering eSputnik:\nUseful marketing automation features for ecommerce projects who need to upgrade current email marketing to powerful marketing automation tool.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nTheir customer service is reliable and fast, they are very helpful regarding the technology and business point of view.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "I use this service for email newsletters. I like the contact importing, segmenting contacts is very easy. Their team was incredibly helpful when setting up the tool. Also gave us contact support during the all marketing campaign."}, {"question": "What do you dislike about eSputnik?", "answer": "Nothing to dislike. Comparing to other email marketing tools I can say that eSputnik offers even better functionality for lower prices."}, {"question": "Recommendations to others considering eSputnik:", "answer": "Useful marketing automation features for ecommerce projects who need to upgrade current email marketing to powerful marketing automation tool."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "Their customer service is reliable and fast, they are very helpful regarding the technology and business point of view."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Oleh Y.", "reviewer_job_title": "Data Scientist", "reviewer_link": "https://www.g2.com/users/3562e890-94e5-4db8-aca9-3b1defa82d44"}, "publish_date": "2018-12-26T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-1444146"}, {"review_id": 1406761, "review_title": "Great Automation", "review_content": "What do you like best about eSputnik?\nBecause of the excellent help articles and online support, I have learned how to create segments based on tagging, and automations. I plan to segment potential clients and customize campaigns based on interest. This will help me serve my blog list by giving them what they need.\n\nWhat do you dislike about eSputnik?\nEverything is perfect as of now. Don't know the future, support is better than excellent.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nI use eSputnik mostly for email marketing on behalf of clients. For me now, it is the main communication source.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "Because of the excellent help articles and online support, I have learned how to create segments based on tagging, and automations. I plan to segment potential clients and customize campaigns based on interest. This will help me serve my blog list by giving them what they need."}, {"question": "What do you dislike about eSputnik?", "answer": "Everything is perfect as of now. Don't know the future, support is better than excellent."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "I use eSputnik mostly for email marketing on behalf of clients. For me now, it is the main communication source."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2018-12-19T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-1406761"}, {"review_id": 1288317, "review_title": "Great marketing automation platform", "review_content": "What do you like best about eSputnik?\nIt is easy to set up different groups for different emails. It also has an intuitive interface and powerful analytics.\n\nWhat do you dislike about eSputnik?\nNothing to dislike. There were no problems and inconveniences for all time of using.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nIf you are using emails to communicate with customers you really can do a much better job with a service like eSputnik. You can create and store templates, get instant reports on opens and clicks, and other data. Customer service is better than excellent.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "It is easy to set up different groups for different emails. It also has an intuitive interface and powerful analytics."}, {"question": "What do you dislike about eSputnik?", "answer": "Nothing to dislike. There were no problems and inconveniences for all time of using."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "If you are using emails to communicate with customers you really can do a much better job with a service like eSputnik. You can create and store templates, get instant reports on opens and clicks, and other data. Customer service is better than excellent."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Marie S.", "reviewer_job_title": "Head Of Communication", "reviewer_link": "https://www.g2.com/users/17c91aac-397a-4ef5-9ce0-0664e19c31bc"}, "publish_date": "2018-12-04T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-1288317"}, {"review_id": 1407377, "review_title": "Great Service", "review_content": "What do you like best about eSputnik?\neSputnik allows us to create very effective email marketing campaigns to increase sales and reach many potential customers. The system has a great variety of templates. As a plus, they offer first template in your own style for free. That's awesome!\n\nWhat do you dislike about eSputnik?\nNothing really. The only thing that I can say we ever had a problem which was eliminated in customer support service.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nI think,  it is a service that every entrepreneurial company should have, since it helps to create advertising campaigns through email marketing", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "eSputnik allows us to create very effective email marketing campaigns to increase sales and reach many potential customers. The system has a great variety of templates. As a plus, they offer first template in your own style for free. That's awesome!"}, {"question": "What do you dislike about eSputnik?", "answer": "Nothing really. The only thing that I can say we ever had a problem which was eliminated in customer support service."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "I think,  it is a service that every entrepreneurial company should have, since it helps to create advertising campaigns through email marketing"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2018-12-19T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-1407377"}, {"review_id": 1407306, "review_title": "Powerful email-automation tool", "review_content": "What do you like best about eSputnik?\nAutomated communication including segmentation and personalization. High-level data reporting for campaigns management.\n\nWhat do you dislike about eSputnik?\nDidn't find yet. Absolutely convenient service\n\nWhat problems is eSputnik solving and how is that benefiting you?\nCampaigns with multichannel scenario generated new leads. I think it's perfect for the SMBs or Enterprises who have plenty of segments to target.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "Automated communication including segmentation and personalization. High-level data reporting for campaigns management."}, {"question": "What do you dislike about eSputnik?", "answer": "Didn't find yet. Absolutely convenient service"}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "Campaigns with multichannel scenario generated new leads. I think it's perfect for the SMBs or Enterprises who have plenty of segments to target."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2018-12-20T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-1407306"}, {"review_id": 1215924, "review_title": "Great soft for marketing automation", "review_content": "What do you like best about eSputnik?\nI like work with segments and i think that dashbords are awesome. One more useful think it's push-notofications. For me one of the most important thing it's support and this guys have great team.\n\nWhat do you dislike about eSputnik?\nThey have a lot of features but FAQ don't include answer about all of that.\n\nRecommendations to others considering eSputnik:\ntry it\n\nWhat problems is eSputnik solving and how is that benefiting you?\nEmail marketing, Push-notification, Viber. We work with small base but do it very effective because all of our massage personolized and consist of right offer for each one.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "I like work with segments and i think that dashbords are awesome. One more useful think it's push-notofications. For me one of the most important thing it's support and this guys have great team."}, {"question": "What do you dislike about eSputnik?", "answer": "They have a lot of features but FAQ don't include answer about all of that."}, {"question": "Recommendations to others considering eSputnik:", "answer": "try it"}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "Email marketing, Push-notification, Viber. We work with small base but do it very effective because all of our massage personolized and consist of right offer for each one."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2018-11-21T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-1215924"}, {"review_id": 723607, "review_title": "At the begining was ok, but... ", "review_content": "What do you like best about eSputnik?\nOnly flexible pricing options. Nothing more.\n\nWhat do you dislike about eSputnik?\nAt the begining was ok, later paid (transfered) for better plan, and \"fun\" has started. Firstly, their consultants started asking about our subscribed contacts, as they did not like something, but we provided all info including screen shots on subscription methods and policies and etc. However at the end of long discussion, they state that they \"doubt\", and did not let us use services anymore. Ok, it is theirs platform and they have the right to state any decisions, but where is refund for no service then? After we asked for refund - no response since. So lets see if they look like shiny silver too? Firstly, all payments are done to Ukrainian bank ( 3rd world country.) and it looks like very suspicious as gives very little trust. Secondly, all support team are under russian names, so it looks like it is Russian company... And who knows what is their direct purpose, for example more doubts arise when you upload you your contacts and you cannot permanently delete them later. So you will never know, where they might use them later, and recent worldwide events shows that similar cases has happened and at one end was Russia. Lastly, you will pay or get a plan, and they can just freeze your account, do not give any logical and acceptable reason, just personal statement and furthermore no refund and you are done. So it looks like that esputnik and their service has much more doubts and questions to answer themselves. And its up to you to trust or not their services. Sadly, but it is a fact, and we think to trust your most valuable assets - contacts, with a risk that you might face the fact when you will pay and will get no service, is not worth. Be careful not to get in the same boat with us when your will get stupid questions from support, and in order to answer you must reveal your confidential data, and at the end your account might be freezed and no option for claim or refund. So for us it looks like it is new way of getting your subscribed contacts and not giving back service that you pay for.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nNo benefits for the reasons mentioned above", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "Only flexible pricing options. Nothing more."}, {"question": "What do you dislike about eSputnik?", "answer": "At the begining was ok, later paid (transfered) for better plan, and \"fun\" has started. Firstly, their consultants started asking about our subscribed contacts, as they did not like something, but we provided all info including screen shots on subscription methods and policies and etc. However at the end of long discussion, they state that they \"doubt\", and did not let us use services anymore. Ok, it is theirs platform and they have the right to state any decisions, but where is refund for no service then? After we asked for refund - no response since. So lets see if they look like shiny silver too? Firstly, all payments are done to Ukrainian bank ( 3rd world country.) and it looks like very suspicious as gives very little trust. Secondly, all support team are under russian names, so it looks like it is Russian company... And who knows what is their direct purpose, for example more doubts arise when you upload you your contacts and you cannot permanently delete them later. So you will never know, where they might use them later, and recent worldwide events shows that similar cases has happened and at one end was Russia. Lastly, you will pay or get a plan, and they can just freeze your account, do not give any logical and acceptable reason, just personal statement and furthermore no refund and you are done. So it looks like that esputnik and their service has much more doubts and questions to answer themselves. And its up to you to trust or not their services. Sadly, but it is a fact, and we think to trust your most valuable assets - contacts, with a risk that you might face the fact when you will pay and will get no service, is not worth. Be careful not to get in the same boat with us when your will get stupid questions from support, and in order to answer you must reveal your confidential data, and at the end your account might be freezed and no option for claim or refund. So for us it looks like it is new way of getting your subscribed contacts and not giving back service that you pay for."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "No benefits for the reasons mentioned above"}], "review_rating": 0.5, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2018-05-29T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-723607"}, {"review_id": 596785, "review_title": "Powerful email marketing tool", "review_content": "What do you like best about eSputnik?\nWe are using eSputnik not so long ago. We decided to start with an email marketing channel. The first email template made in our corporate style was free. On this template basis, new emails have been creating within message editor in a few minutes. For us, this is important because every time creating personalized mailing, creating different messages for each segment may take a time.\n\nWhat do you dislike about eSputnik?\nNothing I can think of. I have nothing to say.\n\nRecommendations to others considering eSputnik:\nIf you have a large number of contacts in email list, then you know how long it takes to create a custom segment. In eSputnik this process takes a few seconds (despite the fact that we have more than 1 million contacts). And if you consider that segments can be created in the report interface (analytics), then a more convenient system is difficult to imagine.\n\nWhat problems is eSputnik solving and how is that benefiting you?\n\nWe tried it for creating segments and running scenarios to activate special offers for our customers. Working with real-time data saves time. The speed of work with the segments has increased at times. Now we can be as flexible as possible.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "We are using eSputnik not so long ago. We decided to start with an email marketing channel. The first email template made in our corporate style was free. On this template basis, new emails have been creating within message editor in a few minutes. For us, this is important because every time creating personalized mailing, creating different messages for each segment may take a time."}, {"question": "What do you dislike about eSputnik?", "answer": "Nothing I can think of. I have nothing to say."}, {"question": "Recommendations to others considering eSputnik:", "answer": "If you have a large number of contacts in email list, then you know how long it takes to create a custom segment. In eSputnik this process takes a few seconds (despite the fact that we have more than 1 million contacts). And if you consider that segments can be created in the report interface (analytics), then a more convenient system is difficult to imagine."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "\nWe tried it for creating segments and running scenarios to activate special offers for our customers. Working with real-time data saves time. The speed of work with the segments has increased at times. Now we can be as flexible as possible."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2018-01-29T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-596785"}, {"review_id": 586354, "review_title": "Great marketing automation solution", "review_content": "What do you like best about eSputnik?\nWhen we decided that we need to do a mass mailing, we began to look for something simple and reliable, in order to send letters few times a month. We have chosen eSputnik. Six months passed, and we had automated all communication channels with the client. So it turned out that the opportunities for email marketing are much greater than we thought. With eSputnik it became obvious)\n\nWhat do you dislike about eSputnik?\nIt would be great if there were more How To videos\n\nRecommendations to others considering eSputnik:\nIt's marketing automation tool that matches all my requirements and has powerful analytic features\n\nWhat problems is eSputnik solving and how is that benefiting you?\nWe have some onboarding campaigns, return clients by abandoned carts emails and inform clients about our new products.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "When we decided that we need to do a mass mailing, we began to look for something simple and reliable, in order to send letters few times a month. We have chosen eSputnik. Six months passed, and we had automated all communication channels with the client. So it turned out that the opportunities for email marketing are much greater than we thought. With eSputnik it became obvious)"}, {"question": "What do you dislike about eSputnik?", "answer": "It would be great if there were more How To videos"}, {"question": "Recommendations to others considering eSputnik:", "answer": "It's marketing automation tool that matches all my requirements and has powerful analytic features"}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "We have some onboarding campaigns, return clients by abandoned carts emails and inform clients about our new products."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2018-01-25T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-586354"}, {"review_id": 517814, "review_title": "Review of eSputnik", "review_content": "What do you like best about eSputnik?\nWe build personalized email campaigns without knowing a very advanced programming languages and analyze it easily. Segments constructor and segment tracking features are extremely easy to use. Creation of the same type of letters for personalized mailings with a large number of segments takes a few minutes.\n\nWhat do you dislike about eSputnik?\nAPI integration was a bit trickier than we expected, but via Zapier we did it and everything goes well.\n\nRecommendations to others considering eSputnik:\nBest complete email marketing management package on the market for SMBs and Enterprises\n\nWhat problems is eSputnik solving and how is that benefiting you?\nThe automation of creating same type of letters with content personalization to different user segments made our work easier. I think it's perfect for the SMBs or Enterprises who have plenty of segments to target.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "We build personalized email campaigns without knowing a very advanced programming languages and analyze it easily. Segments constructor and segment tracking features are extremely easy to use. Creation of the same type of letters for personalized mailings with a large number of segments takes a few minutes."}, {"question": "What do you dislike about eSputnik?", "answer": "API integration was a bit trickier than we expected, but via Zapier we did it and everything goes well."}, {"question": "Recommendations to others considering eSputnik:", "answer": "Best complete email marketing management package on the market for SMBs and Enterprises"}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "The automation of creating same type of letters with content personalization to different user segments made our work easier. I think it's perfect for the SMBs or Enterprises who have plenty of segments to target."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2018-01-19T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-517814"}, {"review_id": 578315, "review_title": "All-in-one email marketing platform", "review_content": "What do you like best about eSputnik?\nEsputnik provides complex marketing automation solution with great analytic tools. Comparing to other products on the market, eSputnik seems to be all-in-one email marketing platform for eCommerce business.\n\nWhat do you dislike about eSputnik?\nAfter sending first mass mailing It took about 1 month to get representative statistic data, But there are data of opens and transitions, so you can build new segments directly from reports and create new campaigns with data.\n\nWhat problems is eSputnik solving and how is that benefiting you?\nBy analyzing the cohort report for 12 months we recalculated our LTV and understood the life cycle of our customers better. Thereby we reconsidered our email strategy and marketing strategy through other channels.", "review_question_answers": [{"question": "What do you like best about eSputnik?", "answer": "Esputnik provides complex marketing automation solution with great analytic tools. Comparing to other products on the market, eSputnik seems to be all-in-one email marketing platform for eCommerce business."}, {"question": "What do you dislike about eSputnik?", "answer": "After sending first mass mailing It took about 1 month to get representative statistic data, But there are data of opens and transitions, so you can build new segments directly from reports and create new campaigns with data."}, {"question": "What problems is eSputnik solving and how is that benefiting you?", "answer": "By analyzing the cohort report for 12 months we recalculated our LTV and understood the life cycle of our customers better. Thereby we reconsidered our email strategy and marketing strategy through other channels."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2018-01-22T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/esputnik/reviews/esputnik-review-578315"}]}, "error": null}