{"data": {"product_id": 94634, "product_name": "Dashly", "product_logo": "https://images.g2crowd.com/uploads/product/image/large_detail/large_detail_6fc9bdae0e8e269f45ec5ed962a7eb0e/dashly.jpg", "g2_link": "https://www.g2.com/products/dashly/reviews", "what_is": "Dashly is a conversational marketing platform. It helps over 700 SaaS and EdTech companies grow conversions and revenue by turning each interaction with clients into a person-to-person conversation. \n\nPut it on another level with call scheduling and video calls. With proactive messaging, a chatbot, and pop-up windows you can generate more leads and qualify them. The leads are collected in eCRM and segmented - that's how you start email marketing. Manage both manual and triggered communication - these are available with live chat messages, pop-up windows and emails.\nFeatures:\n- Capture leads using chatbot made in easy-to-use Chatbot Builder;\n- Store and manage them in eCRM;\n- Track your visitors' actions;\n- Make the best offers using pop-up;\n- Integrate with your favorite services;\n- Have all visitors' messages in one admin panel;\n- Respond your visitors in Live chat for perfect support;\n- Increase conversions with triggered emails;\n- Analyze your performance building funnels.", "product_description": "Dashly is a customer communication platform for your SaaS business. It helps acquire customers with data collecting forms, nurture them with personalized automated messages and manage (segment) the leads to return the hottest ones.", "positioning_against_competitor": null, "reviews": 61, "rating": 4.7, "medal_image": null, "category": {"name": "Conversational Marketing Software", "link": "https://www.g2.com/categories/conversational-marketing"}, "parent_category": null, "company_id": 72149, "seller": "Dashly", "company_phone": null, "company_location": "Wilmington, Delaware", "company_founded_year": 2018, "company_annual_revenue": null, "total_revenue_usd_mm": null, "company_ownership": null, "discussions_link": "https://www.g2.com/products/dashly/discuss", "supported_languages": "English", "services_offered": null, "twitter": "https://twitter.com/dashly", "number_of_followers_on_twitter": 47, "linkedin": "https://www.linkedin.com/company/18558027/", "number_of_employees_on_linkedin": 30, "product_website": null, "company_website": null, "is_claimed": true, "categories": [{"name": "Marketing Automation", "link": "https://www.g2.com/categories/marketing-automation"}, {"name": "Conversational Marketing", "link": "https://www.g2.com/categories/conversational-marketing"}], "screenshots": [], "videos": [], "download_links": [], "pricing_plans": [{"plan_name": "Conversation", "plan_price": "Starting at $39.00\n1 License Per Month", "plan_description": "Perfect for small teams (1-7 agents)  Use this plan to consult your leads and convert them into paying customers.", "plan_features": ["1 active leadbot", "1 active triggered message", "Live chat Team inbox", "Auto-replies during working and non-working hours", "Visitors data tracking"]}, {"plan_name": "Marketing", "plan_price": "Starting at $109.00\n1 License Per Month", "plan_description": "Get more sales with triggered messages, leadbots and various integrations. The best plan for websites with big traffic and multi-channel selling. ", "plan_features": ["3 active leadbots", "10 active triggered messages", "Live chat", "Team Inbox", "Auto-replies during working and non-working hours", "Visitors data tracking", "A/B testing", "Control groups", "Visual email builder", "Manual bulk campaigns", "Funnels"]}, {"plan_name": "Support", "plan_price": "Starting at $79.00\n1 License Per Month", "plan_description": "The best plan for medium-sized teams  ready to scale communications with customers and  start automating processes. ", "plan_features": ["2 active leadbots", "3 active triggered messages", "Live chat", "Team inbox", "Auto-replies during working and non-working hours", "Visitors data tracking", "Team performance reports", "Knowledge base with unlimited articles and SEO settings", "Automated conversation assignment", "Manual bulk campaigns"]}], "alternatives": [{"name": "HubSpot Marketing Hub", "link": "https://www.g2.com/products/hubspot-marketing-hub/reviews", "rating": 4, "reviews": 11004}, {"name": "Intercom", "link": "https://www.g2.com/products/intercom/reviews", "rating": 4, "reviews": 3022}, {"name": "ActiveCampaign", "link": "https://www.g2.com/products/activecampaign/reviews", "rating": 4, "reviews": 13169}], "comparisons": [{"link": "https://www.g2.com/compare/dashly-vs-intercom", "name": "Intercom", "logo": "https://images.g2crowd.com/uploads/product/image/small_square/small_square_53968d81838bbc5ee3db8a629a1751d9/intercom.png"}], "features": [{"name": "Email Marketing", "features": ["Sending Outbound Emails", "Automated Email Responses"]}, {"name": "Lead Management", "features": ["Segmentation", "Lead Scoring and Grading", "Automated Alerts and Tasks"]}, {"name": "Messenger", "features": ["Sequencing", "Live Chat", "Customization Interface"]}, {"name": "Channels", "features": ["Social Media", "Website"]}, {"name": "Customers", "features": ["Targeting", "Profiles", "Analytics", "Lead Gathering", "Sales Conversion"]}], "detailed_features": [{"name": "Integration", "features": [{"name": "Data Import & Export Tools", "content": "As reported in 11 Dashly reviews. Ability to input, modify and extract data from the application in bulk through a structured file.", "percentage": 95, "based_on_number_of_reviews": 11}, {"name": "Integration APIs", "content": "Application Programming Interface - Specification for how the application communicates with other software.  API's typically enable integration of data, logic, objects, etc with other software applications. This feature was mentioned in 15 Dashly reviews.", "percentage": 98, "based_on_number_of_reviews": 15}, {"name": "Breadth of Partner Applications", "content": "To what extent are there partner applications readily available for integrating into this product?  Partner applications typically provide complementary, best of breed functionality not offered natively in this product.", "percentage": null, "based_on_number_of_reviews": null}]}, {"name": "Platform", "features": [{"name": "Customization", "content": "As reported in 17 Dashly reviews. System provides sufficient customization to meet business requirements", "percentage": 88, "based_on_number_of_reviews": 17}, {"name": "Workflow Capability", "content": "Automates a process that requires a series of steps that typically require intervention by a several different users.  Administrators can write rules to determine who and when a user needs to complete a step.  Also includes notification of users when they need to take action. 15 reviewers of Dashly have provided feedback on this feature.", "percentage": 90, "based_on_number_of_reviews": 15}, {"name": "User, Role, and Access Management", "content": "Grant access to select data, features, objects, etc. based on the users, user role, groups, etc. 15 reviewers of Dashly have provided feedback on this feature.", "percentage": 89, "based_on_number_of_reviews": 15}, {"name": "Internationalization", "content": "Enables users to view and transact business with the same content in multiple languages and currencies.", "percentage": null, "based_on_number_of_reviews": null}, {"name": "Sandbox / Test Environments", "content": "Allows administrators to easily develop and test changes to the CRM deployment.  After changes are made admins can easily migrate the changes into the \"live\" or \"production\" environment.", "percentage": null, "based_on_number_of_reviews": null}, {"name": "Performance and Reliability", "content": "Software is consistently available (uptime) and allows users to complete tasks quickly because they are not waiting for the software to respond to an action they took.  This feature was mentioned in 14 Dashly reviews.", "percentage": 88, "based_on_number_of_reviews": 14}, {"name": "Output Document Generation", "content": "Allows adminstrators to create templates that enable users to quickly generate dynamic documents in various formats based on the data stored in the application.", "percentage": null, "based_on_number_of_reviews": null}]}, {"name": "Email Marketing", "features": [{"name": "Building and Personalizing Emails", "content": "Based on 18 Dashly reviews. Create and design emails with an editor; manage templates; personalize dynamically", "percentage": 91, "based_on_number_of_reviews": 18}, {"name": "Sending Outbound Emails", "content": "Create targeted lists, schedule and manage bulk email sending. 19 reviewers of Dashly have provided feedback on this feature.", "percentage": 88, "based_on_number_of_reviews": 19}, {"name": "Manage Email Deliverability", "content": "As reported in 18 Dashly reviews. Ensure inbox delivery. Includes opt-in management, bounce handling, unsubscribe processing, suppression lists, email preview, spam checking, link validation, and delivery monitoring.", "percentage": 87, "based_on_number_of_reviews": 18}, {"name": "Automated Email Responses", "content": "Based on 19 Dashly reviews. Set up automated nurturing emails based on events, online activities, and lead scores", "percentage": 92, "based_on_number_of_reviews": 19}]}, {"name": "Online Marketing", "features": [{"name": "Landing Pages and Forms", "content": "As reported in 11 Dashly reviews. Build customized landing pages and lead capture forms for specific marketing campaigns to maximize conversion and to capture the right qualifying information.", "percentage": 82, "based_on_number_of_reviews": 11}, {"name": "Dynamic Content", "content": "Based on 15 Dashly reviews. Dynamically customize emails, forms, and landing pages for specific segments of customers and prospects.", "percentage": 87, "based_on_number_of_reviews": 15}, {"name": "A/B Testing", "content": "As reported in 14 Dashly reviews. Test alternate versions of emails, landing pages, and forms. Learn what works, maximize response rates, and increase conversion.", "percentage": 93, "based_on_number_of_reviews": 14}, {"name": "Mobile Optimized", "content": "Based on 18 Dashly reviews. Support mobile-optimized emails, online forms, and landing pages.", "percentage": 95, "based_on_number_of_reviews": 18}, {"name": "Search Tracking and Optimization", "content": "Track performance of keywords and links in major search engines.  Measure search rankings and performance.  Improve page-level SEO with tools to diagnose and improve page performance.  Integrate with Google AdWords. This feature was mentioned in 11 Dashly reviews.", "percentage": 94, "based_on_number_of_reviews": 11}]}, {"name": "Lead Management", "features": [{"name": "Marketing Lead Database", "content": "A marketing lead database is the system of record for your most important marketing asset: your leads and contacts. Includes a view of all marketing interactions between each prospect and your company, including website visits, email clicks, scoring changes, and data updates/history. 18 reviewers of Dashly have provided feedback on this feature.", "percentage": 93, "based_on_number_of_reviews": 18}, {"name": "Data Quality Management", "content": "As reported in 16 Dashly reviews. Data quality consists of deduplication, cleansing, and appending your marketing database.", "percentage": 91, "based_on_number_of_reviews": 16}, {"name": "Segmentation", "content": "Based on 19 Dashly reviews. Segment your database and build list of target leads and contacts.  Filter on demographic and company attributes (title, company size, location) as well as behavioral filters and CRM information.", "percentage": 91, "based_on_number_of_reviews": 19}, {"name": "Lead Scoring and Grading", "content": "As reported in 19 Dashly reviews. Automatically qualify and score leads based on demographics as well as prospect online behaviors, including recency and frequency. Assign your own weights to determine lead scores for prioritization.", "percentage": 91, "based_on_number_of_reviews": 19}, {"name": "Lead Nurturing", "content": "Automate drip marketing campaigns that send relevant messages over time, based on prospect behaviors and pre-defined campaign steps. This feature was mentioned in 16 Dashly reviews.", "percentage": 90, "based_on_number_of_reviews": 16}, {"name": "Online Behavior Tracking", "content": "Based on 16 Dashly reviews. Track which emails a prospect opens and clicks, what web-pages they visit, what keywords they use, even what they say on social networks.", "percentage": 91, "based_on_number_of_reviews": 16}, {"name": "Automated Alerts and Tasks", "content": "As reported in 20 Dashly reviews. Create tasks automatically and provide real-time sales alerts over email, RSS or mobile device.", "percentage": 92, "based_on_number_of_reviews": 20}, {"name": "CRM Lead Integration", "content": "Based on 16 Dashly reviews. Sync lead, contact, account, and opportunity information with your CRM system.", "percentage": 92, "based_on_number_of_reviews": 16}]}, {"name": "Campaign Management", "features": [{"name": "Program ManagementView full feature definition", "content": "As reported in 13 Dashly reviews. Manage marketing campaigns and programs across multiple channels, including online ads, video campaigns, mobile, virtual events, and social media. Create and optimize program assets such as landing pages, emails, campaigns, and lists. Track program objectives, results, and costs to assess the program ROI.", "percentage": 96, "based_on_number_of_reviews": 13}, {"name": "Event / Webinar Marketing", "content": "Streamline the entire event process, including personalized invitations, registration, reminders, and post-event follow-up.  Integrate with online meeting tools like WebEx, Adobe Connect, GoToWebinar. This feature was mentioned in 12 Dashly reviews.", "percentage": 89, "based_on_number_of_reviews": 12}, {"name": "Calendaring", "content": "As reported in 11 Dashly reviews. Maintain a marketing calendar across multiple groups. Manage the calendar for the entire marketing department, from promotions to content to PR.", "percentage": 88, "based_on_number_of_reviews": 11}, {"name": "Budgeting", "content": "Manage all aspects of marketing investments, including assigning top-down budgets to various groups and divisions, planning marketing spending across programs, tracking open-to-spend, ensuring budget compliance, coordinating work-flows and permissions, and reconciling plans with actual invoices.", "percentage": null, "based_on_number_of_reviews": null}]}, {"name": "Social", "features": [{"name": "Social Listening", "content": "Monitor what leads and contacts say on sites such as Facebook, Twitter, YouTube, LinkedIn, blogs, and online communities.  Incorporate into your lead and customer DB and use social insights to segment prospects.  Trigger campaigns, and update lead scores. 14 reviewers of Dashly have provided feedback on this feature.", "percentage": 85, "based_on_number_of_reviews": 14}, {"name": "Social Sharing", "content": "Add intelligent social share buttons to your campaigns and content.  Track who is sharing your content and driving conversions. This feature was mentioned in 13 Dashly reviews.", "percentage": 86, "based_on_number_of_reviews": 13}, {"name": "Social Campaigns", "content": "Schedule automated posts to one or more social accounts; use or integrate with URL shortening services; and measure likes, comments, replies, and retweets. This feature was mentioned in 12 Dashly reviews.", "percentage": 90, "based_on_number_of_reviews": 12}, {"name": "Social Media Engagement", "content": "As reported in 14 Dashly reviews. Social apps including polls, sweepstakes, and referral programs can enhance audience engagement.  Include these on your website, landing pages, Facebook pages, and emails.", "percentage": 88, "based_on_number_of_reviews": 14}, {"name": "Social Media Advertising", "content": "Based on 10 Dashly reviews. Amplify brand and community stories; Reach customers by social profile and activity; Optimize social ad campaigns in real-time", "percentage": 95, "based_on_number_of_reviews": 10}]}, {"name": "Reporting & Analytics", "features": [{"name": "Basic Reporting", "content": "As reported in 16 Dashly reviews. Access pre-built and custom reports and dashboards to measure leads by source/campaign/month, email performance, landing page performance, and web and social activity. Create report subscriptions that can automatically send updates to your team and executives.", "percentage": 85, "based_on_number_of_reviews": 16}, {"name": "Web Analytics", "content": "Track which pages prospects and customers visit and how often they come back.  Capture the history in database for lead scoring and sales intelligence. Use anonymous company look-up to identify anonymous visitors.  Send alerts to sales reps of which of their prospects and customers web activity. This feature was mentioned in 17 Dashly reviews.", "percentage": 93, "based_on_number_of_reviews": 17}, {"name": "ROI Analytics", "content": "As reported in 12 Dashly reviews. Measure leads, prospects generated, pipeline, revenue, investment, and ROI by marketing channel or program. The result is that you can see which marketing investments are generating the greatest return and get visibility into how marketing budget should be allocated going forward.", "percentage": 88, "based_on_number_of_reviews": 12}, {"name": "Revenue Analytics", "content": "Analyze how leads flow through the funnel by measuring stage to stage conversion rates and velocity.  Allocate pipeline and revenue credit among all the marketing activities that have successfully touched an opportunity as it moves through the pipeline.", "percentage": null, "based_on_number_of_reviews": null}, {"name": "SEO / Keyword Analytics", "content": "Based on 12 Dashly reviews. Monitor and track how you rank for relevant keywords on major search engines and compare your overall performance to competitors.", "percentage": 92, "based_on_number_of_reviews": 12}]}, {"name": "Messenger", "features": [{"name": "Sequencing", "content": "Mapped-out responses for conversations. 19 reviewers of Dashly have provided feedback on this feature.", "percentage": 89, "based_on_number_of_reviews": 19}, {"name": "AI", "content": "Artificial intelligence (AI) and chatbot involvement.  This feature was mentioned in 13 Dashly reviews.", "percentage": 83, "based_on_number_of_reviews": 13}, {"name": "Live Chat", "content": "As reported in 33 Dashly reviews. Live human component of conversations.", "percentage": 97, "based_on_number_of_reviews": 33}, {"name": "Customization Interface", "content": "Quality of interface for designing and customizing conversation maps. 28 reviewers of Dashly have provided feedback on this feature.", "percentage": 91, "based_on_number_of_reviews": 28}]}, {"name": "Channels", "features": [{"name": "Social Media", "content": "As reported in 19 Dashly reviews. Conversations enacted over social media.", "percentage": 91, "based_on_number_of_reviews": 19}, {"name": "Website", "content": "As reported in 28 Dashly reviews. Conversations enacted through embedding or pop-ups on websites.", "percentage": 93, "based_on_number_of_reviews": 28}, {"name": "Text Message (SMS)", "content": "Conversations enacted through text message (SMS).", "percentage": null, "based_on_number_of_reviews": null}, {"name": "Voice Assistants", "content": "Conversations enacted through voice assistants.", "percentage": null, "based_on_number_of_reviews": null}, {"name": "Other", "content": "Conversations enacted through other channels.", "percentage": null, "based_on_number_of_reviews": null}]}, {"name": "Customers", "features": [{"name": "Targeting", "content": "Overall quality of customer targeting based on needs or situations. This feature was mentioned in 19 Dashly reviews.", "percentage": 93, "based_on_number_of_reviews": 19}, {"name": "Profiles", "content": "Creation and modification of customer profiles based on conversations. 20 reviewers of Dashly have provided feedback on this feature.", "percentage": 92, "based_on_number_of_reviews": 20}, {"name": "Analytics", "content": "As reported in 27 Dashly reviews. Reporting based around specific and overall conversation results.", "percentage": 94, "based_on_number_of_reviews": 27}, {"name": "Lead Gathering", "content": "Capture and organization of leads from conversations. 23 reviewers of Dashly have provided feedback on this feature.", "percentage": 92, "based_on_number_of_reviews": 23}, {"name": "Sales Conversion", "content": "As reported in 22 Dashly reviews. Success rate of conversations leading to customer purchases.", "percentage": 93, "based_on_number_of_reviews": 22}]}], "star_distribution": {"1": 1, "2": 0, "3": 0, "4": 7, "5": 53}, "popular_mentions": ["Automation features", "Business", "Chat", "Chat app", "Customer support", "Customization", "Emails", "Features", "Integration", "Knowledge base", "Leads", "Marketing automation", "Support team", "User interface", "Website"], "g2_reviews_link": "https://www.g2.com/products/dashly/reviews#reviews", "review_links": ["https://www.g2.com/products/dashly/reviews", "https://www.g2.com/products/dashly/reviews?page=2", "https://www.g2.com/products/dashly/reviews?page=3"], "initial_reviews": [{"review_id": 7925645, "review_title": "Dashly is not just WebChat it is an entire ecosystem", "review_content": "What do you like best about Dashly?\nOut of all the chat apps available, we prefer Dashly for several reasons.\n\nFirstly, its user interface is well-designed and easy to navigate, despite having many features. This adds to the overall user experience and creates a feeling of luxury.\n\nSecondly, the app offers rich features such as social channel integration and chatbots, making it more than just a standard chat app. Additionally, Dashly has 30 native integrations and open APIs for web, IOS, and Android, providing a lot of options to extend the app's functionality.\n\nLastly, Dashly offers features such as pop-ups, triggered email messages, site visitor data tracking, knowledge base, live chat for marketing automation, and push notifications for mobile apps, going above and beyond the standard chat app.\n\nWhat do you dislike about Dashly?\nThe drawback of the app is the extensive range of possibilities it provides, which requires a considerable amount of time to fully master. Moreover, the app currently lacks integration with ChatGPT, which would be a valuable addition. It remains to be seen if this integration will be added in the future.\n\nWhat problems is Dashly solving and how is that benefiting you?\nDashly solves many problems and provides benefits for us and our clients.\n\nFor us as users, Dashly offers a clean and well-designed user interface that allows users to easily navigate through the app, despite its many features. This improves the overall user experience and gives a sense of luxury when using the app.\n\nSecondly, Dashly's rich features, such as social channel integration, chatbots, pop-ups, triggered emails, visitor data tracking, knowledge base, live chat for marketing automation and push notifications for mobile apps, go beyond a standard chat app to provide users with a variety of features in one place.\n\nWhat's more, Dashly's 30 native integrations and open APIs for web, IOS and Android give users plenty of opportunities to extend the app's functionality.\n\nFor our customers, our use of Dashly means that they have a far better experience with us and we can and do respond to customer queries quickly and without too much effort.\n\nOverall, Dashly's various features and functions benefit users by providing them with a comprehensive platform to manage their chat needs.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Out of all the chat apps available, we prefer Dashly for several reasons.\n\nFirstly, its user interface is well-designed and easy to navigate, despite having many features. This adds to the overall user experience and creates a feeling of luxury.\n\nSecondly, the app offers rich features such as social channel integration and chatbots, making it more than just a standard chat app. Additionally, Dashly has 30 native integrations and open APIs for web, IOS, and Android, providing a lot of options to extend the app's functionality.\n\nLastly, Dashly offers features such as pop-ups, triggered email messages, site visitor data tracking, knowledge base, live chat for marketing automation, and push notifications for mobile apps, going above and beyond the standard chat app."}, {"question": "What do you dislike about Dashly?", "answer": "The drawback of the app is the extensive range of possibilities it provides, which requires a considerable amount of time to fully master. Moreover, the app currently lacks integration with ChatGPT, which would be a valuable addition. It remains to be seen if this integration will be added in the future."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Dashly solves many problems and provides benefits for us and our clients.\n\nFor us as users, Dashly offers a clean and well-designed user interface that allows users to easily navigate through the app, despite its many features. This improves the overall user experience and gives a sense of luxury when using the app.\n\nSecondly, Dashly's rich features, such as social channel integration, chatbots, pop-ups, triggered emails, visitor data tracking, knowledge base, live chat for marketing automation and push notifications for mobile apps, go beyond a standard chat app to provide users with a variety of features in one place.\n\nWhat's more, Dashly's 30 native integrations and open APIs for web, IOS and Android give users plenty of opportunities to extend the app's functionality.\n\nFor our customers, our use of Dashly means that they have a far better experience with us and we can and do respond to customer queries quickly and without too much effort.\n\nOverall, Dashly's various features and functions benefit users by providing them with a comprehensive platform to manage their chat needs."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Rafal M.", "reviewer_job_title": "CEO", "reviewer_link": "https://www.g2.com/users/632b50dc-63a3-48d8-a9ad-0d566f6198e6"}, "publish_date": "2023-04-09T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7925645"}, {"review_id": 7916903, "review_title": "Fantastic Conversation And Marketing Personalization Platform", "review_content": "What do you like best about Dashly?\nI love the live chat feature and its easy integration with my website using Google Tag Manager. I got the entire platform set up on my website in less than 30 minutes, and this is my 1st time implementing live chat on my website. I'm going to do a quick rundown of the features I like best\n\n- Live Chat, customization with different colors and settings, and add-in integrations such as Whatsapp, Facebook Messenger, and Instagram. This is very important so I do not miss messages, and I have one platform to utilize for my marketing, sales, and customer support.\n\n- Triggered messages: This tool has already come in very handy. I specifically have been using the live chat-triggered feature. This allows me to send messages to nudge my website visitors to contact my business using my live chat.\n\n- Reports: It is vital to see the reports of how many people visit my website and take other specific actions. Dashly does a fantastic job here with their reports dashboard.\n\n- Chatbots: My team or myself is not always live on my website, which is why I need an automated way to continue gathering leads and resolving customer support queries while away from my business. I got to hand it to Dashly; they are a fantastic brand in this niche business.\n\nWhat do you dislike about Dashly?\nWhat I wish Dashly did was allow Workspaces to efficiently run multiple brands under the same account and differentiate the messages coming in. I only receive one snippet of code to add to my website. Unfortunately, this is not feasible since I currently have two brands and would need two accounts to keep the business separate.\n\nWhat problems is Dashly solving and how is that benefiting you?\nDashly has solved the live chat problem for me. The benefits I have realized is allowing people to interact with me in real time instead of having to send back and forth emails or get on the phone. Dashly has given me the ability to personalize to my customers so if they prefer to interact behind a screen with my brand, they now have that ability.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "I love the live chat feature and its easy integration with my website using Google Tag Manager. I got the entire platform set up on my website in less than 30 minutes, and this is my 1st time implementing live chat on my website. I'm going to do a quick rundown of the features I like best\n\n- Live Chat, customization with different colors and settings, and add-in integrations such as Whatsapp, Facebook Messenger, and Instagram. This is very important so I do not miss messages, and I have one platform to utilize for my marketing, sales, and customer support.\n\n- Triggered messages: This tool has already come in very handy. I specifically have been using the live chat-triggered feature. This allows me to send messages to nudge my website visitors to contact my business using my live chat.\n\n- Reports: It is vital to see the reports of how many people visit my website and take other specific actions. Dashly does a fantastic job here with their reports dashboard.\n\n- Chatbots: My team or myself is not always live on my website, which is why I need an automated way to continue gathering leads and resolving customer support queries while away from my business. I got to hand it to Dashly; they are a fantastic brand in this niche business."}, {"question": "What do you dislike about Dashly?", "answer": "What I wish Dashly did was allow Workspaces to efficiently run multiple brands under the same account and differentiate the messages coming in. I only receive one snippet of code to add to my website. Unfortunately, this is not feasible since I currently have two brands and would need two accounts to keep the business separate."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Dashly has solved the live chat problem for me. The benefits I have realized is allowing people to interact with me in real time instead of having to send back and forth emails or get on the phone. Dashly has given me the ability to personalize to my customers so if they prefer to interact behind a screen with my brand, they now have that ability."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Adrian B.", "reviewer_job_title": "Network Marketing", "reviewer_link": "https://www.g2.com/users/1b817b1d-c37c-421b-abdb-db2a7d1f6a0a"}, "publish_date": "2023-04-06T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7916903"}, {"review_id": 7873301, "review_title": "Great marketing suite for smaller businesses", "review_content": "What do you like best about Dashly?\nGives you a lot of useful tools, integrated together, into a single pack. Livechat and event tracking on the website (clicks and page views per individual visitor) and feeding this data into a CRM and putting it into work with marketing automation - that's pretty great!\n\nWhat do you dislike about Dashly?\nMany of the core features, including event tracking need to be improved, as they currently do get the job done somewhat, but in the case of event tracking - it's not super precise and also gives you a bunch of unncessary data (such as device, OS, etc.) while messing up with simple but important things like source page/domain.\n\nSupport is also veeeery slow (single reply takes 20-30+ minutes), though it's still better than getting replies via e-mail just once per 24h for example. Gets the job done anyways, with some patience.\n\nPricing is weird and over-complex.\n\nWhat problems is Dashly solving and how is that benefiting you?\nDashly helps me connect with the visitors of my blog and turn them into new contacts, leads and business connections. My new platform is all about building new relationships and Dashly's suite of conversational marketing tools is just what I needed.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Gives you a lot of useful tools, integrated together, into a single pack. Livechat and event tracking on the website (clicks and page views per individual visitor) and feeding this data into a CRM and putting it into work with marketing automation - that's pretty great!"}, {"question": "What do you dislike about Dashly?", "answer": "Many of the core features, including event tracking need to be improved, as they currently do get the job done somewhat, but in the case of event tracking - it's not super precise and also gives you a bunch of unncessary data (such as device, OS, etc.) while messing up with simple but important things like source page/domain.\n\nSupport is also veeeery slow (single reply takes 20-30+ minutes), though it's still better than getting replies via e-mail just once per 24h for example. Gets the job done anyways, with some patience.\n\nPricing is weird and over-complex."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Dashly helps me connect with the visitors of my blog and turn them into new contacts, leads and business connections. My new platform is all about building new relationships and Dashly's suite of conversational marketing tools is just what I needed."}], "review_rating": 4.5, "reviewer": {"reviewer_name": "Deyan K.", "reviewer_job_title": "Co-Founder", "reviewer_link": "https://www.g2.com/users/798f2682-889e-4851-bef1-10c1378457ea"}, "publish_date": "2023-04-05T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7873301"}, {"review_id": 7870734, "review_title": "Great conversational marketing platform", "review_content": "What do you like best about Dashly?\nThe conversational marketing platform comes with chatbots to provide top-notch support ( It's almost impossible for small businesses to provide 24/7 support, right? Chatbots allow support agents to get some rest!), pop-ups to grow your email list, a knowledge base, email marketing automation and more. To get you started, Dashly provides a starter guide and a playbook with leadbot templates, triggered message templates and video tutorials, as well as a knowledge base. Unlike some of its competitors, Dashly shines with its simple and clean UI.\n\nWhat do you dislike about Dashly?\nThere are just a few minor things that I think should be improved. The knowledge base design definitely needs some more love. I'm also not a big fan of the thin line icons in the backend.\n\nWhat problems is Dashly solving and how is that benefiting you?\nWe use Dashly to support existing customers and answer pre-sales questions from potential customers via live chat. Soon we will also be using pop-ups and email campaigns.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "The conversational marketing platform comes with chatbots to provide top-notch support ( It's almost impossible for small businesses to provide 24/7 support, right? Chatbots allow support agents to get some rest!), pop-ups to grow your email list, a knowledge base, email marketing automation and more. To get you started, Dashly provides a starter guide and a playbook with leadbot templates, triggered message templates and video tutorials, as well as a knowledge base. Unlike some of its competitors, Dashly shines with its simple and clean UI."}, {"question": "What do you dislike about Dashly?", "answer": "There are just a few minor things that I think should be improved. The knowledge base design definitely needs some more love. I'm also not a big fan of the thin line icons in the backend."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "We use Dashly to support existing customers and answer pre-sales questions from potential customers via live chat. Soon we will also be using pop-ups and email campaigns."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Stefan G.", "reviewer_job_title": "Operations Director", "reviewer_link": "https://www.g2.com/users/a0d9905a-98fc-414e-af60-963393afd882"}, "publish_date": "2023-03-27T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7870734"}, {"review_id": 7841905, "review_title": "Full of useful features and easy to use", "review_content": "What do you like best about Dashly?\nThe most important Dashly feature for me is the ability to use my own brand. The emails come from my own domain, there is no Dashly branding.\n\nThe best Dashly feature in my opinion is the ability to view all messages in one location and know all the necessary details about each lead. You can then follow up with each lead via email and they can see a history of their interaction/messages when they visit the website again.\n\nHaving a great-looking website is not enough, you'll need something like Dashly to perform that necessary little push to get website visitors to engage.\n\nDashly is very easy to use. They have an easy to understand articles and videos explaining how to use the features. I have used some other apps similar to Dashly in the past and felt that a technical background was needed to fully make use of each feature being offered, but Dashly is so user-friendly.\n\nWhat do you dislike about Dashly?\nI wish there was an ability to use multiple email domains. The chatbots can be used on multiple websites but I think we are only allowed to use one email domain when sending a copy of the conversation to a lead.\n\nWhat problems is Dashly solving and how is that benefiting you?\nDashly is making my website look professional and allows web visitors to engage easily.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "The most important Dashly feature for me is the ability to use my own brand. The emails come from my own domain, there is no Dashly branding.\n\nThe best Dashly feature in my opinion is the ability to view all messages in one location and know all the necessary details about each lead. You can then follow up with each lead via email and they can see a history of their interaction/messages when they visit the website again.\n\nHaving a great-looking website is not enough, you'll need something like Dashly to perform that necessary little push to get website visitors to engage.\n\nDashly is very easy to use. They have an easy to understand articles and videos explaining how to use the features. I have used some other apps similar to Dashly in the past and felt that a technical background was needed to fully make use of each feature being offered, but Dashly is so user-friendly."}, {"question": "What do you dislike about Dashly?", "answer": "I wish there was an ability to use multiple email domains. The chatbots can be used on multiple websites but I think we are only allowed to use one email domain when sending a copy of the conversation to a lead."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Dashly is making my website look professional and allows web visitors to engage easily."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Seth G.", "reviewer_job_title": "Immigration Consultant", "reviewer_link": "https://www.g2.com/users/4e874a46-f7c4-4843-b202-0b7eecb9498a"}, "publish_date": "2023-03-17T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7841905"}, {"review_id": 7820730, "review_title": "Using this to build relationships at work through fyndflow", "review_content": "What do you like best about Dashly?\nA great feature of Dashly is its ability to track customer interactions and provide detailed analytics. This allows businesses to gain insights into their customers' behavior and preferences, enabling them to make informed decisions about their marketing and customer communication strategies. With Dashly's analytics, businesses can track metrics such as chat response times, conversion rates, and customer satisfaction scores, which can be used to improve their overall customer experience.\n\nWhat do you dislike about Dashly?\nIts automation and customization features make it an excellent choice for businesses of all sizes, and its detailed analytics provide valuable insights into customer behavior. With Dashly, businesses can streamline their customer communication and provide a seamless experience for their customers.\n\nWhat problems is Dashly solving and how is that benefiting you?\nOne of the key features that sets Dashly apart from its competitors is its ability to automate customer communication. This is done through the use of chatbots, which can handle a variety of tasks such as answering frequently asked questions, booking appointments, and even processing payments. This automation feature saves businesses time and resources, allowing them to focus on other areas of their operations.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "A great feature of Dashly is its ability to track customer interactions and provide detailed analytics. This allows businesses to gain insights into their customers' behavior and preferences, enabling them to make informed decisions about their marketing and customer communication strategies. With Dashly's analytics, businesses can track metrics such as chat response times, conversion rates, and customer satisfaction scores, which can be used to improve their overall customer experience."}, {"question": "What do you dislike about Dashly?", "answer": "Its automation and customization features make it an excellent choice for businesses of all sizes, and its detailed analytics provide valuable insights into customer behavior. With Dashly, businesses can streamline their customer communication and provide a seamless experience for their customers."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "One of the key features that sets Dashly apart from its competitors is its ability to automate customer communication. This is done through the use of chatbots, which can handle a variety of tasks such as answering frequently asked questions, booking appointments, and even processing payments. This automation feature saves businesses time and resources, allowing them to focus on other areas of their operations."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Shubham A.", "reviewer_job_title": "Chief Relationship Officer", "reviewer_link": "https://www.g2.com/users/a66b689d-150e-4317-891a-9a8a1e53f449"}, "publish_date": "2023-03-10T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7820730"}, {"review_id": 7802756, "review_title": "Good app for lead generation", "review_content": "What do you like best about Dashly?\nIn Dashly, I can record a person before they have left any data and track and push each one to a sale. I can set up end-to-end integrations, gradual data enrichment, and automation. Everything that costs a lot is available to everyone on an affordable subscription.\n\nDashly already paid for itself in the first month, when it received 20% more target appointments than the previous month.\n\nWhat do you dislike about Dashly?\nThe disadvantages can be distinguished as email editor (but it seems to be treated by a new email builder).\n\nWhat problems is Dashly solving and how is that benefiting you?\nFor a year, I used Intercom, but after an hour of studying Dashly, I switched to it and called all the entrepreneurs I knew. The reasons are straightforward: Dashly is a very convenient tool for communicating with users and closes most questions related to user analytics.\n\nFirst, I installed Dashly on my site and initiated a chat with those visitors who came in for more than the first time, offering them help, asking questions like \"what are you looking for,\" and \"tell us about your needs, so we can figure out how best to help you.\" This works well, people respond, and eventually, a conversation is established, which can later transform into a trial registration and a sale.\nLater, we installed the widget in the CRM system and used it for context clues on specific product features. We also use it to send out information to users about new product features, links to surveys we conduct, and notify them about promotions.\n\nThe product, in general, is excellent, of course. We wish success to the company! I am certainly ready to recommend the product.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "In Dashly, I can record a person before they have left any data and track and push each one to a sale. I can set up end-to-end integrations, gradual data enrichment, and automation. Everything that costs a lot is available to everyone on an affordable subscription.\n\nDashly already paid for itself in the first month, when it received 20% more target appointments than the previous month."}, {"question": "What do you dislike about Dashly?", "answer": "The disadvantages can be distinguished as email editor (but it seems to be treated by a new email builder)."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "For a year, I used Intercom, but after an hour of studying Dashly, I switched to it and called all the entrepreneurs I knew. The reasons are straightforward: Dashly is a very convenient tool for communicating with users and closes most questions related to user analytics.\n\nFirst, I installed Dashly on my site and initiated a chat with those visitors who came in for more than the first time, offering them help, asking questions like \"what are you looking for,\" and \"tell us about your needs, so we can figure out how best to help you.\" This works well, people respond, and eventually, a conversation is established, which can later transform into a trial registration and a sale.\nLater, we installed the widget in the CRM system and used it for context clues on specific product features. We also use it to send out information to users about new product features, links to surveys we conduct, and notify them about promotions.\n\nThe product, in general, is excellent, of course. We wish success to the company! I am certainly ready to recommend the product."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Jana V.", "reviewer_job_title": "E-Learning", "reviewer_link": "https://www.g2.com/users/janatoys"}, "publish_date": "2023-03-10T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7802756"}, {"review_id": 7809449, "review_title": "Dashly is full of helpful features", "review_content": "What do you like best about Dashly?\nI love that Dashly has all the tools I need in one roof. I can use Live Chat, Chatbot, Knowledge base, Unified inbox for all communication channels.\n\nI also like that Dashly has a neat UI. While having many features, the UI is very clean and it makes it super easy for me to just navigate around.\n\nThe UX is also quite good. It takes me step by step toward the goal. For example, the Chatbot has a Typeform form to give me available options for each step to create the chat bot. It is easy and convenient for the first step. Then Dashly presented a full \"picture\" of the chatbot that I can create.\n\nI think the integrations can also be a plus for Dashly. They have native integrations with all popular communication channels, including Messenger, Viber, Instagram, Whatsapp, Telegram etc.\n\nWhat do you dislike about Dashly?\nWhile integrations to all popular channels are available, I would expect to have more native integrations, for example to more CRM / e-mail automation platforms. There seem to be available integration for that type but with limited information.\n\nI also hope that there will be more available templates, for example for the chatbot. That would make Dashly even more helpful.\n\nWhat problems is Dashly solving and how is that benefiting you?\nDashly is a great tool that combines various tools together in a nicely looking interface and dashboard. From Dashly, I can easily set up communication channels with clients in all platforms via live chat, chat bots, with detailed reporting and analytics. I can also combine and see all of those communication in one unified inbox - saving great time to go back and forth between different systems.\n\nAll in all, I think Dashly is a wonderful solution and help me to save significant time and complication in communicating with clients.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "I love that Dashly has all the tools I need in one roof. I can use Live Chat, Chatbot, Knowledge base, Unified inbox for all communication channels.\n\nI also like that Dashly has a neat UI. While having many features, the UI is very clean and it makes it super easy for me to just navigate around.\n\nThe UX is also quite good. It takes me step by step toward the goal. For example, the Chatbot has a Typeform form to give me available options for each step to create the chat bot. It is easy and convenient for the first step. Then Dashly presented a full \"picture\" of the chatbot that I can create.\n\nI think the integrations can also be a plus for Dashly. They have native integrations with all popular communication channels, including Messenger, Viber, Instagram, Whatsapp, Telegram etc."}, {"question": "What do you dislike about Dashly?", "answer": "While integrations to all popular channels are available, I would expect to have more native integrations, for example to more CRM / e-mail automation platforms. There seem to be available integration for that type but with limited information.\n\nI also hope that there will be more available templates, for example for the chatbot. That would make Dashly even more helpful."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Dashly is a great tool that combines various tools together in a nicely looking interface and dashboard. From Dashly, I can easily set up communication channels with clients in all platforms via live chat, chat bots, with detailed reporting and analytics. I can also combine and see all of those communication in one unified inbox - saving great time to go back and forth between different systems.\n\nAll in all, I think Dashly is a wonderful solution and help me to save significant time and complication in communicating with clients."}], "review_rating": 4.5, "reviewer": {"reviewer_name": "Hoang P.", "reviewer_job_title": "Director", "reviewer_link": "https://www.g2.com/users/86eb6672-4de6-4b99-9368-1209128cc02d"}, "publish_date": "2023-03-08T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7809449"}, {"review_id": 7690660, "review_title": "Sociamonials has used Dashly for live chat, customer support ticketing, email onboarding, and popups", "review_content": "What do you like best about Dashly?\nEverything is very well integrated into one tool. We used to have a live chat tool, ticketing tool, knowledgebase tool, onboarding tool, etc. and now we do it all in one place. Collaboration with team members is super easy too so my staff loves it. We use the API to integrate with our SaaS tool, so it feels like it was built just for our needs, love it.\n\nWhat do you dislike about Dashly?\nThere have been times when we need help, and while their staff is extremely helpful, there are chunks of time when their staff isn't on duty because it is off hours for them. We are in USA, so our hours don't sync up as well as we would like. We've learned to work around their hours though.\n\nWhat problems is Dashly solving and how is that benefiting you?\nWe offer a white-label social media software with many different client types. Some are using our tool for their own company. Some are reselling our tool as if it were their own (white label). This requires a deep API integration to segment the users who are using live chat so we don't reply as Sociamonials to a white-label client. We also cannot trigger popups for subusers, only Account Owners, this is simple in Dashly because of the advanced segmentation capabilities. They've really thought it through, so we have complete control. Even our onboarding email sequences are customized based on client type/user type.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Everything is very well integrated into one tool. We used to have a live chat tool, ticketing tool, knowledgebase tool, onboarding tool, etc. and now we do it all in one place. Collaboration with team members is super easy too so my staff loves it. We use the API to integrate with our SaaS tool, so it feels like it was built just for our needs, love it."}, {"question": "What do you dislike about Dashly?", "answer": "There have been times when we need help, and while their staff is extremely helpful, there are chunks of time when their staff isn't on duty because it is off hours for them. We are in USA, so our hours don't sync up as well as we would like. We've learned to work around their hours though."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "We offer a white-label social media software with many different client types. Some are using our tool for their own company. Some are reselling our tool as if it were their own (white label). This requires a deep API integration to segment the users who are using live chat so we don't reply as Sociamonials to a white-label client. We also cannot trigger popups for subusers, only Account Owners, this is simple in Dashly because of the advanced segmentation capabilities. They've really thought it through, so we have complete control. Even our onboarding email sequences are customized based on client type/user type."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Craig S.", "reviewer_job_title": "Chief Executive Officer", "reviewer_link": "https://www.g2.com/users/862fc3dc-c4b9-4507-b5f6-61b0a4778875"}, "publish_date": "2023-02-08T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7690660"}, {"review_id": 7721758, "review_title": "Dashly = good response time to customers", "review_content": "What do you like best about Dashly?\nDashly helps our company to link up with customers quickly and easily via live chat, and it's been a fantastic tool. Setting it up was a breeze, and the interface is user-friendly, making it easy for our team to provide personalized support and exceptional customer service. What's more, the chat platform has an impressive set of features, including automated messaging, segmentation, and analytics. All in all, we believe that Dashly is an exceptional product that delivers excellent value for the investment.\n\nWhat do you dislike about Dashly?\nIn my experience, I have not come across any downsides when using this software. It is incredibly easy to access and use, making it a seamless process from start to finish.\n\nWhat problems is Dashly solving and how is that benefiting you?\nDashly helps to streamline and organize the process of communicating with customers. Its efficient live chat system enables quick problem-solving, allowing website visitors to clarify any details they need and move on. In addition, Dashly collects valuable data such as the user's location, OS and web browser version, and email. This information helps our team to better understand and serve our customers, leading to improved customer satisfaction and loyalty.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Dashly helps our company to link up with customers quickly and easily via live chat, and it's been a fantastic tool. Setting it up was a breeze, and the interface is user-friendly, making it easy for our team to provide personalized support and exceptional customer service. What's more, the chat platform has an impressive set of features, including automated messaging, segmentation, and analytics. All in all, we believe that Dashly is an exceptional product that delivers excellent value for the investment."}, {"question": "What do you dislike about Dashly?", "answer": "In my experience, I have not come across any downsides when using this software. It is incredibly easy to access and use, making it a seamless process from start to finish."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Dashly helps to streamline and organize the process of communicating with customers. Its efficient live chat system enables quick problem-solving, allowing website visitors to clarify any details they need and move on. In addition, Dashly collects valuable data such as the user's location, OS and web browser version, and email. This information helps our team to better understand and serve our customers, leading to improved customer satisfaction and loyalty."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Amit B.", "reviewer_job_title": "CEO", "reviewer_link": "https://www.g2.com/users/41f74c47-2653-4da4-9fd4-ee988fe0629b"}, "publish_date": "2023-02-16T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7721758"}, {"review_id": 7731658, "review_title": "Awesome Software", "review_content": "What do you like best about Dashly?\nDashly keeps track of all conversations in one place. It makes it easier for the team to work on tasks together. I can see the performance of our marketing activities in real time.\n\nDashly is a way to get more leads and make more sales. It's a solution that enables you to track and engage your visitors directly on your website, Facebook, and other social media. It's a great way to get leads and engage with them right on your website.\n\nWe've been looking for a good customer support platform and one that can help us manage our social media accounts. we've tried it out and we're very pleased with the results. it's good to see that they have a good support team. So far, so good.\n\nWhat do you dislike about Dashly?\nDashly's branding all over the software...\n\nWhat problems is Dashly solving and how is that benefiting you?\nlead gen and convertion", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Dashly keeps track of all conversations in one place. It makes it easier for the team to work on tasks together. I can see the performance of our marketing activities in real time.\n\nDashly is a way to get more leads and make more sales. It's a solution that enables you to track and engage your visitors directly on your website, Facebook, and other social media. It's a great way to get leads and engage with them right on your website.\n\nWe've been looking for a good customer support platform and one that can help us manage our social media accounts. we've tried it out and we're very pleased with the results. it's good to see that they have a good support team. So far, so good."}, {"question": "What do you dislike about Dashly?", "answer": "Dashly's branding all over the software..."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "lead gen and convertion"}], "review_rating": 4.5, "reviewer": {"reviewer_name": "Prins A.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/9385bd72-292f-49cf-a124-9f7fd94269d7"}, "publish_date": "2023-02-17T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7731658"}, {"review_id": 7916829, "review_title": "All in once package", "review_content": "What do you like best about Dashly?\nDashly has so many features, and functionalities, all in a single tool. You can live chat, collect leads, add triggers, and run campaigns all from a single tool. This could be very useful as well as time saving.\n\nWhat do you dislike about Dashly?\nWell the add-ons. Even after purchasing the packages, you need to get the add-ons as well to make it complete. These should already be included in the package.\n\nWhat problems is Dashly solving and how is that benefiting you?\nWell, it solves many problems by getting multiple features in a single tool. This could save a lot of time as well as easy to manage and run campaigns. Live chat can maintain a history as well as the tagging feature is really good.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Dashly has so many features, and functionalities, all in a single tool. You can live chat, collect leads, add triggers, and run campaigns all from a single tool. This could be very useful as well as time saving."}, {"question": "What do you dislike about Dashly?", "answer": "Well the add-ons. Even after purchasing the packages, you need to get the add-ons as well to make it complete. These should already be included in the package."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Well, it solves many problems by getting multiple features in a single tool. This could save a lot of time as well as easy to manage and run campaigns. Live chat can maintain a history as well as the tagging feature is really good."}], "review_rating": 4.0, "reviewer": {"reviewer_name": "Ali H.", "reviewer_job_title": "CEO", "reviewer_link": "https://www.g2.com/users/27653dc0-942b-40f6-ac19-ef07785e80ca"}, "publish_date": "2023-04-06T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7916829"}, {"review_id": 7887511, "review_title": "A Versatile Marketing Automation Tool for Small Businesses", "review_content": "What do you like best about Dashly?\nAs a small business owner, I sought a marketing automation tool to help me save time and streamline my marketing efforts. That's when I discovered Dashly.io, and I have been using it for several months now with excellent results.\n\nWhat I love about Dashly.io is how versatile it is. The platform offers a wide range of features that make it easy to create and manage email campaigns, track user behavior, and engage with customers. The automation features are compelling, allowing me to set up complex workflows and sequences of emails that have helped me improve my conversion rates.\n\nI also appreciate how user-friendly Dashly.io is. The platform's intuitive user interface makes navigating and accessing all the features easy, and the customer support team has been very responsive and helpful.\n\nAnother feature that sets Dashly.io apart is its ability to integrate seamlessly with other tools and platforms. The platform integrates with popular tools such as Google Analytics, Slack, and Salesforce, making sharing data easy and streamlining my workflow.\n\nWhat do you dislike about Dashly?\nWhile Dashly.io offers an impressive range of features, some users may initially find the platform's user interface a bit overwhelming. With so many options available, learning how to navigate and use everything effectively can take some time. However, once you become familiar with the platform's layout and features, it becomes much easier to use and highly intuitive.\n\nWhat problems is Dashly solving and how is that benefiting you?\nDashly.io is solving my marketing automation needs by providing a comprehensive suite of tools that make engaging with my customers, generating leads, and increasing conversions easy. As a busy business owner, I often struggle with finding ways to streamline my marketing efforts and connect with my customers effectively. Dashly.io has been a game-changer for me, as it offers powerful automation features that allow me to create and manage email campaigns, track user behavior, and personalize the customer experience. With its seamless integrations with other tools and platforms, Dashly.io has helped me save time, increase efficiency, and improve my overall campaign performance. Thanks to Dashly.io, I can focus on running my business and let the platform take care of my marketing needs, resulting in better customer engagement and higher revenue.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "As a small business owner, I sought a marketing automation tool to help me save time and streamline my marketing efforts. That's when I discovered Dashly.io, and I have been using it for several months now with excellent results.\n\nWhat I love about Dashly.io is how versatile it is. The platform offers a wide range of features that make it easy to create and manage email campaigns, track user behavior, and engage with customers. The automation features are compelling, allowing me to set up complex workflows and sequences of emails that have helped me improve my conversion rates.\n\nI also appreciate how user-friendly Dashly.io is. The platform's intuitive user interface makes navigating and accessing all the features easy, and the customer support team has been very responsive and helpful.\n\nAnother feature that sets Dashly.io apart is its ability to integrate seamlessly with other tools and platforms. The platform integrates with popular tools such as Google Analytics, Slack, and Salesforce, making sharing data easy and streamlining my workflow."}, {"question": "What do you dislike about Dashly?", "answer": "While Dashly.io offers an impressive range of features, some users may initially find the platform's user interface a bit overwhelming. With so many options available, learning how to navigate and use everything effectively can take some time. However, once you become familiar with the platform's layout and features, it becomes much easier to use and highly intuitive."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Dashly.io is solving my marketing automation needs by providing a comprehensive suite of tools that make engaging with my customers, generating leads, and increasing conversions easy. As a busy business owner, I often struggle with finding ways to streamline my marketing efforts and connect with my customers effectively. Dashly.io has been a game-changer for me, as it offers powerful automation features that allow me to create and manage email campaigns, track user behavior, and personalize the customer experience. With its seamless integrations with other tools and platforms, Dashly.io has helped me save time, increase efficiency, and improve my overall campaign performance. Thanks to Dashly.io, I can focus on running my business and let the platform take care of my marketing needs, resulting in better customer engagement and higher revenue."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2023-03-30T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7887511"}, {"review_id": 7801653, "review_title": "Very easy to use", "review_content": "What do you like best about Dashly?\nI'm not a software/web guy by trade I am in fact, a self-employed landscaper. This has been one of the easiest web tools I've ever used! Having so many included features meant less need for 3rd party integrations which was one of the greatest headaches I suffered trying to figure out all this web stuff. Not to mention when integration is needed it's fairly easy to do.\n\nI highly recommend this product to any of the 1-2 man operations out there!\n\nWhat do you dislike about Dashly?\nI have not yet run into any issues with Dashly.\n\nWhat problems is Dashly solving and how is that benefiting you?\nThe ease of use and built-in features eliminate the need to integrate with other tools. Having an all-in-one platform saves me a lot of time I can divert to other matters", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "I'm not a software/web guy by trade I am in fact, a self-employed landscaper. This has been one of the easiest web tools I've ever used! Having so many included features meant less need for 3rd party integrations which was one of the greatest headaches I suffered trying to figure out all this web stuff. Not to mention when integration is needed it's fairly easy to do.\n\nI highly recommend this product to any of the 1-2 man operations out there!"}, {"question": "What do you dislike about Dashly?", "answer": "I have not yet run into any issues with Dashly."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "The ease of use and built-in features eliminate the need to integrate with other tools. Having an all-in-one platform saves me a lot of time I can divert to other matters"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Joshua W.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/5d5ae4db-3e7a-4166-9f71-32d46c5eb32c"}, "publish_date": "2023-03-06T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7801653"}, {"review_id": 7735779, "review_title": "Dashly is a winner in lead generation", "review_content": "What do you like best about Dashly?\nI like the fact that I can just create a simple lead bot in 10 mins and start gathering leads. The conversational way of working is just miles ahead of a solo popup. Also, their support is great, it's just from another level in comparison to many many many competitors i used before.\n\nWhat do you dislike about Dashly?\nA small downside of Dashly is maybe that it doesn't have a custom css function to fully customize the widget, however, it's only a small remark on top of a great tool.\n\nWhat problems is Dashly solving and how is that benefiting you?\nLead generation in a conversational way. Thanks to that, i can easily uplift my conversion rates in comparison to a popup. Having the ability to add in a livechat is even better, however, i don't have the capacity to use it right now.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "I like the fact that I can just create a simple lead bot in 10 mins and start gathering leads. The conversational way of working is just miles ahead of a solo popup. Also, their support is great, it's just from another level in comparison to many many many competitors i used before."}, {"question": "What do you dislike about Dashly?", "answer": "A small downside of Dashly is maybe that it doesn't have a custom css function to fully customize the widget, however, it's only a small remark on top of a great tool."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Lead generation in a conversational way. Thanks to that, i can easily uplift my conversion rates in comparison to a popup. Having the ability to add in a livechat is even better, however, i don't have the capacity to use it right now."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Matthias B.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/78ff8f53-7623-48e9-b67a-a3a0893a4bb1"}, "publish_date": "2023-02-20T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7735779"}, {"review_id": 7707924, "review_title": "Easy to install and use Chat and Bot widget", "review_content": "What do you like best about Dashly?\nThis was very easy to setup and apply our branding. I did not have to spend a huge amount of time to get the basics working. We are now rolling out the knowledge base and chat bots. This was a great find as cheaper and more functional than the chat service we used previously. The support was fast and helpful when we did need them. Recommended.\n\nWhat do you dislike about Dashly?\nInitial concerns of multi domains. But the support team sorted this quickly.\nIntegrating the knowledge base for self service in the chat widget would be a great enhancement.\n\nWhat problems is Dashly solving and how is that benefiting you?\nWe are giving our site visitors just enough support without being intrusive. The interface is a lot more fun for end users than our previous tools.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "This was very easy to setup and apply our branding. I did not have to spend a huge amount of time to get the basics working. We are now rolling out the knowledge base and chat bots. This was a great find as cheaper and more functional than the chat service we used previously. The support was fast and helpful when we did need them. Recommended."}, {"question": "What do you dislike about Dashly?", "answer": "Initial concerns of multi domains. But the support team sorted this quickly.\nIntegrating the knowledge base for self service in the chat widget would be a great enhancement."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "We are giving our site visitors just enough support without being intrusive. The interface is a lot more fun for end users than our previous tools."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Christian M.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/88c62d2c-982c-4c4d-8684-319b9328f743"}, "publish_date": "2023-02-13T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7707924"}, {"review_id": 7705270, "review_title": "A chat software that even a child can configure", "review_content": "What do you like best about Dashly?\nDashly is a tool where you can set up your live chat in a few minutes. The level of customization that your widget has is incredible. Best of all, you can generate a chat and you can embed it in various wordpress websites using its official plugin, where you just put the subscription keys and that's it.\n\nI use the android application and it is extremely fast, in real time I can see my potential customers online and know where they come from or what section they are in.\n\nWhat do you dislike about Dashly?\nIt could improve the translation of some buttons because the Spanish translation is not literal, but nothing that cannot be understood.\n\nWhat problems is Dashly solving and how is that benefiting you?\nImmediate attention to potential customers, worth what it costs", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Dashly is a tool where you can set up your live chat in a few minutes. The level of customization that your widget has is incredible. Best of all, you can generate a chat and you can embed it in various wordpress websites using its official plugin, where you just put the subscription keys and that's it.\n\nI use the android application and it is extremely fast, in real time I can see my potential customers online and know where they come from or what section they are in."}, {"question": "What do you dislike about Dashly?", "answer": "It could improve the translation of some buttons because the Spanish translation is not literal, but nothing that cannot be understood."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Immediate attention to potential customers, worth what it costs"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Oscar R.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/258d21ae-60a5-4f1d-af37-8475b0e130f8"}, "publish_date": "2023-02-13T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7705270"}, {"review_id": 7902154, "review_title": "complete solution for customer support and lead generation", "review_content": "What do you like best about Dashly?\nwe just switched to Dashly and we were very happy with all the functionalities Dashly offers, live chat, chatbot, knowledge base. also the fact that we can use our own branding and emails are sent through our own domain. it's fantastic how easy it is to set up!\n\nWhat do you dislike about Dashly?\nemail layout can be improved but it's already fixed with the new email builder\n\nWhat problems is Dashly solving and how is that benefiting you?\nDashly helped us follow up with leads who interacted with us via our website, using emails and integrations, we were able to recover leads and convert more visitors", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "we just switched to Dashly and we were very happy with all the functionalities Dashly offers, live chat, chatbot, knowledge base. also the fact that we can use our own branding and emails are sent through our own domain. it's fantastic how easy it is to set up!"}, {"question": "What do you dislike about Dashly?", "answer": "email layout can be improved but it's already fixed with the new email builder"}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Dashly helped us follow up with leads who interacted with us via our website, using emails and integrations, we were able to recover leads and convert more visitors"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "hafedh K.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/cf8db246-461d-4043-82dc-38eec21383fb"}, "publish_date": "2023-04-03T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7902154"}, {"review_id": 7919347, "review_title": "Pleasant experience!", "review_content": "What do you like best about Dashly?\nGreat UI, one of the best out there you can find! When using it, everything is just visually appealing!\nEasy to use, everything is just so intuitive.\nGreat functionality! Chatbot, Live chat, Popup, Triggered message, all in one and all easy to set up!\nGood numbers of integrations, connect to marketing stack with ease!\nOverall I am very happy with Dashly!\n\nWhat do you dislike about Dashly?\nPrice, definitely not the cheapest you will find.\nNon-multiligual. this is something the team must add, otherwise competitors will win.\nSomewhat confusing price structure, modules pricing are a bit of pain to work with.\n\nWhat problems is Dashly solving and how is that benefiting you?\nDashly helps me generate leads, qualify them, all automatically while I am away or asleep! Saved me couple hundred dollars per month since I switched from other insanely overpriced chat app.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Great UI, one of the best out there you can find! When using it, everything is just visually appealing!\nEasy to use, everything is just so intuitive.\nGreat functionality! Chatbot, Live chat, Popup, Triggered message, all in one and all easy to set up!\nGood numbers of integrations, connect to marketing stack with ease!\nOverall I am very happy with Dashly!"}, {"question": "What do you dislike about Dashly?", "answer": "Price, definitely not the cheapest you will find.\nNon-multiligual. this is something the team must add, otherwise competitors will win.\nSomewhat confusing price structure, modules pricing are a bit of pain to work with."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Dashly helps me generate leads, qualify them, all automatically while I am away or asleep! Saved me couple hundred dollars per month since I switched from other insanely overpriced chat app."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2023-04-06T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7919347"}, {"review_id": 7711624, "review_title": "A very useful marketing tool", "review_content": "What do you like best about Dashly?\nWe have been using DASHLY for years and it gives us full satisfaction in collecting contacts and following up on customer requests.\nThanks to him and his mobile application, we are informed of customer requests and can respond to them as best as possible.\n\nWhat do you dislike about Dashly?\nLe produit est un peu complexe a mettre en place si on depasse les fonctions de bases.\nIl n'existe pas en francais ce qui le rend plus difficile a comprendre meme s'il est possible de traduire les messages pour les clients.\n\nWhat problems is Dashly solving and how is that benefiting you?\nDASHLY offers us a unique platform for monitoring our customers' requests. It is easily usable by our customers and brings us good contacts that we can identify.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "We have been using DASHLY for years and it gives us full satisfaction in collecting contacts and following up on customer requests.\nThanks to him and his mobile application, we are informed of customer requests and can respond to them as best as possible."}, {"question": "What do you dislike about Dashly?", "answer": "Le produit est un peu complexe a mettre en place si on depasse les fonctions de bases.\nIl n'existe pas en francais ce qui le rend plus difficile a comprendre meme s'il est possible de traduire les messages pour les clients."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "DASHLY offers us a unique platform for monitoring our customers' requests. It is easily usable by our customers and brings us good contacts that we can identify."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "fabrice h.", "reviewer_job_title": "PRESIDENT", "reviewer_link": "https://www.g2.com/users/23bdfcb2-8dd1-4ff1-b734-ed2ab143734d"}, "publish_date": "2023-02-14T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7711624"}, {"review_id": 7843680, "review_title": "Soooo Simple - The Perfect Chat??", "review_content": "What do you like best about Dashly?\nEase of setup - front and backend simple but looks great\n\nThe onichannel it provides is a huge bonus as is the mobile app which works perfectly. I had the whole thing setup within 30 mins using the wordpress plugin too.\n\nWhat do you dislike about Dashly?\nTiers & features contained / some terminology a little confusing, Better explanations of the differences between the features in the tiers and the different types of bots would have made the jump even quicker from my previous platform.\n\nWhat problems is Dashly solving and how is that benefiting you?\nEasy web chat and then the bots to acts a automated FAQ - The setup speed saved so much time and the integration is solid. The mobile app was a huge bonus as I tested thorougly before implementing live on my site and the app on iOS is impressive", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Ease of setup - front and backend simple but looks great\n\nThe onichannel it provides is a huge bonus as is the mobile app which works perfectly. I had the whole thing setup within 30 mins using the wordpress plugin too."}, {"question": "What do you dislike about Dashly?", "answer": "Tiers & features contained / some terminology a little confusing, Better explanations of the differences between the features in the tiers and the different types of bots would have made the jump even quicker from my previous platform."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Easy web chat and then the bots to acts a automated FAQ - The setup speed saved so much time and the integration is solid. The mobile app was a huge bonus as I tested thorougly before implementing live on my site and the app on iOS is impressive"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Greg M.", "reviewer_job_title": "Coach", "reviewer_link": "https://www.g2.com/users/2dcc4931-31b6-4cb3-82dd-724a8ca8a7f1"}, "publish_date": "2023-03-17T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7843680"}, {"review_id": 7761252, "review_title": "Well Rounded Email, Chat and Knowledge Base", "review_content": "What do you like best about Dashly?\nI love all in one software so that I only have to log in once and learn 1 software - with Dashly, I get emails, I get knowledge base, I get chat bot and much more!\n\nWhat do you dislike about Dashly?\nI think Dashly could improve its UX as well as how streamlined the process to making and sending emails are - I really enjoy using simple applications and it can be a bit daunting to set up intially.\n\nWhat problems is Dashly solving and how is that benefiting you?\nHelping me communicate through several different means with my customers including automated emails, automated chat messaging me, and automated knowledge base guides.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "I love all in one software so that I only have to log in once and learn 1 software - with Dashly, I get emails, I get knowledge base, I get chat bot and much more!"}, {"question": "What do you dislike about Dashly?", "answer": "I think Dashly could improve its UX as well as how streamlined the process to making and sending emails are - I really enjoy using simple applications and it can be a bit daunting to set up intially."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Helping me communicate through several different means with my customers including automated emails, automated chat messaging me, and automated knowledge base guides."}], "review_rating": 4.0, "reviewer": {"reviewer_name": "Dr. Emma S.", "reviewer_job_title": "Physical Therapist", "reviewer_link": "https://www.g2.com/users/d0a863bd-010b-43bc-bf45-575328b8f207"}, "publish_date": "2023-02-24T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7761252"}, {"review_id": 7816448, "review_title": "Good Product with Best Pricing", "review_content": "What do you like best about Dashly?\nCost effective and all in one platform that helps in keeping almost all conversations in one place even has pop-up features that are great to improve conversions\n\nWhat do you dislike about Dashly?\nStill growing and integrations can be better with time. Sometimes it is difficult to understand a few things but chat support is getting better with time.\n\nWhat problems is Dashly solving and how is that benefiting you?\nCreating automation campaigns to have automated conversations on my website with my potential customers and attendees. This is cool because it integrates with instagram.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Cost effective and all in one platform that helps in keeping almost all conversations in one place even has pop-up features that are great to improve conversions"}, {"question": "What do you dislike about Dashly?", "answer": "Still growing and integrations can be better with time. Sometimes it is difficult to understand a few things but chat support is getting better with time."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Creating automation campaigns to have automated conversations on my website with my potential customers and attendees. This is cool because it integrates with instagram."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Shubham A.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/1ff2b002-81ec-4b42-901d-6c54ba1ef831"}, "publish_date": "2023-03-09T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7816448"}, {"review_id": 7718004, "review_title": "A good product to get more contacts", "review_content": "What do you like best about Dashly?\nDASHLY est facile a utiliser et a connecter aux applications. Les informations sur les contacts sont tres utiles. le produit ne cesse d'evoluer et les options sont nombreuses.\n\nWhat do you dislike about Dashly?\nDASHLY does not exist in French for the administration of the software. On the other hand, fortunately, it is possible to translate discussions with customers into French.\n\nWhat problems is Dashly solving and how is that benefiting you?\nDASHLY helps us find new contacts who can become future customers. Tracking chats is easy so we don't lose chats and we automatically get information about our contacts.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "DASHLY est facile a utiliser et a connecter aux applications. Les informations sur les contacts sont tres utiles. le produit ne cesse d'evoluer et les options sont nombreuses."}, {"question": "What do you dislike about Dashly?", "answer": "DASHLY does not exist in French for the administration of the software. On the other hand, fortunately, it is possible to translate discussions with customers into French."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "DASHLY helps us find new contacts who can become future customers. Tracking chats is easy so we don't lose chats and we automatically get information about our contacts."}], "review_rating": 4.0, "reviewer": {"reviewer_name": "fabrice h.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/fc8f0d1c-4ceb-42e5-b4d4-0bb195558fa9"}, "publish_date": "2023-02-15T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7718004"}, {"review_id": 7701038, "review_title": "Excellent for communicating with clients.", "review_content": "What do you like best about Dashly?\nThe possibility of creating direct communication with my clients, as well as managing marketing and creating chatbots for faster communication seems fantastic to me.\n\nThe design is impressive and clean\n\nWhat do you dislike about Dashly?\nI would love to have a script that connects to the data in my SaaS system to better manage my users' subscriptions, other than that I think overall dashly is great\n\nWhat problems is Dashly solving and how is that benefiting you?\nThe main problem I had was marketing and chatbot management, with Dashly I have solved that from a simple and friendly interface", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "The possibility of creating direct communication with my clients, as well as managing marketing and creating chatbots for faster communication seems fantastic to me.\n\nThe design is impressive and clean"}, {"question": "What do you dislike about Dashly?", "answer": "I would love to have a script that connects to the data in my SaaS system to better manage my users' subscriptions, other than that I think overall dashly is great"}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "The main problem I had was marketing and chatbot management, with Dashly I have solved that from a simple and friendly interface"}], "review_rating": 4.5, "reviewer": {"reviewer_name": "Ivan d.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/dbde4c01-3660-444d-bfdf-014d97f3c211"}, "publish_date": "2023-02-10T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7701038"}], "all_reviews": [{"review_id": 7925645, "review_title": "Dashly is not just WebChat it is an entire ecosystem", "review_content": "What do you like best about Dashly?\nOut of all the chat apps available, we prefer Dashly for several reasons.\n\nFirstly, its user interface is well-designed and easy to navigate, despite having many features. This adds to the overall user experience and creates a feeling of luxury.\n\nSecondly, the app offers rich features such as social channel integration and chatbots, making it more than just a standard chat app. Additionally, Dashly has 30 native integrations and open APIs for web, IOS, and Android, providing a lot of options to extend the app's functionality.\n\nLastly, Dashly offers features such as pop-ups, triggered email messages, site visitor data tracking, knowledge base, live chat for marketing automation, and push notifications for mobile apps, going above and beyond the standard chat app.\n\nWhat do you dislike about Dashly?\nThe drawback of the app is the extensive range of possibilities it provides, which requires a considerable amount of time to fully master. Moreover, the app currently lacks integration with ChatGPT, which would be a valuable addition. It remains to be seen if this integration will be added in the future.\n\nWhat problems is Dashly solving and how is that benefiting you?\nDashly solves many problems and provides benefits for us and our clients.\n\nFor us as users, Dashly offers a clean and well-designed user interface that allows users to easily navigate through the app, despite its many features. This improves the overall user experience and gives a sense of luxury when using the app.\n\nSecondly, Dashly's rich features, such as social channel integration, chatbots, pop-ups, triggered emails, visitor data tracking, knowledge base, live chat for marketing automation and push notifications for mobile apps, go beyond a standard chat app to provide users with a variety of features in one place.\n\nWhat's more, Dashly's 30 native integrations and open APIs for web, IOS and Android give users plenty of opportunities to extend the app's functionality.\n\nFor our customers, our use of Dashly means that they have a far better experience with us and we can and do respond to customer queries quickly and without too much effort.\n\nOverall, Dashly's various features and functions benefit users by providing them with a comprehensive platform to manage their chat needs.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Out of all the chat apps available, we prefer Dashly for several reasons.\n\nFirstly, its user interface is well-designed and easy to navigate, despite having many features. This adds to the overall user experience and creates a feeling of luxury.\n\nSecondly, the app offers rich features such as social channel integration and chatbots, making it more than just a standard chat app. Additionally, Dashly has 30 native integrations and open APIs for web, IOS, and Android, providing a lot of options to extend the app's functionality.\n\nLastly, Dashly offers features such as pop-ups, triggered email messages, site visitor data tracking, knowledge base, live chat for marketing automation, and push notifications for mobile apps, going above and beyond the standard chat app."}, {"question": "What do you dislike about Dashly?", "answer": "The drawback of the app is the extensive range of possibilities it provides, which requires a considerable amount of time to fully master. Moreover, the app currently lacks integration with ChatGPT, which would be a valuable addition. It remains to be seen if this integration will be added in the future."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Dashly solves many problems and provides benefits for us and our clients.\n\nFor us as users, Dashly offers a clean and well-designed user interface that allows users to easily navigate through the app, despite its many features. This improves the overall user experience and gives a sense of luxury when using the app.\n\nSecondly, Dashly's rich features, such as social channel integration, chatbots, pop-ups, triggered emails, visitor data tracking, knowledge base, live chat for marketing automation and push notifications for mobile apps, go beyond a standard chat app to provide users with a variety of features in one place.\n\nWhat's more, Dashly's 30 native integrations and open APIs for web, IOS and Android give users plenty of opportunities to extend the app's functionality.\n\nFor our customers, our use of Dashly means that they have a far better experience with us and we can and do respond to customer queries quickly and without too much effort.\n\nOverall, Dashly's various features and functions benefit users by providing them with a comprehensive platform to manage their chat needs."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Rafal M.", "reviewer_job_title": "CEO", "reviewer_link": "https://www.g2.com/users/632b50dc-63a3-48d8-a9ad-0d566f6198e6"}, "publish_date": "2023-04-09T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7925645"}, {"review_id": 7916903, "review_title": "Fantastic Conversation And Marketing Personalization Platform", "review_content": "What do you like best about Dashly?\nI love the live chat feature and its easy integration with my website using Google Tag Manager. I got the entire platform set up on my website in less than 30 minutes, and this is my 1st time implementing live chat on my website. I'm going to do a quick rundown of the features I like best\n\n- Live Chat, customization with different colors and settings, and add-in integrations such as Whatsapp, Facebook Messenger, and Instagram. This is very important so I do not miss messages, and I have one platform to utilize for my marketing, sales, and customer support.\n\n- Triggered messages: This tool has already come in very handy. I specifically have been using the live chat-triggered feature. This allows me to send messages to nudge my website visitors to contact my business using my live chat.\n\n- Reports: It is vital to see the reports of how many people visit my website and take other specific actions. Dashly does a fantastic job here with their reports dashboard.\n\n- Chatbots: My team or myself is not always live on my website, which is why I need an automated way to continue gathering leads and resolving customer support queries while away from my business. I got to hand it to Dashly; they are a fantastic brand in this niche business.\n\nWhat do you dislike about Dashly?\nWhat I wish Dashly did was allow Workspaces to efficiently run multiple brands under the same account and differentiate the messages coming in. I only receive one snippet of code to add to my website. Unfortunately, this is not feasible since I currently have two brands and would need two accounts to keep the business separate.\n\nWhat problems is Dashly solving and how is that benefiting you?\nDashly has solved the live chat problem for me. The benefits I have realized is allowing people to interact with me in real time instead of having to send back and forth emails or get on the phone. Dashly has given me the ability to personalize to my customers so if they prefer to interact behind a screen with my brand, they now have that ability.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "I love the live chat feature and its easy integration with my website using Google Tag Manager. I got the entire platform set up on my website in less than 30 minutes, and this is my 1st time implementing live chat on my website. I'm going to do a quick rundown of the features I like best\n\n- Live Chat, customization with different colors and settings, and add-in integrations such as Whatsapp, Facebook Messenger, and Instagram. This is very important so I do not miss messages, and I have one platform to utilize for my marketing, sales, and customer support.\n\n- Triggered messages: This tool has already come in very handy. I specifically have been using the live chat-triggered feature. This allows me to send messages to nudge my website visitors to contact my business using my live chat.\n\n- Reports: It is vital to see the reports of how many people visit my website and take other specific actions. Dashly does a fantastic job here with their reports dashboard.\n\n- Chatbots: My team or myself is not always live on my website, which is why I need an automated way to continue gathering leads and resolving customer support queries while away from my business. I got to hand it to Dashly; they are a fantastic brand in this niche business."}, {"question": "What do you dislike about Dashly?", "answer": "What I wish Dashly did was allow Workspaces to efficiently run multiple brands under the same account and differentiate the messages coming in. I only receive one snippet of code to add to my website. Unfortunately, this is not feasible since I currently have two brands and would need two accounts to keep the business separate."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Dashly has solved the live chat problem for me. The benefits I have realized is allowing people to interact with me in real time instead of having to send back and forth emails or get on the phone. Dashly has given me the ability to personalize to my customers so if they prefer to interact behind a screen with my brand, they now have that ability."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Adrian B.", "reviewer_job_title": "Network Marketing", "reviewer_link": "https://www.g2.com/users/1b817b1d-c37c-421b-abdb-db2a7d1f6a0a"}, "publish_date": "2023-04-06T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7916903"}, {"review_id": 7873301, "review_title": "Great marketing suite for smaller businesses", "review_content": "What do you like best about Dashly?\nGives you a lot of useful tools, integrated together, into a single pack. Livechat and event tracking on the website (clicks and page views per individual visitor) and feeding this data into a CRM and putting it into work with marketing automation - that's pretty great!\n\nWhat do you dislike about Dashly?\nMany of the core features, including event tracking need to be improved, as they currently do get the job done somewhat, but in the case of event tracking - it's not super precise and also gives you a bunch of unncessary data (such as device, OS, etc.) while messing up with simple but important things like source page/domain.\n\nSupport is also veeeery slow (single reply takes 20-30+ minutes), though it's still better than getting replies via e-mail just once per 24h for example. Gets the job done anyways, with some patience.\n\nPricing is weird and over-complex.\n\nWhat problems is Dashly solving and how is that benefiting you?\nDashly helps me connect with the visitors of my blog and turn them into new contacts, leads and business connections. My new platform is all about building new relationships and Dashly's suite of conversational marketing tools is just what I needed.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Gives you a lot of useful tools, integrated together, into a single pack. Livechat and event tracking on the website (clicks and page views per individual visitor) and feeding this data into a CRM and putting it into work with marketing automation - that's pretty great!"}, {"question": "What do you dislike about Dashly?", "answer": "Many of the core features, including event tracking need to be improved, as they currently do get the job done somewhat, but in the case of event tracking - it's not super precise and also gives you a bunch of unncessary data (such as device, OS, etc.) while messing up with simple but important things like source page/domain.\n\nSupport is also veeeery slow (single reply takes 20-30+ minutes), though it's still better than getting replies via e-mail just once per 24h for example. Gets the job done anyways, with some patience.\n\nPricing is weird and over-complex."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Dashly helps me connect with the visitors of my blog and turn them into new contacts, leads and business connections. My new platform is all about building new relationships and Dashly's suite of conversational marketing tools is just what I needed."}], "review_rating": 4.5, "reviewer": {"reviewer_name": "Deyan K.", "reviewer_job_title": "Co-Founder", "reviewer_link": "https://www.g2.com/users/798f2682-889e-4851-bef1-10c1378457ea"}, "publish_date": "2023-04-05T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7873301"}, {"review_id": 7870734, "review_title": "Great conversational marketing platform", "review_content": "What do you like best about Dashly?\nThe conversational marketing platform comes with chatbots to provide top-notch support ( It's almost impossible for small businesses to provide 24/7 support, right? Chatbots allow support agents to get some rest!), pop-ups to grow your email list, a knowledge base, email marketing automation and more. To get you started, Dashly provides a starter guide and a playbook with leadbot templates, triggered message templates and video tutorials, as well as a knowledge base. Unlike some of its competitors, Dashly shines with its simple and clean UI.\n\nWhat do you dislike about Dashly?\nThere are just a few minor things that I think should be improved. The knowledge base design definitely needs some more love. I'm also not a big fan of the thin line icons in the backend.\n\nWhat problems is Dashly solving and how is that benefiting you?\nWe use Dashly to support existing customers and answer pre-sales questions from potential customers via live chat. Soon we will also be using pop-ups and email campaigns.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "The conversational marketing platform comes with chatbots to provide top-notch support ( It's almost impossible for small businesses to provide 24/7 support, right? Chatbots allow support agents to get some rest!), pop-ups to grow your email list, a knowledge base, email marketing automation and more. To get you started, Dashly provides a starter guide and a playbook with leadbot templates, triggered message templates and video tutorials, as well as a knowledge base. Unlike some of its competitors, Dashly shines with its simple and clean UI."}, {"question": "What do you dislike about Dashly?", "answer": "There are just a few minor things that I think should be improved. The knowledge base design definitely needs some more love. I'm also not a big fan of the thin line icons in the backend."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "We use Dashly to support existing customers and answer pre-sales questions from potential customers via live chat. Soon we will also be using pop-ups and email campaigns."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Stefan G.", "reviewer_job_title": "Operations Director", "reviewer_link": "https://www.g2.com/users/a0d9905a-98fc-414e-af60-963393afd882"}, "publish_date": "2023-03-27T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7870734"}, {"review_id": 7841905, "review_title": "Full of useful features and easy to use", "review_content": "What do you like best about Dashly?\nThe most important Dashly feature for me is the ability to use my own brand. The emails come from my own domain, there is no Dashly branding.\n\nThe best Dashly feature in my opinion is the ability to view all messages in one location and know all the necessary details about each lead. You can then follow up with each lead via email and they can see a history of their interaction/messages when they visit the website again.\n\nHaving a great-looking website is not enough, you'll need something like Dashly to perform that necessary little push to get website visitors to engage.\n\nDashly is very easy to use. They have an easy to understand articles and videos explaining how to use the features. I have used some other apps similar to Dashly in the past and felt that a technical background was needed to fully make use of each feature being offered, but Dashly is so user-friendly.\n\nWhat do you dislike about Dashly?\nI wish there was an ability to use multiple email domains. The chatbots can be used on multiple websites but I think we are only allowed to use one email domain when sending a copy of the conversation to a lead.\n\nWhat problems is Dashly solving and how is that benefiting you?\nDashly is making my website look professional and allows web visitors to engage easily.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "The most important Dashly feature for me is the ability to use my own brand. The emails come from my own domain, there is no Dashly branding.\n\nThe best Dashly feature in my opinion is the ability to view all messages in one location and know all the necessary details about each lead. You can then follow up with each lead via email and they can see a history of their interaction/messages when they visit the website again.\n\nHaving a great-looking website is not enough, you'll need something like Dashly to perform that necessary little push to get website visitors to engage.\n\nDashly is very easy to use. They have an easy to understand articles and videos explaining how to use the features. I have used some other apps similar to Dashly in the past and felt that a technical background was needed to fully make use of each feature being offered, but Dashly is so user-friendly."}, {"question": "What do you dislike about Dashly?", "answer": "I wish there was an ability to use multiple email domains. The chatbots can be used on multiple websites but I think we are only allowed to use one email domain when sending a copy of the conversation to a lead."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Dashly is making my website look professional and allows web visitors to engage easily."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Seth G.", "reviewer_job_title": "Immigration Consultant", "reviewer_link": "https://www.g2.com/users/4e874a46-f7c4-4843-b202-0b7eecb9498a"}, "publish_date": "2023-03-17T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7841905"}, {"review_id": 7820730, "review_title": "Using this to build relationships at work through fyndflow", "review_content": "What do you like best about Dashly?\nA great feature of Dashly is its ability to track customer interactions and provide detailed analytics. This allows businesses to gain insights into their customers' behavior and preferences, enabling them to make informed decisions about their marketing and customer communication strategies. With Dashly's analytics, businesses can track metrics such as chat response times, conversion rates, and customer satisfaction scores, which can be used to improve their overall customer experience.\n\nWhat do you dislike about Dashly?\nIts automation and customization features make it an excellent choice for businesses of all sizes, and its detailed analytics provide valuable insights into customer behavior. With Dashly, businesses can streamline their customer communication and provide a seamless experience for their customers.\n\nWhat problems is Dashly solving and how is that benefiting you?\nOne of the key features that sets Dashly apart from its competitors is its ability to automate customer communication. This is done through the use of chatbots, which can handle a variety of tasks such as answering frequently asked questions, booking appointments, and even processing payments. This automation feature saves businesses time and resources, allowing them to focus on other areas of their operations.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "A great feature of Dashly is its ability to track customer interactions and provide detailed analytics. This allows businesses to gain insights into their customers' behavior and preferences, enabling them to make informed decisions about their marketing and customer communication strategies. With Dashly's analytics, businesses can track metrics such as chat response times, conversion rates, and customer satisfaction scores, which can be used to improve their overall customer experience."}, {"question": "What do you dislike about Dashly?", "answer": "Its automation and customization features make it an excellent choice for businesses of all sizes, and its detailed analytics provide valuable insights into customer behavior. With Dashly, businesses can streamline their customer communication and provide a seamless experience for their customers."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "One of the key features that sets Dashly apart from its competitors is its ability to automate customer communication. This is done through the use of chatbots, which can handle a variety of tasks such as answering frequently asked questions, booking appointments, and even processing payments. This automation feature saves businesses time and resources, allowing them to focus on other areas of their operations."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Shubham A.", "reviewer_job_title": "Chief Relationship Officer", "reviewer_link": "https://www.g2.com/users/a66b689d-150e-4317-891a-9a8a1e53f449"}, "publish_date": "2023-03-10T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7820730"}, {"review_id": 7802756, "review_title": "Good app for lead generation", "review_content": "What do you like best about Dashly?\nIn Dashly, I can record a person before they have left any data and track and push each one to a sale. I can set up end-to-end integrations, gradual data enrichment, and automation. Everything that costs a lot is available to everyone on an affordable subscription.\n\nDashly already paid for itself in the first month, when it received 20% more target appointments than the previous month.\n\nWhat do you dislike about Dashly?\nThe disadvantages can be distinguished as email editor (but it seems to be treated by a new email builder).\n\nWhat problems is Dashly solving and how is that benefiting you?\nFor a year, I used Intercom, but after an hour of studying Dashly, I switched to it and called all the entrepreneurs I knew. The reasons are straightforward: Dashly is a very convenient tool for communicating with users and closes most questions related to user analytics.\n\nFirst, I installed Dashly on my site and initiated a chat with those visitors who came in for more than the first time, offering them help, asking questions like \"what are you looking for,\" and \"tell us about your needs, so we can figure out how best to help you.\" This works well, people respond, and eventually, a conversation is established, which can later transform into a trial registration and a sale.\nLater, we installed the widget in the CRM system and used it for context clues on specific product features. We also use it to send out information to users about new product features, links to surveys we conduct, and notify them about promotions.\n\nThe product, in general, is excellent, of course. We wish success to the company! I am certainly ready to recommend the product.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "In Dashly, I can record a person before they have left any data and track and push each one to a sale. I can set up end-to-end integrations, gradual data enrichment, and automation. Everything that costs a lot is available to everyone on an affordable subscription.\n\nDashly already paid for itself in the first month, when it received 20% more target appointments than the previous month."}, {"question": "What do you dislike about Dashly?", "answer": "The disadvantages can be distinguished as email editor (but it seems to be treated by a new email builder)."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "For a year, I used Intercom, but after an hour of studying Dashly, I switched to it and called all the entrepreneurs I knew. The reasons are straightforward: Dashly is a very convenient tool for communicating with users and closes most questions related to user analytics.\n\nFirst, I installed Dashly on my site and initiated a chat with those visitors who came in for more than the first time, offering them help, asking questions like \"what are you looking for,\" and \"tell us about your needs, so we can figure out how best to help you.\" This works well, people respond, and eventually, a conversation is established, which can later transform into a trial registration and a sale.\nLater, we installed the widget in the CRM system and used it for context clues on specific product features. We also use it to send out information to users about new product features, links to surveys we conduct, and notify them about promotions.\n\nThe product, in general, is excellent, of course. We wish success to the company! I am certainly ready to recommend the product."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Jana V.", "reviewer_job_title": "E-Learning", "reviewer_link": "https://www.g2.com/users/janatoys"}, "publish_date": "2023-03-10T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7802756"}, {"review_id": 7809449, "review_title": "Dashly is full of helpful features", "review_content": "What do you like best about Dashly?\nI love that Dashly has all the tools I need in one roof. I can use Live Chat, Chatbot, Knowledge base, Unified inbox for all communication channels.\n\nI also like that Dashly has a neat UI. While having many features, the UI is very clean and it makes it super easy for me to just navigate around.\n\nThe UX is also quite good. It takes me step by step toward the goal. For example, the Chatbot has a Typeform form to give me available options for each step to create the chat bot. It is easy and convenient for the first step. Then Dashly presented a full \"picture\" of the chatbot that I can create.\n\nI think the integrations can also be a plus for Dashly. They have native integrations with all popular communication channels, including Messenger, Viber, Instagram, Whatsapp, Telegram etc.\n\nWhat do you dislike about Dashly?\nWhile integrations to all popular channels are available, I would expect to have more native integrations, for example to more CRM / e-mail automation platforms. There seem to be available integration for that type but with limited information.\n\nI also hope that there will be more available templates, for example for the chatbot. That would make Dashly even more helpful.\n\nWhat problems is Dashly solving and how is that benefiting you?\nDashly is a great tool that combines various tools together in a nicely looking interface and dashboard. From Dashly, I can easily set up communication channels with clients in all platforms via live chat, chat bots, with detailed reporting and analytics. I can also combine and see all of those communication in one unified inbox - saving great time to go back and forth between different systems.\n\nAll in all, I think Dashly is a wonderful solution and help me to save significant time and complication in communicating with clients.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "I love that Dashly has all the tools I need in one roof. I can use Live Chat, Chatbot, Knowledge base, Unified inbox for all communication channels.\n\nI also like that Dashly has a neat UI. While having many features, the UI is very clean and it makes it super easy for me to just navigate around.\n\nThe UX is also quite good. It takes me step by step toward the goal. For example, the Chatbot has a Typeform form to give me available options for each step to create the chat bot. It is easy and convenient for the first step. Then Dashly presented a full \"picture\" of the chatbot that I can create.\n\nI think the integrations can also be a plus for Dashly. They have native integrations with all popular communication channels, including Messenger, Viber, Instagram, Whatsapp, Telegram etc."}, {"question": "What do you dislike about Dashly?", "answer": "While integrations to all popular channels are available, I would expect to have more native integrations, for example to more CRM / e-mail automation platforms. There seem to be available integration for that type but with limited information.\n\nI also hope that there will be more available templates, for example for the chatbot. That would make Dashly even more helpful."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Dashly is a great tool that combines various tools together in a nicely looking interface and dashboard. From Dashly, I can easily set up communication channels with clients in all platforms via live chat, chat bots, with detailed reporting and analytics. I can also combine and see all of those communication in one unified inbox - saving great time to go back and forth between different systems.\n\nAll in all, I think Dashly is a wonderful solution and help me to save significant time and complication in communicating with clients."}], "review_rating": 4.5, "reviewer": {"reviewer_name": "Hoang P.", "reviewer_job_title": "Director", "reviewer_link": "https://www.g2.com/users/86eb6672-4de6-4b99-9368-1209128cc02d"}, "publish_date": "2023-03-08T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7809449"}, {"review_id": 7690660, "review_title": "Sociamonials has used Dashly for live chat, customer support ticketing, email onboarding, and popups", "review_content": "What do you like best about Dashly?\nEverything is very well integrated into one tool. We used to have a live chat tool, ticketing tool, knowledgebase tool, onboarding tool, etc. and now we do it all in one place. Collaboration with team members is super easy too so my staff loves it. We use the API to integrate with our SaaS tool, so it feels like it was built just for our needs, love it.\n\nWhat do you dislike about Dashly?\nThere have been times when we need help, and while their staff is extremely helpful, there are chunks of time when their staff isn't on duty because it is off hours for them. We are in USA, so our hours don't sync up as well as we would like. We've learned to work around their hours though.\n\nWhat problems is Dashly solving and how is that benefiting you?\nWe offer a white-label social media software with many different client types. Some are using our tool for their own company. Some are reselling our tool as if it were their own (white label). This requires a deep API integration to segment the users who are using live chat so we don't reply as Sociamonials to a white-label client. We also cannot trigger popups for subusers, only Account Owners, this is simple in Dashly because of the advanced segmentation capabilities. They've really thought it through, so we have complete control. Even our onboarding email sequences are customized based on client type/user type.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Everything is very well integrated into one tool. We used to have a live chat tool, ticketing tool, knowledgebase tool, onboarding tool, etc. and now we do it all in one place. Collaboration with team members is super easy too so my staff loves it. We use the API to integrate with our SaaS tool, so it feels like it was built just for our needs, love it."}, {"question": "What do you dislike about Dashly?", "answer": "There have been times when we need help, and while their staff is extremely helpful, there are chunks of time when their staff isn't on duty because it is off hours for them. We are in USA, so our hours don't sync up as well as we would like. We've learned to work around their hours though."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "We offer a white-label social media software with many different client types. Some are using our tool for their own company. Some are reselling our tool as if it were their own (white label). This requires a deep API integration to segment the users who are using live chat so we don't reply as Sociamonials to a white-label client. We also cannot trigger popups for subusers, only Account Owners, this is simple in Dashly because of the advanced segmentation capabilities. They've really thought it through, so we have complete control. Even our onboarding email sequences are customized based on client type/user type."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Craig S.", "reviewer_job_title": "Chief Executive Officer", "reviewer_link": "https://www.g2.com/users/862fc3dc-c4b9-4507-b5f6-61b0a4778875"}, "publish_date": "2023-02-08T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7690660"}, {"review_id": 7721758, "review_title": "Dashly = good response time to customers", "review_content": "What do you like best about Dashly?\nDashly helps our company to link up with customers quickly and easily via live chat, and it's been a fantastic tool. Setting it up was a breeze, and the interface is user-friendly, making it easy for our team to provide personalized support and exceptional customer service. What's more, the chat platform has an impressive set of features, including automated messaging, segmentation, and analytics. All in all, we believe that Dashly is an exceptional product that delivers excellent value for the investment.\n\nWhat do you dislike about Dashly?\nIn my experience, I have not come across any downsides when using this software. It is incredibly easy to access and use, making it a seamless process from start to finish.\n\nWhat problems is Dashly solving and how is that benefiting you?\nDashly helps to streamline and organize the process of communicating with customers. Its efficient live chat system enables quick problem-solving, allowing website visitors to clarify any details they need and move on. In addition, Dashly collects valuable data such as the user's location, OS and web browser version, and email. This information helps our team to better understand and serve our customers, leading to improved customer satisfaction and loyalty.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Dashly helps our company to link up with customers quickly and easily via live chat, and it's been a fantastic tool. Setting it up was a breeze, and the interface is user-friendly, making it easy for our team to provide personalized support and exceptional customer service. What's more, the chat platform has an impressive set of features, including automated messaging, segmentation, and analytics. All in all, we believe that Dashly is an exceptional product that delivers excellent value for the investment."}, {"question": "What do you dislike about Dashly?", "answer": "In my experience, I have not come across any downsides when using this software. It is incredibly easy to access and use, making it a seamless process from start to finish."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Dashly helps to streamline and organize the process of communicating with customers. Its efficient live chat system enables quick problem-solving, allowing website visitors to clarify any details they need and move on. In addition, Dashly collects valuable data such as the user's location, OS and web browser version, and email. This information helps our team to better understand and serve our customers, leading to improved customer satisfaction and loyalty."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Amit B.", "reviewer_job_title": "CEO", "reviewer_link": "https://www.g2.com/users/41f74c47-2653-4da4-9fd4-ee988fe0629b"}, "publish_date": "2023-02-16T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7721758"}, {"review_id": 7731658, "review_title": "Awesome Software", "review_content": "What do you like best about Dashly?\nDashly keeps track of all conversations in one place. It makes it easier for the team to work on tasks together. I can see the performance of our marketing activities in real time.\n\nDashly is a way to get more leads and make more sales. It's a solution that enables you to track and engage your visitors directly on your website, Facebook, and other social media. It's a great way to get leads and engage with them right on your website.\n\nWe've been looking for a good customer support platform and one that can help us manage our social media accounts. we've tried it out and we're very pleased with the results. it's good to see that they have a good support team. So far, so good.\n\nWhat do you dislike about Dashly?\nDashly's branding all over the software...\n\nWhat problems is Dashly solving and how is that benefiting you?\nlead gen and convertion", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Dashly keeps track of all conversations in one place. It makes it easier for the team to work on tasks together. I can see the performance of our marketing activities in real time.\n\nDashly is a way to get more leads and make more sales. It's a solution that enables you to track and engage your visitors directly on your website, Facebook, and other social media. It's a great way to get leads and engage with them right on your website.\n\nWe've been looking for a good customer support platform and one that can help us manage our social media accounts. we've tried it out and we're very pleased with the results. it's good to see that they have a good support team. So far, so good."}, {"question": "What do you dislike about Dashly?", "answer": "Dashly's branding all over the software..."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "lead gen and convertion"}], "review_rating": 4.5, "reviewer": {"reviewer_name": "Prins A.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/9385bd72-292f-49cf-a124-9f7fd94269d7"}, "publish_date": "2023-02-17T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7731658"}, {"review_id": 7916829, "review_title": "All in once package", "review_content": "What do you like best about Dashly?\nDashly has so many features, and functionalities, all in a single tool. You can live chat, collect leads, add triggers, and run campaigns all from a single tool. This could be very useful as well as time saving.\n\nWhat do you dislike about Dashly?\nWell the add-ons. Even after purchasing the packages, you need to get the add-ons as well to make it complete. These should already be included in the package.\n\nWhat problems is Dashly solving and how is that benefiting you?\nWell, it solves many problems by getting multiple features in a single tool. This could save a lot of time as well as easy to manage and run campaigns. Live chat can maintain a history as well as the tagging feature is really good.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Dashly has so many features, and functionalities, all in a single tool. You can live chat, collect leads, add triggers, and run campaigns all from a single tool. This could be very useful as well as time saving."}, {"question": "What do you dislike about Dashly?", "answer": "Well the add-ons. Even after purchasing the packages, you need to get the add-ons as well to make it complete. These should already be included in the package."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Well, it solves many problems by getting multiple features in a single tool. This could save a lot of time as well as easy to manage and run campaigns. Live chat can maintain a history as well as the tagging feature is really good."}], "review_rating": 4.0, "reviewer": {"reviewer_name": "Ali H.", "reviewer_job_title": "CEO", "reviewer_link": "https://www.g2.com/users/27653dc0-942b-40f6-ac19-ef07785e80ca"}, "publish_date": "2023-04-06T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7916829"}, {"review_id": 7887511, "review_title": "A Versatile Marketing Automation Tool for Small Businesses", "review_content": "What do you like best about Dashly?\nAs a small business owner, I sought a marketing automation tool to help me save time and streamline my marketing efforts. That's when I discovered Dashly.io, and I have been using it for several months now with excellent results.\n\nWhat I love about Dashly.io is how versatile it is. The platform offers a wide range of features that make it easy to create and manage email campaigns, track user behavior, and engage with customers. The automation features are compelling, allowing me to set up complex workflows and sequences of emails that have helped me improve my conversion rates.\n\nI also appreciate how user-friendly Dashly.io is. The platform's intuitive user interface makes navigating and accessing all the features easy, and the customer support team has been very responsive and helpful.\n\nAnother feature that sets Dashly.io apart is its ability to integrate seamlessly with other tools and platforms. The platform integrates with popular tools such as Google Analytics, Slack, and Salesforce, making sharing data easy and streamlining my workflow.\n\nWhat do you dislike about Dashly?\nWhile Dashly.io offers an impressive range of features, some users may initially find the platform's user interface a bit overwhelming. With so many options available, learning how to navigate and use everything effectively can take some time. However, once you become familiar with the platform's layout and features, it becomes much easier to use and highly intuitive.\n\nWhat problems is Dashly solving and how is that benefiting you?\nDashly.io is solving my marketing automation needs by providing a comprehensive suite of tools that make engaging with my customers, generating leads, and increasing conversions easy. As a busy business owner, I often struggle with finding ways to streamline my marketing efforts and connect with my customers effectively. Dashly.io has been a game-changer for me, as it offers powerful automation features that allow me to create and manage email campaigns, track user behavior, and personalize the customer experience. With its seamless integrations with other tools and platforms, Dashly.io has helped me save time, increase efficiency, and improve my overall campaign performance. Thanks to Dashly.io, I can focus on running my business and let the platform take care of my marketing needs, resulting in better customer engagement and higher revenue.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "As a small business owner, I sought a marketing automation tool to help me save time and streamline my marketing efforts. That's when I discovered Dashly.io, and I have been using it for several months now with excellent results.\n\nWhat I love about Dashly.io is how versatile it is. The platform offers a wide range of features that make it easy to create and manage email campaigns, track user behavior, and engage with customers. The automation features are compelling, allowing me to set up complex workflows and sequences of emails that have helped me improve my conversion rates.\n\nI also appreciate how user-friendly Dashly.io is. The platform's intuitive user interface makes navigating and accessing all the features easy, and the customer support team has been very responsive and helpful.\n\nAnother feature that sets Dashly.io apart is its ability to integrate seamlessly with other tools and platforms. The platform integrates with popular tools such as Google Analytics, Slack, and Salesforce, making sharing data easy and streamlining my workflow."}, {"question": "What do you dislike about Dashly?", "answer": "While Dashly.io offers an impressive range of features, some users may initially find the platform's user interface a bit overwhelming. With so many options available, learning how to navigate and use everything effectively can take some time. However, once you become familiar with the platform's layout and features, it becomes much easier to use and highly intuitive."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Dashly.io is solving my marketing automation needs by providing a comprehensive suite of tools that make engaging with my customers, generating leads, and increasing conversions easy. As a busy business owner, I often struggle with finding ways to streamline my marketing efforts and connect with my customers effectively. Dashly.io has been a game-changer for me, as it offers powerful automation features that allow me to create and manage email campaigns, track user behavior, and personalize the customer experience. With its seamless integrations with other tools and platforms, Dashly.io has helped me save time, increase efficiency, and improve my overall campaign performance. Thanks to Dashly.io, I can focus on running my business and let the platform take care of my marketing needs, resulting in better customer engagement and higher revenue."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2023-03-30T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7887511"}, {"review_id": 7801653, "review_title": "Very easy to use", "review_content": "What do you like best about Dashly?\nI'm not a software/web guy by trade I am in fact, a self-employed landscaper. This has been one of the easiest web tools I've ever used! Having so many included features meant less need for 3rd party integrations which was one of the greatest headaches I suffered trying to figure out all this web stuff. Not to mention when integration is needed it's fairly easy to do.\n\nI highly recommend this product to any of the 1-2 man operations out there!\n\nWhat do you dislike about Dashly?\nI have not yet run into any issues with Dashly.\n\nWhat problems is Dashly solving and how is that benefiting you?\nThe ease of use and built-in features eliminate the need to integrate with other tools. Having an all-in-one platform saves me a lot of time I can divert to other matters", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "I'm not a software/web guy by trade I am in fact, a self-employed landscaper. This has been one of the easiest web tools I've ever used! Having so many included features meant less need for 3rd party integrations which was one of the greatest headaches I suffered trying to figure out all this web stuff. Not to mention when integration is needed it's fairly easy to do.\n\nI highly recommend this product to any of the 1-2 man operations out there!"}, {"question": "What do you dislike about Dashly?", "answer": "I have not yet run into any issues with Dashly."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "The ease of use and built-in features eliminate the need to integrate with other tools. Having an all-in-one platform saves me a lot of time I can divert to other matters"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Joshua W.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/5d5ae4db-3e7a-4166-9f71-32d46c5eb32c"}, "publish_date": "2023-03-06T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7801653"}, {"review_id": 7735779, "review_title": "Dashly is a winner in lead generation", "review_content": "What do you like best about Dashly?\nI like the fact that I can just create a simple lead bot in 10 mins and start gathering leads. The conversational way of working is just miles ahead of a solo popup. Also, their support is great, it's just from another level in comparison to many many many competitors i used before.\n\nWhat do you dislike about Dashly?\nA small downside of Dashly is maybe that it doesn't have a custom css function to fully customize the widget, however, it's only a small remark on top of a great tool.\n\nWhat problems is Dashly solving and how is that benefiting you?\nLead generation in a conversational way. Thanks to that, i can easily uplift my conversion rates in comparison to a popup. Having the ability to add in a livechat is even better, however, i don't have the capacity to use it right now.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "I like the fact that I can just create a simple lead bot in 10 mins and start gathering leads. The conversational way of working is just miles ahead of a solo popup. Also, their support is great, it's just from another level in comparison to many many many competitors i used before."}, {"question": "What do you dislike about Dashly?", "answer": "A small downside of Dashly is maybe that it doesn't have a custom css function to fully customize the widget, however, it's only a small remark on top of a great tool."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Lead generation in a conversational way. Thanks to that, i can easily uplift my conversion rates in comparison to a popup. Having the ability to add in a livechat is even better, however, i don't have the capacity to use it right now."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Matthias B.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/78ff8f53-7623-48e9-b67a-a3a0893a4bb1"}, "publish_date": "2023-02-20T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7735779"}, {"review_id": 7707924, "review_title": "Easy to install and use Chat and Bot widget", "review_content": "What do you like best about Dashly?\nThis was very easy to setup and apply our branding. I did not have to spend a huge amount of time to get the basics working. We are now rolling out the knowledge base and chat bots. This was a great find as cheaper and more functional than the chat service we used previously. The support was fast and helpful when we did need them. Recommended.\n\nWhat do you dislike about Dashly?\nInitial concerns of multi domains. But the support team sorted this quickly.\nIntegrating the knowledge base for self service in the chat widget would be a great enhancement.\n\nWhat problems is Dashly solving and how is that benefiting you?\nWe are giving our site visitors just enough support without being intrusive. The interface is a lot more fun for end users than our previous tools.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "This was very easy to setup and apply our branding. I did not have to spend a huge amount of time to get the basics working. We are now rolling out the knowledge base and chat bots. This was a great find as cheaper and more functional than the chat service we used previously. The support was fast and helpful when we did need them. Recommended."}, {"question": "What do you dislike about Dashly?", "answer": "Initial concerns of multi domains. But the support team sorted this quickly.\nIntegrating the knowledge base for self service in the chat widget would be a great enhancement."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "We are giving our site visitors just enough support without being intrusive. The interface is a lot more fun for end users than our previous tools."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Christian M.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/88c62d2c-982c-4c4d-8684-319b9328f743"}, "publish_date": "2023-02-13T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7707924"}, {"review_id": 7705270, "review_title": "A chat software that even a child can configure", "review_content": "What do you like best about Dashly?\nDashly is a tool where you can set up your live chat in a few minutes. The level of customization that your widget has is incredible. Best of all, you can generate a chat and you can embed it in various wordpress websites using its official plugin, where you just put the subscription keys and that's it.\n\nI use the android application and it is extremely fast, in real time I can see my potential customers online and know where they come from or what section they are in.\n\nWhat do you dislike about Dashly?\nIt could improve the translation of some buttons because the Spanish translation is not literal, but nothing that cannot be understood.\n\nWhat problems is Dashly solving and how is that benefiting you?\nImmediate attention to potential customers, worth what it costs", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Dashly is a tool where you can set up your live chat in a few minutes. The level of customization that your widget has is incredible. Best of all, you can generate a chat and you can embed it in various wordpress websites using its official plugin, where you just put the subscription keys and that's it.\n\nI use the android application and it is extremely fast, in real time I can see my potential customers online and know where they come from or what section they are in."}, {"question": "What do you dislike about Dashly?", "answer": "It could improve the translation of some buttons because the Spanish translation is not literal, but nothing that cannot be understood."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Immediate attention to potential customers, worth what it costs"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Oscar R.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/258d21ae-60a5-4f1d-af37-8475b0e130f8"}, "publish_date": "2023-02-13T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7705270"}, {"review_id": 7902154, "review_title": "complete solution for customer support and lead generation", "review_content": "What do you like best about Dashly?\nwe just switched to Dashly and we were very happy with all the functionalities Dashly offers, live chat, chatbot, knowledge base. also the fact that we can use our own branding and emails are sent through our own domain. it's fantastic how easy it is to set up!\n\nWhat do you dislike about Dashly?\nemail layout can be improved but it's already fixed with the new email builder\n\nWhat problems is Dashly solving and how is that benefiting you?\nDashly helped us follow up with leads who interacted with us via our website, using emails and integrations, we were able to recover leads and convert more visitors", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "we just switched to Dashly and we were very happy with all the functionalities Dashly offers, live chat, chatbot, knowledge base. also the fact that we can use our own branding and emails are sent through our own domain. it's fantastic how easy it is to set up!"}, {"question": "What do you dislike about Dashly?", "answer": "email layout can be improved but it's already fixed with the new email builder"}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Dashly helped us follow up with leads who interacted with us via our website, using emails and integrations, we were able to recover leads and convert more visitors"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "hafedh K.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/cf8db246-461d-4043-82dc-38eec21383fb"}, "publish_date": "2023-04-03T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7902154"}, {"review_id": 7919347, "review_title": "Pleasant experience!", "review_content": "What do you like best about Dashly?\nGreat UI, one of the best out there you can find! When using it, everything is just visually appealing!\nEasy to use, everything is just so intuitive.\nGreat functionality! Chatbot, Live chat, Popup, Triggered message, all in one and all easy to set up!\nGood numbers of integrations, connect to marketing stack with ease!\nOverall I am very happy with Dashly!\n\nWhat do you dislike about Dashly?\nPrice, definitely not the cheapest you will find.\nNon-multiligual. this is something the team must add, otherwise competitors will win.\nSomewhat confusing price structure, modules pricing are a bit of pain to work with.\n\nWhat problems is Dashly solving and how is that benefiting you?\nDashly helps me generate leads, qualify them, all automatically while I am away or asleep! Saved me couple hundred dollars per month since I switched from other insanely overpriced chat app.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Great UI, one of the best out there you can find! When using it, everything is just visually appealing!\nEasy to use, everything is just so intuitive.\nGreat functionality! Chatbot, Live chat, Popup, Triggered message, all in one and all easy to set up!\nGood numbers of integrations, connect to marketing stack with ease!\nOverall I am very happy with Dashly!"}, {"question": "What do you dislike about Dashly?", "answer": "Price, definitely not the cheapest you will find.\nNon-multiligual. this is something the team must add, otherwise competitors will win.\nSomewhat confusing price structure, modules pricing are a bit of pain to work with."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Dashly helps me generate leads, qualify them, all automatically while I am away or asleep! Saved me couple hundred dollars per month since I switched from other insanely overpriced chat app."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2023-04-06T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7919347"}, {"review_id": 7711624, "review_title": "A very useful marketing tool", "review_content": "What do you like best about Dashly?\nWe have been using DASHLY for years and it gives us full satisfaction in collecting contacts and following up on customer requests.\nThanks to him and his mobile application, we are informed of customer requests and can respond to them as best as possible.\n\nWhat do you dislike about Dashly?\nLe produit est un peu complexe a mettre en place si on depasse les fonctions de bases.\nIl n'existe pas en francais ce qui le rend plus difficile a comprendre meme s'il est possible de traduire les messages pour les clients.\n\nWhat problems is Dashly solving and how is that benefiting you?\nDASHLY offers us a unique platform for monitoring our customers' requests. It is easily usable by our customers and brings us good contacts that we can identify.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "We have been using DASHLY for years and it gives us full satisfaction in collecting contacts and following up on customer requests.\nThanks to him and his mobile application, we are informed of customer requests and can respond to them as best as possible."}, {"question": "What do you dislike about Dashly?", "answer": "Le produit est un peu complexe a mettre en place si on depasse les fonctions de bases.\nIl n'existe pas en francais ce qui le rend plus difficile a comprendre meme s'il est possible de traduire les messages pour les clients."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "DASHLY offers us a unique platform for monitoring our customers' requests. It is easily usable by our customers and brings us good contacts that we can identify."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "fabrice h.", "reviewer_job_title": "PRESIDENT", "reviewer_link": "https://www.g2.com/users/23bdfcb2-8dd1-4ff1-b734-ed2ab143734d"}, "publish_date": "2023-02-14T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7711624"}, {"review_id": 7843680, "review_title": "Soooo Simple - The Perfect Chat??", "review_content": "What do you like best about Dashly?\nEase of setup - front and backend simple but looks great\n\nThe onichannel it provides is a huge bonus as is the mobile app which works perfectly. I had the whole thing setup within 30 mins using the wordpress plugin too.\n\nWhat do you dislike about Dashly?\nTiers & features contained / some terminology a little confusing, Better explanations of the differences between the features in the tiers and the different types of bots would have made the jump even quicker from my previous platform.\n\nWhat problems is Dashly solving and how is that benefiting you?\nEasy web chat and then the bots to acts a automated FAQ - The setup speed saved so much time and the integration is solid. The mobile app was a huge bonus as I tested thorougly before implementing live on my site and the app on iOS is impressive", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Ease of setup - front and backend simple but looks great\n\nThe onichannel it provides is a huge bonus as is the mobile app which works perfectly. I had the whole thing setup within 30 mins using the wordpress plugin too."}, {"question": "What do you dislike about Dashly?", "answer": "Tiers & features contained / some terminology a little confusing, Better explanations of the differences between the features in the tiers and the different types of bots would have made the jump even quicker from my previous platform."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Easy web chat and then the bots to acts a automated FAQ - The setup speed saved so much time and the integration is solid. The mobile app was a huge bonus as I tested thorougly before implementing live on my site and the app on iOS is impressive"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Greg M.", "reviewer_job_title": "Coach", "reviewer_link": "https://www.g2.com/users/2dcc4931-31b6-4cb3-82dd-724a8ca8a7f1"}, "publish_date": "2023-03-17T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7843680"}, {"review_id": 7761252, "review_title": "Well Rounded Email, Chat and Knowledge Base", "review_content": "What do you like best about Dashly?\nI love all in one software so that I only have to log in once and learn 1 software - with Dashly, I get emails, I get knowledge base, I get chat bot and much more!\n\nWhat do you dislike about Dashly?\nI think Dashly could improve its UX as well as how streamlined the process to making and sending emails are - I really enjoy using simple applications and it can be a bit daunting to set up intially.\n\nWhat problems is Dashly solving and how is that benefiting you?\nHelping me communicate through several different means with my customers including automated emails, automated chat messaging me, and automated knowledge base guides.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "I love all in one software so that I only have to log in once and learn 1 software - with Dashly, I get emails, I get knowledge base, I get chat bot and much more!"}, {"question": "What do you dislike about Dashly?", "answer": "I think Dashly could improve its UX as well as how streamlined the process to making and sending emails are - I really enjoy using simple applications and it can be a bit daunting to set up intially."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Helping me communicate through several different means with my customers including automated emails, automated chat messaging me, and automated knowledge base guides."}], "review_rating": 4.0, "reviewer": {"reviewer_name": "Dr. Emma S.", "reviewer_job_title": "Physical Therapist", "reviewer_link": "https://www.g2.com/users/d0a863bd-010b-43bc-bf45-575328b8f207"}, "publish_date": "2023-02-24T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7761252"}, {"review_id": 7816448, "review_title": "Good Product with Best Pricing", "review_content": "What do you like best about Dashly?\nCost effective and all in one platform that helps in keeping almost all conversations in one place even has pop-up features that are great to improve conversions\n\nWhat do you dislike about Dashly?\nStill growing and integrations can be better with time. Sometimes it is difficult to understand a few things but chat support is getting better with time.\n\nWhat problems is Dashly solving and how is that benefiting you?\nCreating automation campaigns to have automated conversations on my website with my potential customers and attendees. This is cool because it integrates with instagram.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Cost effective and all in one platform that helps in keeping almost all conversations in one place even has pop-up features that are great to improve conversions"}, {"question": "What do you dislike about Dashly?", "answer": "Still growing and integrations can be better with time. Sometimes it is difficult to understand a few things but chat support is getting better with time."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Creating automation campaigns to have automated conversations on my website with my potential customers and attendees. This is cool because it integrates with instagram."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Shubham A.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/1ff2b002-81ec-4b42-901d-6c54ba1ef831"}, "publish_date": "2023-03-09T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7816448"}, {"review_id": 7718004, "review_title": "A good product to get more contacts", "review_content": "What do you like best about Dashly?\nDASHLY est facile a utiliser et a connecter aux applications. Les informations sur les contacts sont tres utiles. le produit ne cesse d'evoluer et les options sont nombreuses.\n\nWhat do you dislike about Dashly?\nDASHLY does not exist in French for the administration of the software. On the other hand, fortunately, it is possible to translate discussions with customers into French.\n\nWhat problems is Dashly solving and how is that benefiting you?\nDASHLY helps us find new contacts who can become future customers. Tracking chats is easy so we don't lose chats and we automatically get information about our contacts.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "DASHLY est facile a utiliser et a connecter aux applications. Les informations sur les contacts sont tres utiles. le produit ne cesse d'evoluer et les options sont nombreuses."}, {"question": "What do you dislike about Dashly?", "answer": "DASHLY does not exist in French for the administration of the software. On the other hand, fortunately, it is possible to translate discussions with customers into French."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "DASHLY helps us find new contacts who can become future customers. Tracking chats is easy so we don't lose chats and we automatically get information about our contacts."}], "review_rating": 4.0, "reviewer": {"reviewer_name": "fabrice h.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/fc8f0d1c-4ceb-42e5-b4d4-0bb195558fa9"}, "publish_date": "2023-02-15T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7718004"}, {"review_id": 7701038, "review_title": "Excellent for communicating with clients.", "review_content": "What do you like best about Dashly?\nThe possibility of creating direct communication with my clients, as well as managing marketing and creating chatbots for faster communication seems fantastic to me.\n\nThe design is impressive and clean\n\nWhat do you dislike about Dashly?\nI would love to have a script that connects to the data in my SaaS system to better manage my users' subscriptions, other than that I think overall dashly is great\n\nWhat problems is Dashly solving and how is that benefiting you?\nThe main problem I had was marketing and chatbot management, with Dashly I have solved that from a simple and friendly interface", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "The possibility of creating direct communication with my clients, as well as managing marketing and creating chatbots for faster communication seems fantastic to me.\n\nThe design is impressive and clean"}, {"question": "What do you dislike about Dashly?", "answer": "I would love to have a script that connects to the data in my SaaS system to better manage my users' subscriptions, other than that I think overall dashly is great"}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "The main problem I had was marketing and chatbot management, with Dashly I have solved that from a simple and friendly interface"}], "review_rating": 4.5, "reviewer": {"reviewer_name": "Ivan d.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/dbde4c01-3660-444d-bfdf-014d97f3c211"}, "publish_date": "2023-02-10T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7701038"}, {"review_id": 7770198, "review_title": "Premium features at a reasonable price", "review_content": "What do you like best about Dashly?\n- The connection between features is smooth.\n-The connection between knowledge base and bot is very effective, saving me time and money at a reasonable price.\n\nWhat do you dislike about Dashly?\n- I don't like orange and the logo\n- If there is anything I will respond to now, not yet\n\nWhat problems is Dashly solving and how is that benefiting you?\nRespond to customer questions via bots that connect to the knowledge base.\n- Customer journey in the web\n- Manage customer details\n- Building marketing campaigns\n- Automation", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "- The connection between features is smooth.\n-The connection between knowledge base and bot is very effective, saving me time and money at a reasonable price."}, {"question": "What do you dislike about Dashly?", "answer": "- I don't like orange and the logo\n- If there is anything I will respond to now, not yet"}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Respond to customer questions via bots that connect to the knowledge base.\n- Customer journey in the web\n- Manage customer details\n- Building marketing campaigns\n- Automation"}], "review_rating": 4.5, "reviewer": {"reviewer_name": "Truong N.", "reviewer_job_title": "Store Owner", "reviewer_link": "https://www.g2.com/users/a3e04d10-b548-4b00-acd6-c2dc6fac2347"}, "publish_date": "2023-02-27T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7770198"}, {"review_id": 7734043, "review_title": "Smooth live chat software with a lot of features", "review_content": "What do you like best about Dashly?\nI really like the ease of use, as well as the variety of settings options. The design is very responsive and therefore also efficient to use.\n\nWhat do you dislike about Dashly?\nIn my opinion, pricing can be a bit complicated at first glance. Furthermore, some features are behind a paywall as an addon.\n\nWhat problems is Dashly solving and how is that benefiting you?\nDashly is used to handle and respond to user requests. Chatbots make it easier for customers to find the right contact person and provide all the details in advance.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "I really like the ease of use, as well as the variety of settings options. The design is very responsive and therefore also efficient to use."}, {"question": "What do you dislike about Dashly?", "answer": "In my opinion, pricing can be a bit complicated at first glance. Furthermore, some features are behind a paywall as an addon."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Dashly is used to handle and respond to user requests. Chatbots make it easier for customers to find the right contact person and provide all the details in advance."}], "review_rating": 4.0, "reviewer": {"reviewer_name": "Giulio N.", "reviewer_job_title": "Owner", "reviewer_link": "https://www.g2.com/users/fa8098af-c8f7-4fdb-9754-6bbba2779c29"}, "publish_date": "2023-02-19T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7734043"}, {"review_id": 7762867, "review_title": "I would like to warn potential buyers of Dashly about their misleading practices!", "review_content": "What do you like best about Dashly?\nWe liked the convenience of the bot-building process the most.\n\nWhat do you dislike about Dashly?\nNot only that the bots not support certain basic features (like bot reset, or calling the customer by name when provided and I found around 10 more), but all bots must have the same name and avatar, making them non-functional for different purposes and sites.\n\nWhat problems is Dashly solving and how is that benefiting you?\nEasy chat bot building process.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "We liked the convenience of the bot-building process the most."}, {"question": "What do you dislike about Dashly?", "answer": "Not only that the bots not support certain basic features (like bot reset, or calling the customer by name when provided and I found around 10 more), but all bots must have the same name and avatar, making them non-functional for different purposes and sites."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Easy chat bot building process."}], "review_rating": 1.0, "reviewer": {"reviewer_name": "Ilia A.", "reviewer_job_title": "Marketing and Advertising", "reviewer_link": "https://www.g2.com/users/e4739787-3275-4a85-acec-89bf7b42549d"}, "publish_date": "2023-03-18T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7762867"}, {"review_id": 7921114, "review_title": "Just replaced Intercom", "review_content": "What do you like best about Dashly?\nThey have all the best features as other competitors and their pricing is super competitive!\n\nWhat do you dislike about Dashly?\nI wish I had found out about them earlier. They may be \"early\" in that they're not your top ranked chatbot site but I think they'll get ther.\n\nWhat problems is Dashly solving and how is that benefiting you?\nWe are scaling our business and need the support that is more automative. The chatbots help which is a feature I didn't have with Intercom. I also love the marketing automation as I couldn't afford most competitors but their pricing is fair.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "They have all the best features as other competitors and their pricing is super competitive!"}, {"question": "What do you dislike about Dashly?", "answer": "I wish I had found out about them earlier. They may be \"early\" in that they're not your top ranked chatbot site but I think they'll get ther."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "We are scaling our business and need the support that is more automative. The chatbots help which is a feature I didn't have with Intercom. I also love the marketing automation as I couldn't afford most competitors but their pricing is fair."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Vi F.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/26628c43-766a-4960-988f-131be5a4f449"}, "publish_date": "2023-04-08T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7921114"}, {"review_id": 7425130, "review_title": "Dashly is a great all-in-one conversational marketing tool", "review_content": "What do you like best about Dashly?\nWe set up Dashly on our site and got a new channel for our sales managers to generate leads for our company. I like that it was easy to implement Dashly codes to the site and that we have an all-in-one solution to communicate with our site visitors via online chat, pop-ups and chatbots.\n\nWhat do you dislike about Dashly?\nSometimes I can not find additional info in the knowledge base or samples of pop-ups tailored to our niche, also I could not find the way to integrate additional event tracking sending to Google Analytics but support team helped me to set up it.\n\nWhat problems is Dashly solving and how is that benefiting you?\nWe do not lose leads on our site from online chats bc we are using Dashly chatbots for now. We lost some of them before because of the time zone difference and our sales managers do not work 24/7. But at the moment we collect lead data and pre-qualify all leads we are getting from online chats.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "We set up Dashly on our site and got a new channel for our sales managers to generate leads for our company. I like that it was easy to implement Dashly codes to the site and that we have an all-in-one solution to communicate with our site visitors via online chat, pop-ups and chatbots."}, {"question": "What do you dislike about Dashly?", "answer": "Sometimes I can not find additional info in the knowledge base or samples of pop-ups tailored to our niche, also I could not find the way to integrate additional event tracking sending to Google Analytics but support team helped me to set up it."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "We do not lose leads on our site from online chats bc we are using Dashly chatbots for now. We lost some of them before because of the time zone difference and our sales managers do not work 24/7. But at the moment we collect lead data and pre-qualify all leads we are getting from online chats."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Artem A.", "reviewer_job_title": "CEO", "reviewer_link": "https://www.g2.com/users/55568ed9-cc26-4e0d-b693-3a9155951421"}, "publish_date": "2022-11-25T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7425130"}, {"review_id": 7420791, "review_title": "Dashly is a great platform for communication with customers.", "review_content": "What do you like best about Dashly?\nDashly is easily installed on the website and in the app. The service does not require technical knowledge. We get the service implementation with a personal manager who sets up the individual scenarios.\n\nWhat do you dislike about Dashly?\nThere were some articles in the knowledge base with irrelevant information. But the technical support answered our questions very quickly, and also changed the information in the knowledge base. That's cool.\n\nWhat problems is Dashly solving and how is that benefiting you?\nOur task was to increase the number of leads without attracting paid traffic to the site. The personal manager set up scenarios for us that helped attract more users (plus15%). One of the tools - user tracking allowed us to build personal communications with our users.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Dashly is easily installed on the website and in the app. The service does not require technical knowledge. We get the service implementation with a personal manager who sets up the individual scenarios."}, {"question": "What do you dislike about Dashly?", "answer": "There were some articles in the knowledge base with irrelevant information. But the technical support answered our questions very quickly, and also changed the information in the knowledge base. That's cool."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Our task was to increase the number of leads without attracting paid traffic to the site. The personal manager set up scenarios for us that helped attract more users (plus15%). One of the tools - user tracking allowed us to build personal communications with our users."}], "review_rating": 4.5, "reviewer": {"reviewer_name": "Gleb F.", "reviewer_job_title": "Director of Product Marketing", "reviewer_link": "https://www.g2.com/users/876c67a5-1777-433f-932d-6fcf0f554568"}, "publish_date": "2022-11-24T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7420791"}, {"review_id": 7596340, "review_title": "Dashly is good service for increasing conversion.", "review_content": "What do you like best about Dashly?\nWe installed Ashley to launch popups and personal communications. It didn't take us long to figure out the service, it was easy. I liked the pop-up constructor, which allows you to assemble a pop-up in 5 minutes.\n\nWhat do you dislike about Dashly?\nIf you need round-the-clock technical support, then there is none yet. But some of the answers can be found in the knowledge base. In addition, technical support responds quickly if you write during business hours.\n\nWhat problems is Dashly solving and how is that benefiting you?\nOur task was to launch popups and attract new customers. Thanks to Dashly, 13% of new customers have come to us. We sell 7% more weekly programs.We sell 7% more weekly programs, which increased revenue by 3%.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "We installed Ashley to launch popups and personal communications. It didn't take us long to figure out the service, it was easy. I liked the pop-up constructor, which allows you to assemble a pop-up in 5 minutes."}, {"question": "What do you dislike about Dashly?", "answer": "If you need round-the-clock technical support, then there is none yet. But some of the answers can be found in the knowledge base. In addition, technical support responds quickly if you write during business hours."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Our task was to launch popups and attract new customers. Thanks to Dashly, 13% of new customers have come to us. We sell 7% more weekly programs.We sell 7% more weekly programs, which increased revenue by 3%."}], "review_rating": 4.5, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2023-01-18T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7596340"}, {"review_id": 7708352, "review_title": "Impressive tool for marketing, support and sales", "review_content": "What do you like best about Dashly?\nIt brings conversations from different channels all in one location. Bringing in your email, live chat and social media discussions all in one place helps streamline your communication with your customers and leads. Has a mobile app for all your solopreneurs out there that need to handle everything on the move.\n\nWhat do you dislike about Dashly?\nHaven't used it long enough to find anything I particularly dislike.\n\nWhat problems is Dashly solving and how is that benefiting you?\nI was looking to handle all emails from clients and leads in one plus able to provide marketing, onboarding automations and live chat when I'm available. Dashly checks the boxes for all of this and at an affordable price.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "It brings conversations from different channels all in one location. Bringing in your email, live chat and social media discussions all in one place helps streamline your communication with your customers and leads. Has a mobile app for all your solopreneurs out there that need to handle everything on the move."}, {"question": "What do you dislike about Dashly?", "answer": "Haven't used it long enough to find anything I particularly dislike."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "I was looking to handle all emails from clients and leads in one plus able to provide marketing, onboarding automations and live chat when I'm available. Dashly checks the boxes for all of this and at an affordable price."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Darrin R.", "reviewer_job_title": "Founder", "reviewer_link": "https://www.g2.com/users/be1947f6-d8dc-4251-a2b3-4a3c6cd3d0e8"}, "publish_date": "2023-02-13T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7708352"}, {"review_id": 7498389, "review_title": "Dashly is great conversation marketing platform", "review_content": "What do you like best about Dashly?\nThe first thing we would like to note is Dashly support team. Thanks a lot for their efficiency in solving our issues. The service is very simple and intuitive in usage. We managed to install everything we needed in a few minutes: chatbots, pop-ups and etc. There are ready-made templates which simplifies the configuration of the service.\n\nWhat do you dislike about Dashly?\nSometimes we found materials that are outdated, however support team solve our problems and create new articles that we can use.\n\nWhat problems is Dashly solving and how is that benefiting you?\nWith the help of Dashly tools we have already increased the conversion rate by 13%", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "The first thing we would like to note is Dashly support team. Thanks a lot for their efficiency in solving our issues. The service is very simple and intuitive in usage. We managed to install everything we needed in a few minutes: chatbots, pop-ups and etc. There are ready-made templates which simplifies the configuration of the service."}, {"question": "What do you dislike about Dashly?", "answer": "Sometimes we found materials that are outdated, however support team solve our problems and create new articles that we can use."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "With the help of Dashly tools we have already increased the conversion rate by 13%"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Anna P.", "reviewer_job_title": "Digital Marketing Manager", "reviewer_link": "https://www.g2.com/users/a529c1da-b993-4bd2-a817-148eb99b16dd"}, "publish_date": "2022-12-15T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7498389"}, {"review_id": 7707524, "review_title": "Very nice tool", "review_content": "What do you like best about Dashly?\nDashly is a very intuitive, powerful tool. I am impressed with how well the chatbot builder works.\n\nWhat do you dislike about Dashly?\nA lot of features come at an extra cost but are well refined.\n\nWhat problems is Dashly solving and how is that benefiting you?\nI use the tool to automate chat on the website and keep all communication in one place.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Dashly is a very intuitive, powerful tool. I am impressed with how well the chatbot builder works."}, {"question": "What do you dislike about Dashly?", "answer": "A lot of features come at an extra cost but are well refined."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "I use the tool to automate chat on the website and keep all communication in one place."}], "review_rating": 4.0, "reviewer": {"reviewer_name": "Kamil K.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/c0adf767-e0c4-411c-a112-79245e4a8184"}, "publish_date": "2023-02-13T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7707524"}, {"review_id": 7763040, "review_title": "Great service with top tier customer support and guidance", "review_content": "What do you like best about Dashly?\nThe staff are very hands on to help you get the most out of the product.\n\nWhat do you dislike about Dashly?\nSome parts of what you are getting in your package seem confusing.\n\nWhat problems is Dashly solving and how is that benefiting you?\nHelps with potential customers for my services to feel valued and helped.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "The staff are very hands on to help you get the most out of the product."}, {"question": "What do you dislike about Dashly?", "answer": "Some parts of what you are getting in your package seem confusing."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Helps with potential customers for my services to feel valued and helped."}], "review_rating": 4.5, "reviewer": {"reviewer_name": "Suleiman L.", "reviewer_job_title": "Managing Director", "reviewer_link": "https://www.g2.com/users/372d36e8-38e4-44fc-b345-e23384d8c971"}, "publish_date": "2023-02-25T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7763040"}, {"review_id": 7714988, "review_title": "LOVE Dashly.", "review_content": "What do you like best about Dashly?\nSuper easy to use, very intuitive.  It was really easy to set up ad get running.\n\nWhat do you dislike about Dashly?\nNot much, to be honest.  It works exactly like I need it to!\n\nWhat problems is Dashly solving and how is that benefiting you?\nThe quicker you are to answer a customer's question, the more likely they are to buy!", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Super easy to use, very intuitive.  It was really easy to set up ad get running."}, {"question": "What do you dislike about Dashly?", "answer": "Not much, to be honest.  It works exactly like I need it to!"}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "The quicker you are to answer a customer's question, the more likely they are to buy!"}], "review_rating": 4.5, "reviewer": {"reviewer_name": "Gia V.", "reviewer_job_title": "Business Ops and Systems Strategist", "reviewer_link": "https://www.g2.com/users/254038f6-e06f-47e6-a473-2244a7b4431a"}, "publish_date": "2023-02-14T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7714988"}, {"review_id": 7382974, "review_title": "Affordable Intercom alternative", "review_content": "What do you like best about Dashly?\n1.Affordable prices compare to Intercom.\n2.Mobile application for customer support agents. It was unbearable for us to pay for (Intercom) all leads coming to website so we start looking for a  alternative, most of competitors doesn't have a mobile app. So we were happy when found Dashly.\n\nIt helps us to engage website visitors and turn them to trial users.\n\nWhat do you dislike about Dashly?\nOur team used to like Intercom design and feel. So it was a little compromise to us learn a new tool.\n\nWhat problems is Dashly solving and how is that benefiting you?\nIncreasing conversion from webiste visitors to sign ups", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "1.Affordable prices compare to Intercom.\n2.Mobile application for customer support agents. It was unbearable for us to pay for (Intercom) all leads coming to website so we start looking for a  alternative, most of competitors doesn't have a mobile app. So we were happy when found Dashly.\n\nIt helps us to engage website visitors and turn them to trial users."}, {"question": "What do you dislike about Dashly?", "answer": "Our team used to like Intercom design and feel. So it was a little compromise to us learn a new tool."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Increasing conversion from webiste visitors to sign ups"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Timur C.", "reviewer_job_title": "CEO", "reviewer_link": "https://www.g2.com/users/dceff04f-c7cf-412f-8fe7-226fc4426fdb"}, "publish_date": "2022-11-17T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7382974"}, {"review_id": 7696171, "review_title": "New user but great so far!", "review_content": "What do you like best about Dashly?\nAdding Dashly has made my website more available to potential clients spread around the country. I love the bots and being able to create pop-ups really allows me to get visitor's attention.\n\nWhat do you dislike about Dashly?\nThere isn't a lot to dislike so far. Coming from an entrepruner point of view there is a small learning curve understanding the concepts, but I don't think that is on the software.\n\nWhat problems is Dashly solving and how is that benefiting you?\nAutomating part of the sales funnel will help a small team that is already spread thin.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Adding Dashly has made my website more available to potential clients spread around the country. I love the bots and being able to create pop-ups really allows me to get visitor's attention."}, {"question": "What do you dislike about Dashly?", "answer": "There isn't a lot to dislike so far. Coming from an entrepruner point of view there is a small learning curve understanding the concepts, but I don't think that is on the software."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Automating part of the sales funnel will help a small team that is already spread thin."}], "review_rating": 4.5, "reviewer": {"reviewer_name": "Joe S.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/002417ce-9d4b-49dc-8d5b-373e3986528a"}, "publish_date": "2023-02-09T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7696171"}, {"review_id": 7345692, "review_title": "Dashly is conversational disrupter for my team!", "review_content": "What do you like best about Dashly?\nGreat tool for conversation with my business clients and managing our sales funnel. Awesome amount of integration from WordPress to WharsApp, Slack and Telegram.\n\nWhat do you dislike about Dashly?\nHuge amount of integration is great but we need more automatisation inside chats for growth of our sales team capacity. I want some AI inside chats for both, my team and clients help.\n\nWhat problems is Dashly solving and how is that benefiting you?\nCommunication with our business customers and leads about our product features and increased capacity of sales team with chat automation. Fast integration in sales funnel. Sales growth!", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Great tool for conversation with my business clients and managing our sales funnel. Awesome amount of integration from WordPress to WharsApp, Slack and Telegram."}, {"question": "What do you dislike about Dashly?", "answer": "Huge amount of integration is great but we need more automatisation inside chats for growth of our sales team capacity. I want some AI inside chats for both, my team and clients help."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Communication with our business customers and leads about our product features and increased capacity of sales team with chat automation. Fast integration in sales funnel. Sales growth!"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Aleksei D.", "reviewer_job_title": "CVO", "reviewer_link": "https://www.g2.com/users/aleksei_dolgikh-glocal_seo"}, "publish_date": "2022-11-16T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7345692"}, {"review_id": 7833309, "review_title": "Dashly, a great all in one tool for businesses", "review_content": "What do you like best about Dashly?\nEase of use, efficient website, easy to understand\n\nWhat do you dislike about Dashly?\nmore customization options for the widget would be appreciated\n\nWhat problems is Dashly solving and how is that benefiting you?\nBeing able to respond to customers constantly", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Ease of use, efficient website, easy to understand"}, {"question": "What do you dislike about Dashly?", "answer": "more customization options for the widget would be appreciated"}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Being able to respond to customers constantly"}], "review_rating": 4.5, "reviewer": {"reviewer_name": "Tim C.", "reviewer_job_title": "Founder", "reviewer_link": "https://www.g2.com/users/314cba9e-8618-477c-a18e-25ec0687edee"}, "publish_date": "2023-03-15T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7833309"}, {"review_id": 7737484, "review_title": "Great all-in-one sales and customer support platform!", "review_content": "What do you like best about Dashly?\nThe customer support was spot on, helping to ensure that Dashly was a good fit for our needs.  Within minutes I had my new chat widget live on my site.\n\nWhat do you dislike about Dashly?\nThere were a few minor bugs of which they were able to resolve fairly quickly.\n\nWhat problems is Dashly solving and how is that benefiting you?\nDashly solved two challenges.  First was communicating with website leads interested in our product.  Second was after-sale support for customers.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "The customer support was spot on, helping to ensure that Dashly was a good fit for our needs.  Within minutes I had my new chat widget live on my site."}, {"question": "What do you dislike about Dashly?", "answer": "There were a few minor bugs of which they were able to resolve fairly quickly."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Dashly solved two challenges.  First was communicating with website leads interested in our product.  Second was after-sale support for customers."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Mark T.", "reviewer_job_title": "Co-Founder", "reviewer_link": "https://www.g2.com/users/0791baee-1d66-4c4b-bbfa-393736349bc7"}, "publish_date": "2023-02-20T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7737484"}, {"review_id": 7380061, "review_title": "Cool marketing platform for conversations", "review_content": "What do you like best about Dashly?\nWant to say thanks to the Support managers for their work with me in understanding the features. It appeared to be easy to install everything and by using templates, works well without any problem! We now collect all the messages in one-window which is very easy and fast to manage\n\nWhat do you dislike about Dashly?\nI'd be happy to have more articles and materials in the Help Center to be more independent in the Support in case of problems. Hope you'll do this in the nearest future\n\nWhat problems is Dashly solving and how is that benefiting you?\nDon't losing dialogues which had place before, now we can answer several times faster to our clients that leads to higher conversions from traffic to qualified leads and sales", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Want to say thanks to the Support managers for their work with me in understanding the features. It appeared to be easy to install everything and by using templates, works well without any problem! We now collect all the messages in one-window which is very easy and fast to manage"}, {"question": "What do you dislike about Dashly?", "answer": "I'd be happy to have more articles and materials in the Help Center to be more independent in the Support in case of problems. Hope you'll do this in the nearest future"}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Don't losing dialogues which had place before, now we can answer several times faster to our clients that leads to higher conversions from traffic to qualified leads and sales"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Nadya K.", "reviewer_job_title": "Head of Marketing", "reviewer_link": "https://www.g2.com/users/e58483e5-04ec-4b5f-97fb-d711da98a36a"}, "publish_date": "2022-11-17T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7380061"}, {"review_id": 7758204, "review_title": "Best ever event based marketing tool", "review_content": "What do you like best about Dashly?\nGoog tool to increase convertion, event-based analytics\n\nWhat do you dislike about Dashly?\nonly one provider for whatsapp business api\n\nWhat problems is Dashly solving and how is that benefiting you?\nGood tool to start with for event-based marketing and analysis", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Goog tool to increase convertion, event-based analytics"}, {"question": "What do you dislike about Dashly?", "answer": "only one provider for whatsapp business api"}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Good tool to start with for event-based marketing and analysis"}], "review_rating": 4.0, "reviewer": {"reviewer_name": "Daniel Y.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/54c162c9-07b0-4e40-8662-2fa8a4ccd12e"}, "publish_date": "2023-02-23T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7758204"}, {"review_id": 7738256, "review_title": "Dashly - - -Easy to Setup and Use", "review_content": "What do you like best about Dashly?\nDashly is very easy to setup and use. Also - if you get stuck anywhere they have a fantastic how to section and also operators to answer your question live or via email.\n\nWhat do you dislike about Dashly?\nHaven't found anything that I don't like yet at this time.\n\nWhat problems is Dashly solving and how is that benefiting you?\nHelping to respond to potential clients with quick information or links to FAQ, price sheet request, and so forth.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Dashly is very easy to setup and use. Also - if you get stuck anywhere they have a fantastic how to section and also operators to answer your question live or via email."}, {"question": "What do you dislike about Dashly?", "answer": "Haven't found anything that I don't like yet at this time."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Helping to respond to potential clients with quick information or links to FAQ, price sheet request, and so forth."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Chris B.", "reviewer_job_title": "Owner", "reviewer_link": "https://www.g2.com/users/a80ee674-31ca-44a3-96f7-100e51fcc94f"}, "publish_date": "2023-02-20T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7738256"}, {"review_id": 7355729, "review_title": "Nice alternative to a huge and expensive marketing tools", "review_content": "What do you like best about Dashly?\nEasy to install on my site. The support team is good, helped with several things I stumbled on. We launched chatbots and pop-ups quickly. Ready-to-use templates are good for a quick start.\n\nWhat do you dislike about Dashly?\nSome of the material in the knowledge base is out of date. But support covers this more than enough.\n\nWhat problems is Dashly solving and how is that benefiting you?\n1. Increase the conversion rate of the site into qualified leads. And pass them on to sales.\n2. Collect all customer dialogues in one window and improve support. We now respond 3 times faster and don't lose dialogs.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Easy to install on my site. The support team is good, helped with several things I stumbled on. We launched chatbots and pop-ups quickly. Ready-to-use templates are good for a quick start."}, {"question": "What do you dislike about Dashly?", "answer": "Some of the material in the knowledge base is out of date. But support covers this more than enough."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "1. Increase the conversion rate of the site into qualified leads. And pass them on to sales.\n2. Collect all customer dialogues in one window and improve support. We now respond 3 times faster and don't lose dialogs."}], "review_rating": 4.5, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2022-11-14T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7355729"}, {"review_id": 7479882, "review_title": "Good service for conversation marketing", "review_content": "What do you like best about Dashly?\nIt was super easy to launch popups and set up a chatbot. I also liked that the history of on-site user behavior is stored in the system to help make more personalized offers.\n\nWhat do you dislike about Dashly?\nA few times, I had to wait for an answer from the support for several hours as their shifts cover 15 hours/day. But in most cases, I can find answers to questions in their knowledge base.\n\nWhat problems is Dashly solving and how is that benefiting you?\nWith their help, we wanted to increase the number of registrations in the service without buying additional traffic. And it worked: communications via popups and emailing helped us increase the number of registrations by 17% per month.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "It was super easy to launch popups and set up a chatbot. I also liked that the history of on-site user behavior is stored in the system to help make more personalized offers."}, {"question": "What do you dislike about Dashly?", "answer": "A few times, I had to wait for an answer from the support for several hours as their shifts cover 15 hours/day. But in most cases, I can find answers to questions in their knowledge base."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "With their help, we wanted to increase the number of registrations in the service without buying additional traffic. And it worked: communications via popups and emailing helped us increase the number of registrations by 17% per month."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2022-12-09T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7479882"}, {"review_id": 7773403, "review_title": "A good way to manage customer conversations and boost conversion of visitors", "review_content": "What do you like best about Dashly?\nVery easy to set up and get operational.\n\nWhat do you dislike about Dashly?\nAll aspects of the platform are separated out into their own cost\n\nWhat problems is Dashly solving and how is that benefiting you?\nInteracting with web visitors and customer support", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Very easy to set up and get operational."}, {"question": "What do you dislike about Dashly?", "answer": "All aspects of the platform are separated out into their own cost"}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Interacting with web visitors and customer support"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Louis N.", "reviewer_job_title": "Founder", "reviewer_link": "https://www.g2.com/users/50d2c0f1-374d-45ad-b4bc-283e04834ba2"}, "publish_date": "2023-02-28T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7773403"}, {"review_id": 7432786, "review_title": "Our team uses it and is very happy", "review_content": "What do you like best about Dashly?\nIt's familiar to our users and the team members like it. Fair price\n\nWhat do you dislike about Dashly?\nWe don't have bad experience with the platform.\n\nWhat problems is Dashly solving and how is that benefiting you?\nConnecting support and users in easy seamless way. Growth of conversion ratio of a website", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "It's familiar to our users and the team members like it. Fair price"}, {"question": "What do you dislike about Dashly?", "answer": "We don't have bad experience with the platform."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Connecting support and users in easy seamless way. Growth of conversion ratio of a website"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Maxim P.", "reviewer_job_title": "Chief Executive Officer", "reviewer_link": "https://www.g2.com/users/c98733bd-2420-4fd7-a8f9-e4022eeea57c"}, "publish_date": "2022-11-28T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-7432786"}, {"review_id": 6543675, "review_title": "Great product for SaaS", "review_content": "What do you like best about Dashly?\nWe've been looking for ways to improve our online business by generating more leads and automating our sales funnel - and thankfully we found Dashly! It's a great marketing tool that brings all the conversations from different channels together and stores that user data and chat history in one place - live chat, emails, messengers and social media interactions - all there! It comes with a pop-ups builder, triggered campaigns, lead database and more which allows you to reach out to your users easily. Would highly recommend!\n\nWhat do you dislike about Dashly?\nDashly doesn't have 24hr support but they still reply pretty fast to my inquiries.\n\nWhat problems is Dashly solving and how is that benefiting you?\nSee above :)", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "We've been looking for ways to improve our online business by generating more leads and automating our sales funnel - and thankfully we found Dashly! It's a great marketing tool that brings all the conversations from different channels together and stores that user data and chat history in one place - live chat, emails, messengers and social media interactions - all there! It comes with a pop-ups builder, triggered campaigns, lead database and more which allows you to reach out to your users easily. Would highly recommend!"}, {"question": "What do you dislike about Dashly?", "answer": "Dashly doesn't have 24hr support but they still reply pretty fast to my inquiries."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "See above :)"}], "review_rating": 4.5, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2022-04-26T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-6543675"}, {"review_id": 4778650, "review_title": "Dashly Review", "review_content": "What do you like best about Dashly?\nBecause of Dashly live chat and mailing system, I can build rapport with my clients and increase my profit\n\nWhat do you dislike about Dashly?\nNA nothing to dislike, every thing is up to the mark\n\nRecommendations to others considering Dashly:\nYou should try Dashly for your business and definitely you will see the change. You will get more customers and increase your profits\n\nWhat problems is Dashly solving and how is that benefiting you?\nThey are very active with online groups which helps me to get good customer service. I can easily chat with my customers and resolve their issues", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Because of Dashly live chat and mailing system, I can build rapport with my clients and increase my profit"}, {"question": "What do you dislike about Dashly?", "answer": "NA nothing to dislike, every thing is up to the mark"}, {"question": "Recommendations to others considering Dashly:", "answer": "You should try Dashly for your business and definitely you will see the change. You will get more customers and increase your profits"}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "They are very active with online groups which helps me to get good customer service. I can easily chat with my customers and resolve their issues"}], "review_rating": 4.5, "reviewer": {"reviewer_name": "KOMAL K T.", "reviewer_job_title": "Sales Consultant", "reviewer_link": "https://www.g2.com/users/2f787ab3-aa47-465d-998a-a3085abde308"}, "publish_date": "2021-06-02T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-4778650"}, {"review_id": 4905625, "review_title": "Dashly Review", "review_content": "What do you like best about Dashly?\nI love the ease of use in communicating with clients with the live chat.\n\nWhat do you dislike about Dashly?\nThe note boxes can be a bit finicky. Other than that, no complaints!\n\nWhat problems is Dashly solving and how is that benefiting you?\nI can easily communicate with clients in an informal way instead of having to send a formal email or call.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "I love the ease of use in communicating with clients with the live chat."}, {"question": "What do you dislike about Dashly?", "answer": "The note boxes can be a bit finicky. Other than that, no complaints!"}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "I can easily communicate with clients in an informal way instead of having to send a formal email or call."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2021-08-02T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-4905625"}, {"review_id": 4468987, "review_title": "Dashly chat system connects with facebook.", "review_content": "What do you like best about Dashly?\nOne central hub where I can chat with facebook users and website visitors. We can save side notes and inter chat with team on clients chat window without the client reading chat notes within the team.\n\nWhat do you dislike about Dashly?\nCan't edit chats after submission on facebook threads only. Would like to have a bit more freedom with the note boxes.\n\nRecommendations to others considering Dashly:\nOVer the past 2 years we've used several other chat bot options and Dashly is by far the best bang for your buck, hands down.\n\nWhat problems is Dashly solving and how is that benefiting you?\nWe primarily use it to support clients and their issues with our software, including other tech issues they may encounter. We essentially use it as our support ticketing system as it directly connects with our facebook page, website and email.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "One central hub where I can chat with facebook users and website visitors. We can save side notes and inter chat with team on clients chat window without the client reading chat notes within the team."}, {"question": "What do you dislike about Dashly?", "answer": "Can't edit chats after submission on facebook threads only. Would like to have a bit more freedom with the note boxes."}, {"question": "Recommendations to others considering Dashly:", "answer": "OVer the past 2 years we've used several other chat bot options and Dashly is by far the best bang for your buck, hands down."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "We primarily use it to support clients and their issues with our software, including other tech issues they may encounter. We essentially use it as our support ticketing system as it directly connects with our facebook page, website and email."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2020-11-12T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-4468987"}, {"review_id": 4269882, "review_title": "It covered sales, support, and nurturing communications", "review_content": "What do you like best about Dashly?\nNo code required. I could fire triggered pop-ups after a particular event or on a special page without waiting for the development team for years to map new events. Dashly has its own event mapping tool. That saves a lot of time and help to start experiments on my own.\n\nWhat do you dislike about Dashly?\nIt is not a con of Dashly. It is more about our specific way of development website to improve SEO. We had our website as a one-page application. Initially Dashly cold does not track the page visiting events, but Dashly customer support team provided a line of code to start tracking this. It is a win and I like it.\n\nWhat problems is Dashly solving and how is that benefiting you?\nWe had Intercom before, but Dashly does the same things easier (no code) and more affordable. During the demo call, I pointed out that Dashly will be useful to test the lead capturing pop-ups for new visitors from paid ads. I had to wait for years for my dev team to map new events in Intercom. To sum up, these are the benefits:\nNo code skills required to start\nAll-in-one plan allows you to use only one product to collect the leads and then nurture them.\nAffordable price. In intercom, we use only chat for more than $100. Here we have the whole set of features.\nThe sales team confirmed Dashly. Live chat works well. Chat assignment with notes makes the teamwork better.\n\nAs a result, we collected 2x more leads in the past 2 months. Dashly has launched chatbot not long ago. It is a good addition to our lead capturing scenario.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "No code required. I could fire triggered pop-ups after a particular event or on a special page without waiting for the development team for years to map new events. Dashly has its own event mapping tool. That saves a lot of time and help to start experiments on my own."}, {"question": "What do you dislike about Dashly?", "answer": "It is not a con of Dashly. It is more about our specific way of development website to improve SEO. We had our website as a one-page application. Initially Dashly cold does not track the page visiting events, but Dashly customer support team provided a line of code to start tracking this. It is a win and I like it."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "We had Intercom before, but Dashly does the same things easier (no code) and more affordable. During the demo call, I pointed out that Dashly will be useful to test the lead capturing pop-ups for new visitors from paid ads. I had to wait for years for my dev team to map new events in Intercom. To sum up, these are the benefits:\nNo code skills required to start\nAll-in-one plan allows you to use only one product to collect the leads and then nurture them.\nAffordable price. In intercom, we use only chat for more than $100. Here we have the whole set of features.\nThe sales team confirmed Dashly. Live chat works well. Chat assignment with notes makes the teamwork better.\n\nAs a result, we collected 2x more leads in the past 2 months. Dashly has launched chatbot not long ago. It is a good addition to our lead capturing scenario."}], "review_rating": 4.5, "reviewer": {"reviewer_name": "Dmitry C.", "reviewer_job_title": "Chief Marketing Officer", "reviewer_link": "https://www.g2.com/users/90c27989-4160-4326-b2d1-6fe90c595417"}, "publish_date": "2020-06-23T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-4269882"}, {"review_id": 4455171, "review_title": "Great potential for leads and user interaction!", "review_content": "What do you like best about Dashly?\nDashly has great chat features and it's has a feature that allows us to understand what attracts more people to our site. While it still has improvements to make, it has helped us reach our numbers and understand what our members are looking for. Overall, it really has helped us improve our organization.\n\nWhat do you dislike about Dashly?\nIt still has improvements that it could work on. For example, it doesn't have many integration features and it slows our servers down.\n\nRecommendations to others considering Dashly:\nIt's a tool with great potential and will help your company grow.\n\nWhat problems is Dashly solving and how is that benefiting you?\nFinding ways to improve our member flow. It also helps us keep in communication with them.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Dashly has great chat features and it's has a feature that allows us to understand what attracts more people to our site. While it still has improvements to make, it has helped us reach our numbers and understand what our members are looking for. Overall, it really has helped us improve our organization."}, {"question": "What do you dislike about Dashly?", "answer": "It still has improvements that it could work on. For example, it doesn't have many integration features and it slows our servers down."}, {"question": "Recommendations to others considering Dashly:", "answer": "It's a tool with great potential and will help your company grow."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Finding ways to improve our member flow. It also helps us keep in communication with them."}], "review_rating": 4.0, "reviewer": {"reviewer_name": "Daybelis G.", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "https://www.g2.com/users/15aefa20-8c56-4399-88b6-2493d0f93354"}, "publish_date": "2020-11-05T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-4455171"}, {"review_id": 4673923, "review_title": "Reliable and professional", "review_content": "What do you like best about Dashly?\nApp features such as receiving all conversation in one app.\n\nWhat do you dislike about Dashly?\nNo particular features or aspects to dislike\n\nWhat problems is Dashly solving and how is that benefiting you?\nThe combination of communications all in one place and source offers convenience and the benefit of efficiency.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "App features such as receiving all conversation in one app."}, {"question": "What do you dislike about Dashly?", "answer": "No particular features or aspects to dislike"}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "The combination of communications all in one place and source offers convenience and the benefit of efficiency."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2021-04-23T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-4673923"}, {"review_id": 4065062, "review_title": "A Solid All in One Tool to Boost your Marketing and Offer Live Chat for your Site", "review_content": "What do you like best about Dashly?\nThe Integration with our Ecommerce and the fact that it offers both drip email automation and live chat. The Android app is good and workd great!\nLast : their Support is simply AMAZING\nI had some time and was not fully aware of how to make the automation works and spent like 1 hour with their support online asking also the most silly questions and they were ALWAYS :\n-Helpful\n-Prompt\n-Friendly and Professional\n\nWhat do you dislike about Dashly?\nAt start it takes some time to understand (at least for me) the automation behind the auto messages. I think it's related to the fact that also the software has API and can give a real \"control\" over the events and all the connected functions.\n\nRecommendations to others considering Dashly:\nThere is a learning curve to keep in mind. but the tool is working and the team behind is very prepared to help and support. check the features and if it fits your needs buy as it's great!\n\nWhat problems is Dashly solving and how is that benefiting you?\nDrip automation email, marketing to be implemented with our prestashop ecommerce. Finally we can have a chat system in place along with a lead function that seamessly integrates with our site.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "The Integration with our Ecommerce and the fact that it offers both drip email automation and live chat. The Android app is good and workd great!\nLast : their Support is simply AMAZING\nI had some time and was not fully aware of how to make the automation works and spent like 1 hour with their support online asking also the most silly questions and they were ALWAYS :\n-Helpful\n-Prompt\n-Friendly and Professional"}, {"question": "What do you dislike about Dashly?", "answer": "At start it takes some time to understand (at least for me) the automation behind the auto messages. I think it's related to the fact that also the software has API and can give a real \"control\" over the events and all the connected functions."}, {"question": "Recommendations to others considering Dashly:", "answer": "There is a learning curve to keep in mind. but the tool is working and the team behind is very prepared to help and support. check the features and if it fits your needs buy as it's great!"}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Drip automation email, marketing to be implemented with our prestashop ecommerce. Finally we can have a chat system in place along with a lead function that seamessly integrates with our site."}], "review_rating": 4.5, "reviewer": {"reviewer_name": "Fabrizio S.", "reviewer_job_title": "Web Developer", "reviewer_link": "https://www.g2.com/users/10ad68ed-cf93-49f1-86b5-50746ed66e32"}, "publish_date": "2020-01-25T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-4065062"}, {"review_id": 4498856, "review_title": "dashly is ultimate marketing automation tool", "review_content": "What do you like best about Dashly?\ndashly is very economical and consumer centric  and very authentic software  for alsmes and big corporations\n\nWhat do you dislike about Dashly?\nnothing only it needs upgrades and new application and technologies to be implicated\n\nRecommendations to others considering Dashly:\na must use and implement dashfly marketing automation for your needs and improve topline and revenue\n\nWhat problems is Dashly solving and how is that benefiting you?\nmarketing automation like internet marketing and internet blitz  campaign at the switch of mouse and cursor", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "dashly is very economical and consumer centric  and very authentic software  for alsmes and big corporations"}, {"question": "What do you dislike about Dashly?", "answer": "nothing only it needs upgrades and new application and technologies to be implicated"}, {"question": "Recommendations to others considering Dashly:", "answer": "a must use and implement dashfly marketing automation for your needs and improve topline and revenue"}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "marketing automation like internet marketing and internet blitz  campaign at the switch of mouse and cursor"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2020-11-30T00:00:00", "reviewer_company_size": "Mid-Market(51-1000 emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-4498856"}, {"review_id": 3510459, "review_title": "Live chat for website that does not let your site speed performance down", "review_content": "What do you like best about Dashly?\nThe first impression when I use Dashly is this live chat tool does not let your site speed performance down. The speed of a load of this tool is really fast when you put it on your site. Other Pros that I know are much-much more, but what I also really like about Dashly this tool can trigger auto message chat or pop-up for a done event that the customer did on your website. Ex: your customer has bought for a product on your site so Dashly can track it and can give auto gratitude for your customer.\n\nWhat do you dislike about Dashly?\nI love many features on Dashly but one con that I get is on support, maybe this is because of the time differential. But overall the answers from the support are really great.\n\nRecommendations to others considering Dashly:\nMust have live chat if you do not like to decrease your site performance and want to get more engagement and success deals on your website.\n\nWhat problems is Dashly solving and how is that benefiting you?\nDashly solve speed issues when you have live chat for your site and also this tool can increase good engagement to the customers we had.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "The first impression when I use Dashly is this live chat tool does not let your site speed performance down. The speed of a load of this tool is really fast when you put it on your site. Other Pros that I know are much-much more, but what I also really like about Dashly this tool can trigger auto message chat or pop-up for a done event that the customer did on your website. Ex: your customer has bought for a product on your site so Dashly can track it and can give auto gratitude for your customer."}, {"question": "What do you dislike about Dashly?", "answer": "I love many features on Dashly but one con that I get is on support, maybe this is because of the time differential. But overall the answers from the support are really great."}, {"question": "Recommendations to others considering Dashly:", "answer": "Must have live chat if you do not like to decrease your site performance and want to get more engagement and success deals on your website."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Dashly solve speed issues when you have live chat for your site and also this tool can increase good engagement to the customers we had."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Muhammad I.", "reviewer_job_title": "Web Designer & WP Developer", "reviewer_link": "https://www.g2.com/users/d13f750a-5f31-4b06-833b-4b9f2c74bc27"}, "publish_date": "2019-10-26T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-3510459"}, {"review_id": 3381429, "review_title": "This company is going places. ", "review_content": "What do you like best about Dashly?\nThey have Live chat, but that's only the tip of the iceberg, you get visitor tracking, personalized messages (example they find out where the user typed in the name and continue using that name for all messages) making the user feel like they are already part of the family, also in-app as in phone apps chat (huge feature that very few chat apps have via SDK), it has targeting, segmentation, pretty much anything that you need, so instead of needing many apps you just need Dashly. Very good customer service. This software is going places.\n\nWhat do you dislike about Dashly?\nI haven't found any dislikes just yet on it.\n\nWhat problems is Dashly solving and how is that benefiting you?\nChat, In-App Chat, Popups, Segmentation, Tracking", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "They have Live chat, but that's only the tip of the iceberg, you get visitor tracking, personalized messages (example they find out where the user typed in the name and continue using that name for all messages) making the user feel like they are already part of the family, also in-app as in phone apps chat (huge feature that very few chat apps have via SDK), it has targeting, segmentation, pretty much anything that you need, so instead of needing many apps you just need Dashly. Very good customer service. This software is going places."}, {"question": "What do you dislike about Dashly?", "answer": "I haven't found any dislikes just yet on it."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "Chat, In-App Chat, Popups, Segmentation, Tracking"}], "review_rating": 5.0, "reviewer": {"reviewer_name": "NOT GIVEN", "reviewer_job_title": "NOT GIVEN", "reviewer_link": "NOT GIVEN"}, "publish_date": "2019-10-08T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-3381429"}, {"review_id": 1852190, "review_title": "Absolutely satisfied!", "review_content": "What do you like best about Dashly?\nDashly had me approach customer success strategy at a whole new angle. Besides being super-useful in terms of having all the stats under your fingertips, it integrates all the tools you need to understand user's needs and deliver accordingly. Besides functionalities, they really have extraordinary customer support.\n\nWhat do you dislike about Dashly?\nWell, not much.\nGetting through Knowledge base may seem overwhelming at first, but Dashly has a great support team and they really got your back.\n\nRecommendations to others considering Dashly:\nFull recommendation for all kinds of businesses, big or small.\n\nWhat problems is Dashly solving and how is that benefiting you?\nIf I have to isolate 1 thing, I'd say tracking because it is the most important thing when you have a lot of users. Reaching all your users and customizing everything is also a piece of cake here.", "review_question_answers": [{"question": "What do you like best about Dashly?", "answer": "Dashly had me approach customer success strategy at a whole new angle. Besides being super-useful in terms of having all the stats under your fingertips, it integrates all the tools you need to understand user's needs and deliver accordingly. Besides functionalities, they really have extraordinary customer support."}, {"question": "What do you dislike about Dashly?", "answer": "Well, not much.\nGetting through Knowledge base may seem overwhelming at first, but Dashly has a great support team and they really got your back."}, {"question": "Recommendations to others considering Dashly:", "answer": "Full recommendation for all kinds of businesses, big or small."}, {"question": "What problems is Dashly solving and how is that benefiting you?", "answer": "If I have to isolate 1 thing, I'd say tracking because it is the most important thing when you have a lot of users. Reaching all your users and customizing everything is also a piece of cake here."}], "review_rating": 5.0, "reviewer": {"reviewer_name": "Marina H.", "reviewer_job_title": "Customer success manager", "reviewer_link": "https://www.g2.com/users/aa1827fa-53a6-4643-ab58-5da87bf7df5d"}, "publish_date": "2019-02-28T00:00:00", "reviewer_company_size": "Small-Business(50 or fewer emp.)", "video_link": null, "review_link": "https://www.g2.com/products/dashly/reviews/dashly-review-1852190"}]}, "error": null}